[
  "Donald Trump has spent more than $1 million on electoral research for a potential presidential run in 2016.",
  "Sources said the tough-talking “Celebrity Apprentice” host is increasingly being asked to speak at Republican events, and he appeared at the Oakland County Republican Party Lincoln Day Dinner in Novi, Mich., last week to a record crowd of 2,300.",
  "“Everybody tells me, ‘Please run for president.",
  "Please run for president.’ I would be much happier if a great and competent person came along,” Trump reportedly told attendees.",
  "“I’d be happy if President Obama did a great job.",
  "I’m a Republican, but before anything, I love this country.",
  "I would love to see somebody come in who is going to be great.”\n\nTrump considered a run for the White House last year against Obama, but ultimately didn’t enter the race, instead making his attention-grabbing $5 million offer to the president to turn over his birth records.",
  "And when asked if he’d consider a political run, Trump recently said it was “highly unlikely.”\n\nBut Michael Cohen, executive vice president and special counsel to Trump, told us they commissioned the $1 million in research into Trump’s standing in each state, and to gauge those he would need to win over.",
  "“The electoral research was commissioned.",
  "We did not spend $1 million on this research for it just to sit on my bookshelf,” Cohen said.",
  "“At this point Mr. Trump has not made any decision on a political run, but what I would say is that he is exactly what this country needs.",
  "The turnout at these political speeches indicates his following remains very strong and is growing.“\n\nHe added that by law, if Trump ran for the presidency or any government office, “He would be required to turn over control of his company either to one or all of his children or to a trust.”\n\nIn his Michigan speech, Trump predicted Hillary Clinton would be the Democratic front-runner, and that if Republicans “don’t pick the right person, it will be a landslide.”"
]