[
  "KIEV (Reuters) - Here is a timeline of the fall of Ukraine’s government and Russia’s subsequent incursion into Ukraine’s Crimea region.",
  "Ukrainian navy ships are docked at the Crimean port of Yevpatorya March 8, 2014.",
  "REUTERS/David Mdzinarishvili\n\nThe crisis began in November when Ukraine’s then president, Viktor Yanukovich, under Russian pressure, turned his back on a trade deal with the EU and accepted a $15 billion bailout from Moscow.",
  "That prompted three months of street protests, leading to the overthrow of Yanukovich on February 22.",
  "Moscow denounced the events as an illegitimate coup and refused to recognize the new Ukrainian authorities.",
  "In late February, Russian troops seized the Crimean peninsula in a bloodless military takeover.",
  "* Nov 21: Kiev suddenly announces suspension of trade and association talks with the EU and opts to revive economic ties with Moscow.",
  "Several hundred Ukrainians gather on the capital’s central Independence Square to protest.",
  "* Nov 22: Jailed opposition leader Yulia Tymoshenko urges Ukrainians to protest against the switch away from the EU.",
  "* Nov 24: Some 100,000 people rally in Kiev against spurning the EU.",
  "* Nov 25: Ukrainian police fire tear gas at demonstrators.",
  "* Nov 29: At the EU summit in the Lithuanian capital Vilnius, Yanukovich fails to sign the association agreement.",
  "* Nov 30: Riot police try to break up the Kiev demonstration by force.",
  "Protest turns against Yanukovich and his government.",
  "* Dec 1: Some 350,000 people protest in Kiev and clash with police.",
  "Crowds turn Independence Square into a protest tent city.",
  "Opposition leaders call on Yanukovich to resign.",
  "* Dec 4: Senior EU officials and ministers start visiting the protest square.",
  "* Dec 6: Yanukovich holds previously unannounced talks in Sochi with Putin on “strategic partnership”.",
  "* Dec 8: Some 800,000 people rally in Kiev.",
  "A statue of Lenin is toppled.",
  "* Dec 13: Yanukovich’s first face-to-face talks with opposition bring no breakthrough in crisis.",
  "* Dec 15: EU suspends talks with Ukraine on the pact.",
  "Some 200,000 people rally in Kiev.",
  "* Dec 17: Yanukovich and Putin meet for second time since crisis began.",
  "Putin agrees to buy $15 billion of Ukrainian debt and to slash by a third the price of Russian gas supplies to Ukraine.",
  "* Dec 18: Tens of thousands of protesters gather in Kiev, calling for Yanukovich to resign over bailout.",
  "* Dec 20: About 100,000 take to square in central Kiev, opposition forms bloc called Maidan.",
  "Dec 24: Ukraine receives first $3 billion tranche of Russian bailout.",
  "* Jan 12: At least 50,000 protesters march in Kiev, reviving the movement after a Christmas and New Year lull.",
  "* Jan 15: Ukraine court bans protests in central Kiev.",
  "* Jan 17: Yanukovich signs new laws banning anti-government protests.",
  "* Jan 19: Thousands protest in Kiev defying ban, some clashing with riot police.",
  "* Jan 22: Three people die during protests and EU threatens action over handling of crisis.",
  "Talks between opposition and Yanukovich fail.",
  "* Jan 23: Washington threatens sanctions if violence continues.",
  "* Jan 26: Police clash with protesters in Kiev.",
  "Unrest spreads to traditionally pro-Yanukovich east.",
  "Yanukovich offers important government posts to opposition, who say they will press for more concessions, including early elections.",
  "* Jan 27: Yanukovich and opposition agree to scrap some of the anti-protest laws.",
  "Protesters try to storm Kiev cultural centre.",
  "* Jan 28: Ukrainian Prime Minister Mykola Azarov resigns.",
  "Deputies loyal to Yanukovich overturn anti-protest laws in a bid to restore calm.",
  "* Jan 30: Yanukovich goes on sick leave, announcing that he is suffering from an acute respiratory ailment.",
  "* Jan 31: Still on sick leave, Yanukovich signs into law a conditional amnesty for those detained in the unrest.",
  "* Feb 2: Yanukovich returns to work after four days’ sick leave, protesters fill Kiev’s main square.",
  "* Feb 7: Moscow accuses the United States of trying to foment a coup in Ukraine.",
  "Washington says Russia leaked a recording of U.S. diplomats discussing how to shape a new government in Kiev.",
  "* Feb 9: Pressure on Yanukovich grows as protests against him continue and Russia links disbursement of next tranche of a $15 billion aid package to repayment of hefty gas bill.",
  "* Feb 14: Russia accuses EU of seeking Ukraine “sphere of influence”.",
  "Protesters released under amnesty but streets still tense.",
  "* Feb 17: Russia boosts Yanukovich with $2 billion fresh cash injection to Ukraine.",
  "* Feb 18: At least 14 people die as protesters clash with police in worst violence since demonstrations began.",
  "* Feb 19: West threatens sanctions after death toll rises to 26.",
  "Yanukovich denounces bloodshed as an attempted coup.",
  "* Feb 20: At least 39 die in clashes in Kiev.",
  "Foreign ministers of Germany, France and Poland meet with Yanukovich, extend stay to put a political roadmap to opposition leaders.",
  "* Feb 21: Opposition leaders sign EU-mediated peace pact Yanukovich to end violence that killed at least 77 people.",
  "* Feb 22: Ukraine’s parliament votes to remove Yanukovich, who flees his Kiev office, denouncing what he says is a coup.",
  "His arch-rival Yulia Tymoshenko is released from jail.",
  "* Feb 24: Fugitive Yanukovich indicted for “mass murder” over demonstrator deaths.",
  "Moscow says it will not deal with leaders of “armed mutiny” against Yanukovich.",
  "* Feb 26: Ukraine names ministers for new government.",
  "Angry Russia puts 150,000 troops on high alert.",
  "Washington warns Moscow against military intervention.",
  "* Feb 27: Armed men seize Crimea parliament, raise Russian flag.",
  "Kiev’s new rulers warn Moscow to keep troops within its naval base on the peninsula.",
  "Hryvnia falls to record low.",
  "* Feb 28: Armed men take control of two airports in Crimea, described by Ukrainian minister as invasion by Moscow’s forces.",
  "Ousted Yanukovich surfaces in Russia after a week on the run.",
  "* March 1: Putin wins parliamentary approval to invade Ukraine.",
  "In Kiev, new government warns of war, puts troops on high alert and appeals to NATO for help.",
  "White House warns Russia of economic, political isolation.",
  "Russian forces fan out in Crimea.",
  "Pro-Moscow demonstrations erupt across Ukraine’s south and east in what Kiev calls an attempt to repeat Crimea scenario.",
  "* March 2: Russian forces tighten grip on Crimea.",
  "Ukraine announces call-up of reserves.",
  "U.S. Secretary of State John Kerry condemns Russia for “incredible act of aggression”, threatening “very serious repercussions”.",
  "* March 3: Markets open for first time since Kremlin announcement of right to invade.",
  "Russian share prices and ruble plummet.",
  "* March 4: Putin announces end to war games in Western Russia, orders troops near frontier back to barracks.",
  "Ukraine says Russian navy has blocked strait between Crimea and Russia.",
  "Putin says military force in Ukraine would only be “last resort”.",
  "Kerry in Kiev.",
  "U.S. official says Washington working on sanctions against Russia.",
  "* March 5: Russia rebuffs calls to withdraw troops from Crimea, saying “self-defense” forces are not under its command.",
  "European Union pledges 11 billion euros in aid to Kiev.",
  "* March 6: Crimea’s pro-Russian leadership votes to join Russia and sets referendum for March 16, escalating crisis.",
  "U.S. President Barack Obama says referendum would violate international law and orders sanctions on those responsible for Moscow’s military intervention in Ukraine.",
  "EU leaders hold an emergency summit to try to find ways to pressure Russia to back down and accept mediation.",
  "Military monitors from the Organisation for Security and Cooperation in Europe barred from entering Crimea.",
  "* March 7: After hour-long phone call with Obama, Putin says they are still far apart.",
  "* March 8: Warning shots are fired to prevent an unarmed international military observer mission from entering Crimea.",
  "Russian forces become increasingly aggressive towards Ukrainian troops trapped in bases."
]