[
  "President Trump’s former national security adviser, Michael Flynn, received $56,250 in payments during the presidential race for work done for two Russian firms and Kremlin-backed news outlet RT, according to new documents obtained by a House Oversight panel.",
  "Flynn was fired from his White House post last month after misleading Vice President Pence about communications with Russia's ambassador to the U.S.\n\nDemocrats on the House Oversight and Government Reform Committee are requesting an additional investigation into newly disclosed payments he received from Russia-based companies, sending a letter detailing the allegations to Trump and the leaders of the Pentagon and FBI.",
  "ADVERTISEMENT\n\nFlynn spoke at a gala hosted by RT in December 2015, an event he acknowledged during last year’s campaign.",
  "But he refused to say how much he was paid, citing an unwillingness to have his speaking fees publicized.",
  "The documents reveal the retired Army lieutenant general received more than $45,000 for participating in he event.",
  "His speakers bureau, Leading Authorities, took a $11,250 cut.",
  "The event occurred in Russia, and his travel and accommodations were covered.",
  "At the time, he was working on a volunteer basis as a military adviser on Trump’s presidential campaign.",
  "The new documents obtained by the committee also detail that Flynn received $11,250 from Volga-Dnepr Airlines in August 2015, a Russian airfreight company that the United Nations had suspended from its list of approved vendors after a corruption scandal involving an indicted Russian United Nations official.",
  "Flynn received an additional $11,250 payment in October 2015 from the subsidiary of a Russian company specializing in “uncovering Western government spyware,” Kaspersky Lab.",
  "Its founder, Eugene Kaspersky, denies that it has stocked the firm with those with close ties to Russian intelligence.",
  "Flynn, who served as the director of Defense Intelligence Agency from 2012 until he was fired from the job in 2014, still had a top-level national security clearance when he performed the work in 2015.",
  "That security clearance was suspended last month, pending further review.",
  "Flynn last week filed paperwork retroactively notifying the Justice Department that he had done work that may have benefitted the government of Turkey in the months before the election.",
  "Depending on the type of work that Flynn did for the two Russian firms — which the letter does not make clear — it may not be subject to disclosure to the Justice Department under the Foreign Agents Registration Act (FARA).",
  "FARA only requires the disclosure of work — including consulting, lobbying and public relations — done inside the U.S. on behalf of an individual or entity connected to a foreign sovereign government or government official.",
  "A spokeswoman for Kaspersky Lab emailed The Hill a statement detailing that the $11,250 payment was for a speech that Flynn gave to the Government Cybersecurity Forum in Washington, D.C, \"which brought together leading government, military, technology and policy experts to discuss the challenges and solutions for cybersecurity threats facing the government and related industries.\"",
  "\"As a private company, Kaspersky Lab has no ties to any government, but the company is proud to collaborate with the authorities of many countries, as well as international law enforcement agencies in the fight against cybercrime,\" the company continued in its emailed statement.",
  "Rep. Elijah Cummings (D-Md.",
  "), the top Democrat on the House Oversight Committee, authored the letter to the Trump administration detailing the newly discovered work.",
  "“I cannot recall any time in our nation’s history when the president selected as his national security advisor someone who violated the Constitution by accepting tens of thousands of dollars from an agent of a global adversary that attacked our democracy,” he said.",
  "“I also cannot recall a time when the president and his top advisers seemed so disinterested in the truth about that individual’s work on behalf of foreign nations—whether due to willful ignorance or knowing indifference.”\n\n— Updated at 3:25 p.m."
]