[
  "By Ginger Gibson\n\nWASHINGTON (Reuters) - Russian President Vladimir Putin and U.S. presidential candidate Donald Trump praised each other on Thursday, saying they would welcome an improvement in the now-icy relations between their two nations.",
  "Trump - who holds the lead in opinion polls in his bid for the Republican nomination and was dubbed the \"absolute leader\" in the race by Putin - said that by working together, the United States and Russia could work toward defeating terrorism and \"restoring world peace.\"",
  "The billionaire businessman's remarks were in stark contrast to his Republican rivals' rhetoric.",
  "Republicans have frequently taken to bashing Putin and have used his rocky relationship with Democratic President Barack Obama as evidence that the administration lacks strength in international affairs.",
  "Obama has been critical of Putin, and called for sanctions after Russia annexed Crimea.",
  "In recent months, the two countries have split on how to fight Islamic State in Syria.",
  "Putin has backed Syrian President Bashar Assad, while Obama has called for Assad to step down.",
  "Trump, who called Putin \"highly respected,\" has frequently argued that his business background and ability to negotiate deals would allow him to improve relations with Russia, as well as other nations.",
  "Putin, speaking on Thursday at his year-end news conference, told reporters he welcomed Trump's desire for better relations with Russia.",
  "“He is a very flamboyant man, very talented, no doubt about that.",
  "But it’s not our business to judge his merits, it’s up to the voters of the United States,\" Putin told reporters.",
  "\"He is an absolute leader of the presidential race, as we see it today.",
  "He says that he wants to move to another level relations, a deeper level of relations with Russia,\" Putin said.",
  "\"How can we not welcome that?",
  "Of course, we welcome it.”\n\nTrump responded that he was honored.",
  "\"It is always a great honor to be so nicely complimented by a man so highly respected within his own country and beyond,\" the real estate mogul and former TV reality star said in a statement.",
  "\"I have always felt that Russia and the United States should be able to work well with each other towards defeating terrorism and restoring world peace, not to mention trade and all of the other benefits derived from mutual respect.\"",
  "Trump's response was a far cry from the stance of another Republican candidate, former business executive Carly Fiorina.",
  "During Tuesday night's presidential debate, she said she would not even speak to Putin if elected in November 2016 until executing a series of military changes.",
  "One of Trump's fiercest rivals, Jeb Bush, said Putin's support for him was evidence that Trump is like Democratic front-runner Hillary Clinton, a former secretary of state who was part of Obama's early attempts to improve relations with Russia.",
  "On Twitter on Thursday, the former Florida governor dubbed Trump \"Hillary 2.0.\"",
  "Asked about Putin's comments, White House spokesman Josh Earnest said they sounded pretty close to an endorsement of Trump.",
  "But he would not weigh in on whether a Trump presidency would change U.S.-Russian relations.",
  "\"I haven't spent a lot of time contemplating the consequences of a Trump presidency,\" Earnest said.",
  "\"I think President Obama has effectively managed our relationship with Russia in a way that has advanced the interests of the United States, while also standing up for the basic international norms that Russia violated based on their activities along and across the Ukrainian border,\" he said, referring to Russia's support for Russian separatists in eastern Ukraine.",
  "(Reporting by Maria Tsvetkova and Lidia Kelly in Mosocow and Ginger Gibson and Steve Holland in Washington, D.C.; Writing by Maria Kiselyova and Vladimir Soldatkin; Editing by Christian Lowe and Tom Brown)"
]