[
  "Donald Trump stands next to Jeff Sessions as the Alabama senator speaks during a rally Feb. 28, 2016, in Madison, Ala. Sen. Jeff Sessions endorses Trump The Alabama senator's endorsement is a blow to Ted Cruz.",
  "Donald Trump won another major endorsement Sunday, surprising the political world when he walked onto the stage for a rally in Madison, Ala., with Alabama Sen. Jeff Sessions.",
  "Two days ahead of Super Tuesday when 11 states will cast votes, Trump continues to dominate the national airwaves and demonstrate growing support from Republican elected officials.",
  "Story Continued Below\n\nWhile New Jersey Gov.",
  "Chris Christie, who threw his support behind Trump on Friday, is a pillar of the GOP establishment, Sessions is a tea party idol who helps validate the New York City billionaire with the conservative grassroots.",
  "Sessions' endorsement is a major blow to Texas Sen. Ted Cruz, whose success may hinge on winning those Tea Party and evangelical voters — and who has so often cited Sessions as an ally in his fight against the 2013 immigration reform effort.",
  "The pair of endorsements for Trump serves as an indication of a growing acceptance on both ends of the Republican Party that he, not Cruz or Marco Rubio or anyone else, is likely to be the GOP nominee.",
  "\"I hate to say it, I'm becoming mainstream,\" joked Trump.",
  "\"I'm getting all these endorsements.\"",
  "Cruz has called Sessions “the strongest opponent of amnesty in the United States Congress,” and often mentions him and Iowa Rep. Steve King in the same sentence when seeking cover with conservatives, noting that they shared the same position on the Gang of Eight immigration overhaul.",
  "The endorsement came as Trump spoke at a rally at Madison City Schools Stadium.",
  "\"I have a little surprise for you,\" Trump told the crowd packed into a stadium, which he estimated as 32,000 people, as he teased the endorsement from Sessions.",
  "\"I have a man who is respected by everybody here, greatly respected.",
  "\"He's really the expert as far as I'm concerned on borders, on so many things.\"",
  "\"When I talk about immigration and when I talk about illegal immigration and everything else, I think about a great man,\" he continued, recognizing that much of the crowd had yet to learn about the news that had just broken.",
  "\"Who am I talking about?",
  "Nobody knows because we've kept it a surprise.\"",
  "When Sessions took the stage, he was effusive in praising the GOP front-runner.",
  "\"I told Donald Trump this isn't a campaign, this is a movement,\" Sessions said.",
  "\"Look at what's happening.",
  "The American people are not happy with their government.\"",
  "Sessions reminded supporters that politicians have talked about fixing the country's immigration system for 30 years.",
  "\"Have they done it?\"",
  "he asked.",
  "\"No, but Donald Trump will do it.\"",
  "Perhaps acknowledging that he was conflicted about his choice, Sessions said: \"We don't get everything we want\" in a candidate before delivering his official endorsement.",
  "\"At this time, in my best judgment, at this time in America's history, we need to make America great again,\" Sessions said, before leaving the podium and donning a red hat with Trump’s slogan emblazoned across the front.",
  "Protesters are removed from the Donald Trump rally in Madison, Alabama, on Sunday.",
  "| AP Photo\n\nAs Trump began his remarks, protesters interrupted him three times.",
  "“Isn’t it fun being at a Trump rally?” he asked the crowd.",
  "“This is part of the deal.”\n\nThroughout his remarks, Trump took aim at “little Marco Rubio,” the Florida senator who has been attacking him relentlessly, attempting to label him as a “con artist,” ever since the GOP debate last Thursday night.",
  "“He’s not cool.",
  "He sweats too much, and I don’t want him negotiating for us,” Trump said.",
  "As he typically does, Trump basked in polls showing him leading in most of the Super Tuesday states, asserting again that there’s nothing he could do to erode his support—but then reminding his backers that they still have to do their part.",
  "“You’ve got to vote, folks, or the movement ends,” Trump said."
]