[
  "Donald Trump’s senior policy adviser Stephen Miller is explaining the detailed role Sen. Jeff Sessions will play as chairman of Trump’s Foreign Policy Advisory Committee.",
  "“The news that I’m here to tell you about tonight,” Miller said on The Kelly File, “is that Senator Sessions is the Chairman of his Foreign Policy Committee.",
  "And that’s a major piece of news, I mean, who’s Ted Cruz’s guy?",
  "Who’s John Kasich’s guy?”\n\nFor first time, Miller detailed the effort Sessions has poured into this new role.",
  "“Jeff Sessions has been meeting for hours now putting together a team of foreign policy advisers, military experts, [and] intelligence experts,” Miller said.",
  "“I had a chance to speak to Sen.",
  "Sessions today and his military advisers for about half an hour before coming here and we discussed some robust foreign policy ideas.”\n\nMiller informed viewers that Trump has “sat down with Senator Jeff Sessions and has spoken about these [foreign policy] issues at length.”\n\nMiller also discussed the expertise Sessions would be bringing to the role: “Sessions has been for twenty years on the Armed Services Committee” and “is one of the most respected members of the Senate,” Miller said.",
  "“Anyone who knows Jeff Sessions will tell you that he is the most straight-shooting, sincere, honest, [and] frankly apolitical person that you will ever meet in Washington.”\n\nDuring the interview, Miller also criticized Ted Cruz for being “reflexively interventionist.”\n\n“If you look at the last 15 years, he [Trump] has been prescient on the major foreign policy issues that we’re facing,” Miller said.",
  "“As a businessman, he managed to see what all the people in Washington couldn’t see.",
  "He saw it with the threat of Osama bin Laden, [and] he saw it with the war in Iraq—to cite two very big examples.”\n\nWhen Kelly tried to push back on this point, Miller said: “the public record shows that he was critical of it [the Iraq war] when there was support of it.",
  "And that’s a very big distinction between him and, say, Senator Cruz, who’s reflexively interventionist.",
  "And that’s a huge difference in this race.”\n\nKelly concluded by asking Miller about Trump’s new ad attacking Hillary Clinton.",
  "The ad features video footage from a Clinton campaign event in which she was heard barking like a dog.",
  "Kelly prefaced the ad by saying that one of the things that people “love about Donald Trump is that he’s tough.” Miller agreed and said:"
]