[
  "Director of National Intelligence James Clapper listens to a question from a member of congress as he appears at a House Intelligence Committee hearing on world wide threats on Capitol Hill in Washington.",
  "| AP Photo Clapper: Cyber threats against presidential campaigns are growing\n\nU.S. intelligence officials have \"some indications\" of attempted cyberattacks against this year's presidential campaigns, Director of National Intelligence James Clapper warned Wednesday morning — adding that \"as the campaigns intensify we'll probably have more of it.\"",
  "Clapper, speaking at an event hosted by the Bipartisan Policy Center, offered no details about who is waging the attacks.",
  "But he said the Department of Homeland Security and the FBI \"are doing what they can to educate both campaigns against potential cyber threats.\"",
  "Story Continued Below\n\nIn a statement after the speech, Clapper's office tweeted that authorities are “aware that campaigns and related organizations and individuals are targeted by actors with a variety of motivations — from philosophical differences to espionage — and capabilities — from defacements to intrusions.\"",
  "It referred questions about specific incidents to the FBI.",
  "Some hackers groups, including Anonymous, have already made waves this year by threatening to launch “total war\" against Donald Trump's campaign.",
  "Trump has also been hit by at least a half-dozen embarrassing hacks that have included the defacing and spamming of his campaign and business websites and the public release of his Social Security number.",
  "Cyberattacks against presidential campaigns are not unprecedented.",
  "In 2008, Chinese agents targeted both Barack Obama and John McCain in an attempt to access their internal policy plans, something Obama alluded to publicly a year later.",
  "In 2012, both Obama and Mitt Romney also faced a steady stream of attempted cyberattacks.",
  "Clapper also stressed that he won't use the standard intelligence briefings afforded to presidential nominees to \"indoctrinate anybody\" about their views on world affairs, including Trump's call for a ban on Muslims entering the United States.",
  "“We’ve been doing this for many years and it’s not designed to shape anybody’s world view,” he said."
]