[
  "Who was at the meeting?",
  "Trump associates Set up meeting Paul Manafort Former campaign manager Donald Trump Jr. Eldest son Jared Kushner Son-in-law, senior adviser Natalia Veselnitskaya Russian lawyer Anatoli Samochornov Translator Rinat Akhmetshin Russian-American lobbyist Irakly Kaveladze Associate of Russian businessman Rob Goldstone Music producer, publicist Trump associates Set up meeting Paul Manafort Former campaign manager Jared Kushner Son-in-law, senior adviser Donald Trump Jr. Eldest son Rob Goldstone Music producer, publicist Natalia Veselnitskaya Russian lawyer Anatoli Samochornov Translator Rinat Akhmetshin Russian-American lobbyist Irakly Kaveladze Associate of Russian businessman Donald Trump Jr. President’s eldest son Jared Kushner Son-in-law, senior adviser Paul Manafort Former campaign manager Set up meeting Rob Goldstone Music producer, publicist Natalia Veselnitskaya Russian lawyer Anatoli Samochornov Translator Rinat Akhmetshin Russian- American lobbyist Irakly Kaveladze Associate of Russian businessman\n\nHow was it set up?",
  "The meeting was set up over a series of emails between Donald Trump Jr. and Rob Goldstone, a music producer and publicist.",
  "Mr. Goldstone offered potentially damaging information about Hillary Clinton that he said was “part of Russia and its government’s support for Mr. Trump.”\n\nDonald Trump Jr. responded within minutes.",
  "He gave no indication that he was surprised or disturbed by the provenance of the promised material — or the notion that it was part of a continuing effort by the Russian government to aid his father’s campaign.",
  "“If it’s what you say I love it especially later in the summer,” he wrote.",
  "How are others connected?",
  "Son Worked on Miss Universe in Moscow Aras Agalarov Russian businessman Emin Agalarov Russian pop star Donald J. Trump President Natalia Veselnitskaya Russian lawyer Irakly Kaveladze Associate of Aras Agalarov Rob Goldstone Music producer, publicist Donald J. Trump President Worked on Miss Universe in Moscow Son Aras Agalarov Russian businessman Emi Agalarov Russian pop star Natalia Veselnitskaya Russian lawyer Irakly Kaveladze Associate of Aras Agalarov Rob Goldstone Music producer, publicist\n\nMr. Goldstone said he was writing on behalf of Emin Agalarov, whose father, Aras Agalarov, wanted to share the information.",
  "According to Aras Agalarov’s lawyer, the men had “no idea what Mr. Goldstone was thinking” when he wrote the email.",
  "“It is absolutely not true,” the lawyer said.",
  "Mr. Goldstone arranged for Natalia Veselnitskaya, a lawyer connected to the Russian government who had worked with Aras Agalarov on real estate deals, to meet with Donald Trump Jr. She had asked to be introduced as a favor, Mr. Agalarov’s lawyer said.",
  "Irakly Kaveladze, a business associate of Mr. Agalarov, was at the meeting “just to make sure it happened and to serve as an interpreter if necessary.”\n\nWhat was discussed?",
  "Donald Trump Jr. acknowledged that he was told that Ms. Veselnitskaya “might have information helpful to the campaign,” but said in the end she offered nothing meaningful.",
  "He said that the meeting turned to discussion of the adoption of Russian children and the Magnitsky Act, an American law that sanctions Russians for human rights abuses.",
  "Mr. Goldstone gave a similar explanation.",
  "Ms. Veselnitskaya has denied that she discussed anything related to the presidential campaign, saying that she had “never acted on behalf of the Russian government.”\n\nRinat Akhmetshin, a Russian-American lobbyist, said he attended the meeting as part of an effort to amend the sanctions law.",
  "President Trump defended his son on Twitter, writing on Monday, “Most politicians would have gone to a meeting like the one Don jr attended in order to get info on an opponent.",
  "That’s politics!”\n\nWhen were the names revealed?",
  "The New York Times reports the existence of the meeting and the presence of Donald Trump Jr., Jared Kushner, Paul Manafort and Mrs. Veselnitskaya, the Russian lawyer.",
  "Mr. Goldstone tells The Washington Post that he also attended the meeting.",
  "Mr. Akhmetshin, the Russian-American lobbyist, confirms that he attended the meeting, and he identifies the translator in attendance as Anatoli Samochornov."
]