[
  "The Trump campaign jet, after hitting substantial turbulence, has just jettisoned one of its key pilots.",
  "In his highest-profile firing since “The Apprentice,” Trump dumped Corey Lewandowski, the fiercely loyal, rough-and-tumble campaign manager who arguably did more than anyone else to win his boss the nomination.",
  "Trump’s move yesterday came after much internal dissent about whether he should start talking about national issues in a more disciplined way or continue a freewheeling style in which he picked fights with targets big and small.",
  "Lewandowski was firmly in the let-Trump-be-Trump camp, while Paul Manafort, the Beltway veteran brought in as campaign chairman, had promised Republicans that the candidate would start showing more restraint.",
  "In fact, Fox News quoted a campaign source as saying Manafort made clear he would not continue if Lewandowski stayed on--and faced with a me-or-him situation, Trump chose his campaign chairman, whose national experience dates to the 1976 election.",
  "Such a shakeup is hardly unusual in the hothouse environment of presidential politics; Al Gore went through three campaign managers.",
  "But it is a course correction at a time when many Republican leaders are openly criticizing the billionaire and some GOP governors are skipping his rallies.",
  "And it came as the candidate’s top aides were gathering for a Trump Tower strategy meeting and his children, especially Ivanka, are said to have pushed hard for a change at the top.",
  "Lewandowski took the high road, telling MSNBC “how honored I am to be part of this team,” and he denied that Trump’s kids helped ease him out.",
  "He said Trump “completely changed politics for the better” and that it is “time to build a big, more efficient campaign.”\n\nAsked by CNN’s Dana Bash why he was fired, Lewandowski said: “I don’t know.” When Bash asked whether he is a hothead, Corey replied: “I’m a very intense person and I expect perfection.”\n\nDespite what Fox is reporting, Lewandowski pushed back on reports of friction with Manafort, telling Bash: “Paul and I have gotten along amazingly well…The media doesn’t want to report it.” He stayed relentlessly on message.",
  "Trump returned the favor, telling Bill O'Reilly that Lewandowski is \"a good man\" but \"it's time now for a different kind of campaign.\"",
  "One hint might have surfaced after Lewandowski was announced as a guest for “Fox News Sunday.” By the time the program aired, Sen. Jeff Sessions had taken his place in defending Trump to Chris Wallace.",
  "A presidential campaign—and Lewandowski has never managed a major national venture—relies on message and mechanics.",
  "When it comes to message, Trump drives the train.",
  "He told me Friday that he had made no mistakes in recent weeks, a period in which he tweeted after the Orlando attack about receiving congratulations for predicting more Islamic terrorism and attacked the judge in the Trump U. case on ethnic grounds.",
  "He did allow that some things in his “young campaign” were not “100 percent”-- which turned out to be an understatement.",
  "The campaign has struggled with mechanics as well, though in fairness to Lewandowski, it is still a relative mom-and-pop shop compared to Hillary Clinton’s juggernaut.",
  "Trump boasted to me that his outfit, just 70 staffers during the primaries, is far more efficient and frugal.",
  "Faced with what Trump told me was media “hostility”—with conservative commentators as critical as those on the left—the Trump camp has struggled to respond.",
  "Manafort had started appearing on Sunday shows.",
  "Spokesmen such as Katrina Pierson and Barry Bennett do cable warfare.",
  "But the campaign has few GOP surrogates, and some of those who had been defending Trump, such as Newt Gingrich and Bob Corker, have turned more critical recently.",
  "Chris Christie, the first big name to endorse Trump, has vanished as a high-profile presence.",
  "Some allies and advisers pushed unsuccessfully for a more traditional campaign approach.",
  "There was even a memo urging Trump to adopt an issue-a-week style: failing schools, overwhelmed VA hospitals, heroin addiction, highlighted by traveling to photo-op-worthy locations.",
  "But no action was taken.",
  "Lewandowski’s hard-charging style clearly alienated some folks in Trump world.",
  "Michael Caputo, a Trump aide, tweeted: “Ding dong the witch is dead.” Lewandowski said he was merely a volunteer.",
  "Caputo resigned hours later.",
  "Trump famously defended Lewandowski after reporter Michelle Fields said he had assaulted her by grabbing her arm, with Corey denying any contact (though a videotape showed there was some) and refusing to apologize.",
  "Florida police filed charges at one point but later dropped them.",
  "Fields taunted him on Twitter yesterday.",
  "Lewandowski’s departure changes the chemistry of the tight-knit operation.",
  "He was the body man, always at Trump’s side, often acting as a gatekeeper, one of the few who dealt regularly with reporters.",
  "The official line, which Lewandowski firmly espoused yesterday, is that the campaign’s direction is fine and these are minor corrections.",
  "But you don’t drop your campaign manager a month before the convention if everything is just swell.",
  "Lewandowski will still chair the New Hampshire delegation at next month's convention.",
  "Trump is fortunate in that he remained a loyal soldier in interviews rather than settling scores or second-guessing on the way out."
]