[
  "Corey Lewandowski was credited with being an igniting force behind Donald Trump’s improbable rise to the top of the Republican ticket, but some in the party say his departure could help the campaign regain its focus.",
  "WASHINGTON — Donald Trump fired his campaign manager Monday in a major shake-up that comes amid infighting and frustration among Republican Party leaders who complain that the presumptive nominee’s effort is hobbled by poor organization, anemic staffing, an undisciplined message, and plunging poll numbers.",
  "The sudden firing of Corey Lewandowski, unusual in its timing just a month before the nominating convention, follows a stretch of bad publicity about Trump’s response to the Orlando mass shooting and his disparaging comments about Muslims and a Mexican-American judge.",
  "To some Republican strategists, the firing is a chance for Trump to reshape the narrative of his campaign.",
  "But, they say, the departure will make little difference if Trump himself does not change.",
  "Advertisement\n\n“There’s a growing realization within the Trump campaign that personality and bluster alone is not going to win this race,” said Ryan Williams, a Republican strategist and Mitt Romney campaign veteran.",
  "Get Today in Politics in your inbox: A digest of the top political stories from the Globe, sent to your inbox Monday-Friday.",
  "Sign Up Thank you for signing up!",
  "Sign up for more newsletters here\n\n“This could be an opportunity for Trump to turn around his campaign, but Trump needs to perform better as a candidate,” he said.",
  "“It was clear he didn’t have a campaign manager who could keep him on the rails, tell him when he was wrong, and keep him acting more like a presidential candidate.”\n\nLewandowski, a hard-charging New Hampshire operative from Lowell, had guided Trump through a historic, hugely successful primary in which he knocked out 16 opponents, many better financed and better organized.",
  "After he was fired, Lewandowski defended his work for the campaign and his style and pledged in a CNN interview that he would continue doing what he can to help Trump win in November.",
  "He said he had no idea why he was fired and disputed CNN reporting that he had antagonized Trump’s daughter Ivanka.",
  "“Things change as a campaign evolves,” Lewandowski said.",
  "“I’m a very intense person and my expectation is perfection.",
  ".",
  ".",
  ".",
  "I have no regrets.”\n\nAdvertisement\n\nIn response to critics who say Trump lags far behind in staffing in key swing states, Lewandowski called Trump’s organization “leaner, meaner, more efficient, more effective.”\n\nThe campaign issued a brief statement about the departure, saying Lewandowski “will no longer be working with the campaign.",
  "The campaign is grateful to Corey for his hard work and dedication.’’\n\nLewandowski’s dismissal leaves Paul Manafort, Trump’s campaign chairman and chief strategist, in charge.",
  "Manafort, a Washington lobbyist, joined the campaign in March to manage the convention and serve as his delegate wrangler.",
  "“Getting rid of a campaign manager is not something undertaken lightly, especially for someone like Trump who prizes loyalty,” said Eric Fehrnstrom, a Republican strategist and former Romney adviser.",
  "“It means pressure for change was coming from many different directions, that it was getting loud, and that it could no longer be ignored.”\n\nUtah Republican Chairman James Evans, who shared his worries about the campaign in a one-on-one meeting with Trump in Las Vegas last weekend, took the firing of Lewandowski as a positive sign.",
  "Advertisement\n\n“His campaign manager was a symbol about which direction the campaign should go.",
  "Lewandowski believes you need to let ‘Trump be Trump’ and that wasn’t working,’’ Evans said.",
  "“The other direction means a more professional, disciplined campaign.",
  "This decision is the right kind of pivot Trump needs for the general election.”\n\nWithin minutes of Lewandowski’s firing becoming public, Michael Caputo, one of Trump’s senior advisers, tweeted out “Ding Dong the witch is dead!” along with a clip from the “Wizard of Oz.’’ It was a sign of the bitter campaign infighting that often revolved around Lewandowski.",
  "Caputo, who according to the Associated Press was poised to serve as director of communications for the campaign at the GOP convention, resigned after firing off the celebratory tweet.",
  "Several New Hampshire Republicans credited Lewandowski for taking Trump’s campaign, viewed widely as an improbable sideshow when he launched his candidacy one year ago, this far.",
  "“How can you dispute what he did, to get Trump where he is?",
  "He won.",
  "As a Ted Cruz backer I wish he hadn’t, but he did,” said former US senator Bob Smith, who hired Lewandowski to run his unsuccessful 2002 reelection campaign.",
  "State Representative Al Baldasaro, who serves as Trump’s New Hampshire co-chairman, said he was surprised by the news.",
  "“He brought Mr. Trump to places no Republican would ever dare to go” including Democratic-leaning cities such as Lowell and Burlington, Vt., Baldasaro said.",
  "“Corey has done the things that Republicans have shied away from.”\n\nDemands rose to fire Lewandowski after he was charged this spring with misdemeanor battery after being accused of grabbing a female reporter’s arm following a press conference.",
  "But Trump stood by him, calling him a “good guy.”\n\n“I don’t discard people,” Trump said at the time.",
  "The charges have been dropped.",
  "But unease with Trump himself has only increased.",
  "Trump’s assertions recently that federal Judge Gonzalo Curiel was biased in a civil fraud case against Trump University because of his Mexican heritage caused widespread discomfort among high-ranking Republicans, including many who have endorsed the candidate.",
  "Following the Orlando nightclub massacre, which claimed 49 lives, Trump tweeted “Appreciate the congrats for being right on radical Islamic terrorism, I don’t want congrats, I want toughness & vigilance.",
  "We must be smart!’’ On Sunday, Trump suggested on CBS’s “Face the Nation” that Muslims in America should be racially profiled to prevent future attacks.",
  "House Speaker Paul Ryan, the chair of the convention who endorsed Trump but disavowed his plan to halt Muslim immigration, said on NBC’s “Meet the Press” Sunday that delegates should follow their conscience on whether to support Trump — which some took as a tacit endorsement of an “Anybody but Trump” movement.",
  "Polls show Clinton leading Trump nationally by an average of 6 points.",
  "She is also beating him in key swing states such as New Hampshire, Pennsylvania, Florida, Ohio, and Virginia, but Trump is leading in Georgia and North Carolina.",
  "Clinton’s campaign announced last week that it is spending $17 million on television advertising in eight battleground states.",
  "Trump has not aired a single television ad in the last month.",
  "While Clinton has dozens of key staff in swing states, the Trump campaign has not named a single state director for the general election.",
  "The strategy has been to let the Republican National Committee run the Trump operation, instead of serving in a supporting role as the RNC has in the past.",
  "Trump, meanwhile, is planning to travel to Scotland Thursday to open a golf course.",
  "Matt Viser of the Globe staff contributed to this report.",
  "Tracy Jan can be reached at tracy.jan@globe.com .",
  "Follow her on Twitter @TracyJan .",
  "James Pindell can be reached at james.pindell@globe.com .",
  "Follow him on Twitter @JamesPindell Click here to subscribe to his daily e-mail update on the 2016 campaign."
]