[
  "But the prospect of election tampering has been discussed since the revelation that two Russian intelligence agencies, the F.S.B.",
  "and the G.R.U., were believed to be responsible for the hacking of the networks of the Democratic National Committee.",
  "Emails published by a hacker who called himself Guccifer 2.0 — believed to be an alias for Russian hackers linked to the intelligence agencies — revealed that the committee had denigrated the campaign of Senator Bernie Sanders of Vermont.",
  "The disclosures led to the resignation of Representative Debbie Wasserman Schultz of Florida as the committee’s chairwoman.",
  "Mr. Reid’s accusation that Russia is seeking not only to influence the election with propaganda but also to tamper with the vote counting goes significantly beyond anything the Obama administration has said in public.",
  "While intelligence agencies have told the White House that they have “high confidence” that Russian intelligence services were behind the hacking of the Democratic committee, the administration has not leveled any accusations against Mr. Putin’s government.",
  "Asked about that in the interview, Mr. Reid said he was free to say things the president was not.",
  "But Mr. Reid argued that the connections between some of Donald J. Trump’s former and current advisers and the Russian leadership should, by itself, prompt an investigation.",
  "He referred indirectly in his letter to a speech given in Russia by one Trump adviser, Carter Page, a consultant and investor in the energy giant Gazprom, who criticized American sanctions policy toward Russia.",
  "“Trump and his people keep saying the election is rigged,” Mr. Reid said.",
  "“Why is he saying that?",
  "Because people are telling him the election can be messed with.” Mr. Trump’s advisers say they are concerned that unnamed elites could rig the election for his opponent, Hillary Clinton.",
  "Mr. Reid argued that if Russia concentrated on “less than six” swing states, it could alter results and undermine confidence in the electoral system.",
  "That would pose challenges, given that most states have paper backups, but he noted that hackers could keep people from voting by tampering with the rolls of eligible voters."
]