[
  "Breaking News Emails Get breaking news alerts and special reports.",
  "The news and stories that matter, delivered weekday mornings.",
  "It's official: Mike Pence is Donald Trump's running mate.",
  "Trump announced Friday in a tweet that he has selected the Indiana governor to run on the GOP ticket with him in the fall.",
  "Trump will hold a news conference to unveil the decision on Saturday morning.",
  "He had planned to hold the announcement event on Friday morning but delayed it after a mass attack in France left scores dead.",
  "The choice of Pence, who served as a congressman for 12 years before being elected governor of Indiana, is squarely aimed at assuaging the concerns of traditional conservatives who are still wary of Trump's inexperience and frequent lack of adherence to some traditional GOP policy proposals.",
  "Minutes after Trump published his decision on Twitter, Pence, who had been running for re-election as governor, formally withdrew from the ballot as a gubernatorial candidate.",
  "Indiana law prohibits an individual from appearing on the ballot for both a state and federal office.",
  "Presumptive Democratic nominee Hillary Clinton's campaign said Friday that the selection of Pence shows that Trump has \"doubled down on some of his most disturbing beliefs by choosing an incredibly divisive and unpopular running mate known for supporting discriminatory politics and failed economic policies that favor millionaires and corporations over working families.\"",
  "In particular, the Clinton camp highlighted Pence's conservative record on abortion issues as well as his support last year for a religious freedom law that critics said allowed discrimination against LGBT individuals.",
  "(Pence later amended the law after a national outcry.)",
  "The announcement came after a day of confusion about whether published reports about his choice of Pence had been premature, with the candidate insisting late Thursday night that he had not made a \"final, final decision.\"",
  "After news organizations, including NBC News, reported that he had settled on Pence as his VP choice, Trump tweeted Thursday night that he would delay his formal announcement out of respect for the victims of the truck attack in Nice.",
  "But more was going on behind the scenes.",
  "Sources tell NBC News that Donald Trump was watching news coverage from his Beverly Hills home Thursday and was described as surprised and \"irritated\" that news organizations were identifying Pence as his choice early in the day.",
  "Those sources said that by mid-afternoon, after the initial news reports, he had still \"not informed\" the other two men on his final list –former House Speaker Newt Gingrich and New Jersey Gov.",
  "Chris Christie -- that a final decision had been reached.",
  "Trump spoke to Gov.",
  "Christie after 4:00pm in what was described as a \"tense\" conversation where a Pence pick was discussed but a final decision was not communicated.",
  "By about 5:00pm, sources said Trump had not personally made the offer to Pence to join the ticket.",
  "But by that time, other signals, movements and the Indiana governor’s arrival in the New York City area on a private plane appeared to signal that the choice had been made."
]