[
  "\n\n\n\nReturn to Transcripts main page\n\nSTATE OF THE UNION\n\nInterview With Hillary Clinton Campaign Manager Robby Mook; Interview With Vermont Senator Bernie Sanders; Interview With Donald Trump Jr.; Hillary Clinton Chooses Her VP; Politics In Philadelphia In This Week's State of the Cartoonion.",
  "Aired 9-10a ET\n\nAired July 24, 2016 - 09:00 ET\n\nTHIS IS A RUSH TRANSCRIPT.",
  "THIS COPY MAY NOT BE IN ITS FINAL FORM AND MAY BE UPDATED.",
  "[09:00:15]\n\n\n\n(BEGIN VIDEOTAPE)\n\n\n\nJAKE TAPPER, CNN ANCHOR (voice-over): He's with her.",
  "Senator Tim Kaine makes his debut his Hillary Clinton's V.P.",
  "pick.",
  "SEN. TIM KAINE (D-VA), VICE PRESIDENTIAL CANDIDATE: I have never lost an election, and I promise you, I'm not about to let that change.",
  "TAPPER: He's already earned a new nickname from Donald Trump.",
  "Will it stick?",
  "Clinton's campaign manager joins us live from the convention floor.",
  "Plus, Bernie is back, Sanders set to take the stage for Clinton here in Philadelphia.",
  "SEN. BERNIE SANDERS (I), VERMONT: I intend to do everything I can to make certain she will be the next president.",
  "TAPPER: But with leaked e-mails revealing that senior DNC officials were actively plotting against him, will behind-the-scenes tensions boil over?",
  "He will be here in minutes.",
  "And all in the family.",
  "Trump's kids keynote the convention and earn rave reviews.",
  "IVANKA TRUMP, DAUGHTER OF DONALD TRUMP: Real change is only going to come from outside the system.",
  "My father is a fighter.",
  "TAPPER: But did they win over new voters?",
  "Donald Trump Jr. joins me live.",
  "Plus, the best political minds will be here live in Philadelphia with insights from the campaign trail.",
  "(END VIDEOTAPE)\n\n\n\nTAPPER: Hello.",
  "I'm Jake Tapper at the Democratic Convention in beautiful Philadelphia, where the state of our union is exposed e-mails just published by WikiLeaks showing Democratic Party officials actively discussing possible ways to sabotage Bernie Sanders, even as they were insisting publicly that they were staying neutral during the primaries.",
  "The leaked e-mails are dividing Democrats just hours before they were hoping to showcase a united front with every major party player, including Bernie Sanders, scheduled to speak on behalf of former Secretary of State Hillary Clinton this week.",
  "We will also hear from her new vice presidential pick, Virginia Senator Tim Kaine, whom she introduced to a crowd in swing state Florida as a man of faith and family.",
  "(BEGIN VIDEO CLIP)\n\n\n\nHILLARY CLINTON (D), PRESUMPTIVE PRESIDENTIAL NOMINEE: Senator Tim Kaine is everything Donald Trump and Mike Pence are not.",
  "(CHEERING AND APPLAUSE)\n\n\n\nCLINTON: He is qualified to step into this job and lead on day one.",
  "(CHEERING AND APPLAUSE)\n\n\n\nCLINTON: And he is a progressive who likes to get things done.",
  "(CHEERING AND APPLAUSE)\n\n\n\n(END VIDEO CLIP)\n\n\n\nTAPPER: Joining me now is Clinton campaign manager Robby Mook.",
  "Robby, thanks so much for being here.",
  "Appreciate it.",
  "ROBBY MOOK, HILLARY CLINTON CAMPAIGN MANAGER: My pleasure.",
  "TAPPER: So, I have to ask, what is the reaction of the Clinton campaign to these DNC leaked e-mails suggesting that top officials, including the CFO there, were actively discussing ways to hurt Bernie Sanders in the primaries?",
  "MOOK: Well, I think the DNC needs to look into this and take appropriate action, and I'm sure that they will.",
  "What's disturbing to us is that we -- experts are telling us that Russian state actors broke into the DNC, stole these e-mails.",
  "And other experts are now saying that the Russians are releasing these e- mails for the purpose of actually helping Donald Trump.",
  "I don't think it's coincidental that these e-mails were released on the eve of our convention here.",
  "And that's disturbing.",
  "And I think we need to be concerned about that.",
  "I think we need to be concerned that we also saw last week at the Republican Convention that Trump and his allies made changes to the Republican platform to make it more pro-Russian.",
  "And we saw him talking about how NATO shouldn't intervene to defend -- necessarily should intervene to defend our Eastern European allies if they are attacked by Russia.",
  "So, I think, when you put all this together, it's a disturbing picture.",
  "And I think voters need to reflect on that.",
  "TAPPER: What evidence is there that the Russians were behind this in terms of the hacking or in terms of the timing by WikiLeaks?",
  "MOOK: Well, we need to let the experts speak on this.",
  "It's been reported on in the press that the -- that the hackers that got into the DNC are very likely by to be working in coordination with Russia.",
  "And, again, I think it's -- if the Russians in fact had these e-mails, again, I don't think it's very coincidental that they are being released at this time to create maximum damage on Hillary Clinton and to help Donald Trump.",
  "TAPPER: But it is a very, very strong charge that you're leveling here.",
  "You're basically suggesting that Russians hacked into the DNC and now are releasing these files through WikiLeaks to help elect Donald Trump.",
  "MOOK: Well, this isn't my assertion.",
  "There are a number of experts that are asserting this.",
  "I think we need to get to the bottom of these facts.",
  "But that is what experts are telling us.",
  "Experts have said that it is the Russians that, in fact, went in and took these e-mails.",
  "And then, if they are the ones who took them, we have to infer that they are the ones then releasing them.",
  "TAPPER: Internally, at the DNC, what repercussions should there be?",
  "How would you feel if you were running Bernie Sanders' campaign and you saw that the DNC, while claiming to be neutral, was actively talking about ways to hurt him?",
  "[09:05:10]\n\n\n\nMOOK: Well, as I said the DNC needs to take appropriate steps.",
  "And I'm confident that they will.",
  "I'm really proud of the primary that we ran.",
  "I was at the rules committee yesterday.",
  "The Clinton campaign and the Sanders campaign were working hand in hand to create a unified rules report.",
  "We worked in Orlando to create a unified platform.",
  "We're really proud of that.",
  "I think you are going to see unity at this convention, in strong contrast to what we saw at the Republican Convention.",
  "And that -- again, that is something that we're very proud of.",
  "TAPPER: You're still not answering the question about what appropriate action would be.",
  "Terry McAuliffe, the governor of Virginia, a huge Clinton ally, has said something needs to be fired.",
  "Should somebody be fired?",
  "MOOK: I'm going to leave that to the DNC, because I don't have all the facts.",
  "TAPPER: You're talking about how this is going to be a unified convention.",
  "Aren't you afraid that when Debbie Wasserman Schultz goes up there to gavel it in, that she is going to be booed by all the Sanders supporters?",
  "She -- her speaking slot was taken away because of the scandal, correct?",
  "MOOK: Well, what -- look, what I am looking forward to is how we have worked in partnership with the Sanders campaign.",
  "Senator Sanders has endorsed Secretary Clinton.",
  "Our campaigns have worked very hard to get a unified platform, to have unified rules.",
  "And we are going to celebrate that at this convention.",
  "And it's something we are both very proud of.",
  "TAPPER: All right.",
  "Obviously, you are not going to answer the question about specifics.",
  "I want to play something from Bakari Sellers, a big Clinton supporter who is a CNN analyst, talking about the selection of Tim Kaine as -- well, he wasn't talking about the selection.",
  "It was before the selection was made, but it is relevant to the selection.",
  "Let's play that sound.",
  "Oh, I'm sorry.",
  "It's a read.",
  "It's Bakari Sellers saying: \"I don't think there should be two white people on the ticket.",
  "That's not the way to win with the nomination.\"",
  "He said that in April.",
  "And here we have two white people on the ticket.",
  "MOOK: Well, then what he said after we picked Tim Kaine, and he saw his speech, he said, what a terrific choice Tim Kaine was.",
  "(CROSSTALK)\n\n\n\nTAPPER: He's pro-Tim Kaine.",
  "Obviously, Bakari is very loyal, but he he's -- he said that beforehand, so I can't help but suspect that he's disappointed, as, are we know, many Latinos that yet again we have an all-white ticket.",
  "MOOK: I don't think anybody is disappointed.",
  "As I said, Bakari said after watching that, he -- after watching Tim Kaine, hearing Tim Kaine, reading about Tim Kaine, he couldn't be more excited.",
  "Look, Tim Kaine is a progressive fighter.",
  "This is someone who was a missionary in Central America, helped create jobs there.",
  "When he came back and, after finishing law school, he was a civil rights attorney.",
  "He took on nationwide one of the biggest insurance companies in the country to fight against discrimination.",
  "He has been lauded across the board by organized labor, by the Sierra Club, by the League of Conservation Voters.",
  "He had a 100 percent record from Planned Parenthood.",
  "This is someone that the progressive community can be proud of.",
  "TAPPER: On the subject of Planned Parenthood and abortion rights, take a listen to Tim Kaine during a campaign.",
  "This is a radio ad from 2005.",
  "(BEGIN AUDIO CLIP, 2005)\n\n\n\nKAINE: I support restrictions on abortion, parental consent for minors, a ban on partial-birth abortion, no public funding of abortions.",
  "Those are my values and that's what I believe.",
  "(END AUDIO CLIP)\n\n\n\nTAPPER: Those are his values, at least in 2005.",
  "Those are not Secretary Clinton's values.",
  "MOOK: Well, that -- first of all, that was over 10 years ago.",
  "I think what's important is to look at his record in the Senate.",
  "He had a 100 percent voting record with Planned Parenthood and other -- the National Abortion Rights Action League as well.",
  "And he has said that he will stand with Secretary Clinton to defend a woman's right to choose, to repeal the Hyde amendment.",
  "So, you know, voters can be 100 percent confident that Tim Kaine is going to fight to protect a woman's right to choose.",
  "TAPPER: So, his values have changed on that issue?",
  "MOOK: That was over 10 years ago.",
  "I can't, you know, comment on that ad, but voters can be 100 percent confident because of that 100 percent voting record with Planned Parenthood during his time in the Senate.",
  "TAPPER: I want you to hear what Hillary Clinton said on \"Charlie Rose\" just a few days ago.",
  "And this is about something that she and Charlie Rose get into about what the FBI director testified, and then after the clip, we're going to play what the FBI director actually said.",
  "Let's roll that.",
  "(BEGIN VIDEO CLIP)\n\n\n\nCHARLIE ROSE, HOST, \"THE CHARLIE ROSE SHOW\": He said it was sloppy.",
  "CLINTON: No, he did not.",
  "ROSE: He said real sloppiness.",
  "CLINTON: No.",
  "JAMES COMEY, FBI DIRECTOR: There's ordinary accidents, and then there's just real sloppiness.",
  "So, I think of that as kind of real sloppiness.",
  "(END VIDEO CLIP)\n\n\n\nTAPPER: So, Charlie Rose said he said real sloppiness.",
  "Secretary Clinton said no.",
  "And then you have the evidence.",
  "James Comey, the FBI director, said it was real sloppiness.",
  "There is a real trust issue she has with voters.",
  "More than 60 percent of voters, according to the last poll, don't think she's honest and trustworthy.",
  "Aren't moments like that part of the problem?",
  "MOOK: Look, Secretary Clinton has said that this was a mistake, that she would do this differently if she could go back.",
  "And she's been very clear about that.",
  "TAPPER: She's still misrepresenting -- misrepresenting things.",
  "MOOK: I think she was referring to his press conference that he gave, not necessarily the congressional testimony.",
  "But, look, what voters are looking for and asking about in this election is, who is going to fight to get this economy working for everyone, not just those at the top?",
  "We heard doom and gloom last week from the Republicans.",
  "We heard no specific plans about how Donald Trump is going to actually make people's lives better.",
  "[09:10:11]\n\n\n\nYou're going to see real people from across America on this stage over the next week talking about how Hillary Clinton did real things to improve their lives.",
  "She's going to lay out specific plans to get this economy working for everybody.",
  "That's the difference.",
  "That's what voters really care about.",
  "TAPPER: You say it was doom and gloom.",
  "The campaign of Donald Trump says it was just reality.",
  "Doesn't the Democratic Party, doesn't the Hillary Clinton campaign run a risk, if you go after the stark picture that Donald Trump painted, if you belittle it, don't you run the risk of alienating people who are concerned about trade deals that sent their jobs away, illegal immigration, crime, terrorism?",
  "You don't want to belittle the fears, the real fears that people have.",
  "MOOK: Well, look, and to your point, Jake, this economy is not working for everyone.",
  "It is rigged and it is only working for those at the top.",
  "And she's going to address that.",
  "But you can't just get up on a stage and make a bunch of accusations, lies, falsehoods, a bunch of platitudes.",
  "This election is about the people of America and about their future and about what a president is going to do for them.",
  "And Donald Trump didn't talk about any of that.",
  "He didn't talk about the future.",
  "He didn't talk about specific plans.",
  "And you didn't see a single real person get on that stage and talk about anything that Donald Trump has done to help them.",
  "That's a problem for him.",
  "It's great that his family supports him.",
  "And his kids did a great job on that stage, but that's not enough.",
  "The next president has to actually have a real plan to help people.",
  "Hillary Clinton does.",
  "That's what you are going to see.",
  "TAPPER: I mean, they were all people.",
  "I don't know who is a real person and who is not, unless you're suggesting that they were a bunch of robots, but OK.\n\n\n\n(LAUGHTER)\n\n\n\nTAPPER: Robby Mook, thank you so much.",
  "Congratulations on getting the nomination, and good luck at your convention.",
  "Coming up: Donald Trump says the leaked DNC e-mails prove that the system is rigged.",
  "Can he win over fed-up Bernie Sanders voters?",
  "(COMMERCIAL BREAK)\n\n\n\n[09:16:05]\n\n\n\nTAPPER: Welcome back to STATE OF THE UNION.",
  "I'm Jake Tapper.",
  "We're live on the floor of the Democratic National Convention here in Philadelphia, PA. Lots of folks were expecting fewer fireworks here than at Donald Trump's convention, which, of course, featured actual fireworks.",
  "But there is Democratic drama playing out here, leaked e-mails showing top DNC officials suggesting ways to undercut Bernie Sanders during his primary race with Hillary Clinton.",
  "Will these revelations shatter the already uneasy truce between Sanders supporters and Clinton supporters on the eve of this convention?",
  "(BEGIN VIDEOTAPE)\n\n\n\nTAPPER: Joining me now is former Democratic presidential candidate Bernie Sanders.",
  "Senator Sanders, always good to have you.",
  "Thanks so much.",
  "Let's start with this bombshell from WikiLeaks, which got access to thousands of e-mails from the Democratic National Committee.",
  "In May 2016, the chief financial officer of the DNC, Brad Marshall, sent an e-mail to three other DNC staffers suggesting that the party should try to get someone to ask you about your religious beliefs.",
  "Here is the e-mail -- quote -- \"It might make no difference, but for Kentucky and West Virginia, can we get someone to ask his belief, does he believe in a God?",
  "he had skated on saying he has a Jewish heritage.",
  "I think I read he is an atheist.",
  "This could make several points' difference with my peeps.",
  "My Southern peeps would draw a big difference between a Jew and an atheist\" -- unquote.",
  "Senator Sanders, that is the chief financial officer of the Democratic National Committee.",
  "What is your response?",
  "SANDERS: Well, I think it's outrageous, but it is not a great shock to me.",
  "I think, as I said, it's what we talked about six months ago.",
  "I mean,\n\n\n\nthere's no question to my mind and I think no question to any objective observer's mind that the DNC was supporting Hillary Clinton, was in opposition to our campaign.",
  "So, I'm not quite shocked by this.",
  "And that is why many, many months ago, I made it clear that I thought Debbie Wasserman Schultz should resign, should step down, not only because of the prejudice I think they showed during the campaign, but also because I think we need a new leadership of the Democratic Party which is going to open up that party to working people, to young people, to have the kind of vitality we need to not only win the presidency, but gain control of the Senate and the House as well.",
  "TAPPER: Senator, what is your personal response, though, to having your faith questioned like that by a fellow Democrat?",
  "Well, you are now a Democrat, or you were a Democratic candidate, but by somebody supposedly neutral and theoretically on your team?",
  "SANDERS: Well, first of all, I am not an atheist.",
  "But aside from all of that, I mean, it is an outrage and sad that you would have people in important positions in the DNC trying to undermine my campaign.",
  "It goes without saying the function of the DNC is to represent all of the candidates, to be fair and even-minded.",
  "But, again, I -- we discussed this many, many months ago on this show.",
  "So, what is revealed now is not a shock to me.",
  "I think the focus, though, that I am going to go forward on right now is to make sure that Donald Trump, perhaps the worst Republican candidate in the modern history of this country, somebody by temperament, somebody by ideology must not become president of the United States.",
  "I'm going to do everything I can to defeat him, to elect Hillary Clinton, and to keep focusing, keep focusing on the real issues facing the American people.",
  "And that is the decline of the American middle class going on for 40 years, massive levels of income and wealth inequality.",
  "And I will tell you, Jake, that I'm proud that, in the Democratic platform that was passed a few weeks ago, we are making some real progress.",
  "We're talking about breaking up the large banks on Wall Street who have been ripping off the American people for years.",
  "Hillary Clinton and I reached an agreement on a higher education plan that would guarantee free tuition at public -- every public college and university in this country for families making 125,000 bucks or less, greatly expanding health care, and making sure that we make sure that millions of people gain access to primary health care and dental care.",
  "[09:20:20]\n\n\n\nSo, my focus right now is defeating Trump, electing Clinton, electing progressive candidates around this country, and focusing on the issues that matter the most to working families.",
  "TAPPER: Former Clinton Labor Secretary Robert Reich, a strong supporter of yours, he threw down the gauntlet Saturday.",
  "Take a look at what he wrote on Facebook -- quote -- \"Hillary should fire Debbie Wasserman Schultz now.",
  "Don't wait until next week to replace her.",
  "Wasserman Schultz and other top officials of the DNC tried to sandbag Bernie's campaign.\"",
  "And your campaign manager, sir, said there need to be repercussions.",
  "What repercussions need there be?",
  "Should Wasserman Schultz be fired?",
  "Should these other staff members at the DNC be fired?",
  "SANDERS: Well, I asked and demanded Debbie Wasserman Schultz's resignation many, many months ago.",
  "And I state that again.",
  "I don't think she is qualified to be the chair of the DNC, not only for these awful e-mails, which revealed the prejudice of the DNC, but also because we need a party that reaches out to working people and young people.",
  "And I don't think her leadership style is doing that.",
  "TAPPER: Let's turn to Senator Tim Kaine.",
  "He is Secretary Clinton's choice for vice president.",
  "Take a look at what Donald Trump tweeted this morning -- quote -- \"Looks to me like the Bernie people will fight.",
  "If not, their blood, sweat and tears was a total waste of time.",
  "Kaine stands for opposite\" -- unquote.",
  "Senator, do you think Tim Kaine stands for the opposite of your political revolution?",
  "(LAUGHTER)\n\n\n\nSANDERS: Well, compared to Donald Trump, certainly not.",
  "Look, I have known Tim Kaine.",
  "Tim is a fellow senator.",
  "I have known him for a number of years.",
  "Tim is an extremely bright guy, a very nice guy.",
  "Are his political views different than mine?",
  "Yes, they are.",
  "He is more conservative than I am.",
  "But compared to Donald Trump, a guy who rejects science, doesn't even believe that climate change is real, let alone that we have to take bold action to transform our energy system, a Donald Trump who wants to give hundreds of billions of dollars in tax breaks to the top two- tenths of 1 percent, a Donald Trump who goes around the country insulting Mexicans and Latinos and Muslims and women, veterans and African-Americans, trust me, on -- on his worst, worst, worst day, Tim Kaine is 100 times better than Donald Trump will ever be.",
  "TAPPER: According to the latest CNN poll, Senator, 40 percent of your supporters are not planning on voting for Hillary Clinton.",
  "They feel insulted, too.",
  "You talk about the insults that Donald Trump has leveled against minority groups.",
  "Your supporters feel insulted by Hillary Clinton, by Debbie Wasserman Schultz, by the Democratic National Committee.",
  "What is your message to them?",
  "SANDERS: This is my message, is that we have got to stay focused.",
  "And the immediate focus has got to be that a disastrous candidate like Donald Trump cannot be elected.",
  "My second message is that we continue the political revolution and fight for a government that represents all of us, and not just the 1 percent, fight to break up the banks on Wall Street, fight for a Medicare-for-all single-payer system, fight to rebuild our infrastructure and create millions of decent jobs, fight for real criminal justice and immigration reform.",
  "We have to focus on the issues.",
  "We have to elect progressive candidates all over this country running for the Congress, running for the Senate, running for school board.",
  "But we must defeat Donald Trump and elect Secretary Clinton.",
  "TAPPER: Senator Bernie Sanders, thank you so much for joining us.",
  "Let us know when you're in Philly.",
  "I will take you out for a cheesesteak.",
  "SANDERS: OK.",
  "Thank you.",
  "(END VIDEOTAPE)\n\n\n\nTAPPER: Coming up: Trump, the next generation.",
  "After Donald Trump Jr.'s breakout role at the Republican National Convention, calls for him to run for mayor of New York.",
  "Will he do it?",
  "We will ask him next.",
  "(COMMERCIAL BREAK)\n\n\n\n[09:28:55]\n\n\n\nTAPPER: Welcome back to STATE OF THE UNION.",
  "I'm Jake Tapper.",
  "The reviews for Republican Convention might be mixed, but don't tell that to Donald Trump.",
  "(BEGIN VIDEO CLIP)\n\n\n\nDONALD TRUMP (R), PRESIDENTIAL CANDIDATE: It is the summer of Trump.",
  "It was the autumn of Trump.",
  "It was the Christmas of Trump.",
  "It was everything.",
  "(LAUGHTER)\n\n\n\n(END VIDEO CLIP)\n\n\n\nTAPPER: It was the Trump of times, it was the Trump of times.",
  "But even Trump's critics seemed impressed by Trump's children, some even wondering if the children have their own future in politics.",
  "With me now is one of them, Donald Trump Jr. Don, thanks for joining us.",
  "Appreciate it.",
  "DONALD TRUMP JR., SON OF DONALD TRUMP: My pleasure, Jake.",
  "Good to be with you.",
  "TAPPER: So, I don't know if you were hearing earlier, but Robby Mook, the campaign manager for Secretary of State Hillary Clinton, I asked him about the DNC leak.",
  "And he suggested that experts are saying that Russians were behind both the leak -- the hacking of the DNC e-mails and their release.",
  "He seemed to be suggesting that this is part of a plot to help Donald Trump and hurt Hillary Clinton.",
  "Your response?",
  "[09:30:00]\n\n\n\nDONALD TRUMP JR.: Well, it just goes to show you their exact moral compass.",
  "I mean, they will say anything to be able to win this.",
  "I mean, this is time and time again, lie after lie.",
  "You notice he won't say, well, I say this.",
  "We hear experts.",
  "You know, here's (INAUDIBLE) at home once said that this is what's happening with the Russians.",
  "It's disgusting.",
  "It's so phony.",
  "I watched him bumble through the interview, I was able to hear it on audio a little bit.",
  "I mean, I can't think of bigger lies, but that exactly goes to show you what the DNC and what the Clinton camp will do.",
  "They will lie and do anything to win.",
  "You hear it with the DNC where they're leaking emails about Bernie Sanders and his Jewish heritage, to be able to try to destroy him in the south.",
  "It's a rigged system.",
  "It's disgusting and the people who should be fed up because when I heard it I certainly was.",
  "TAPPER: President Obama --\n\n\n\nThere's nothing wrong with a fair fight, Jake.",
  "I don't mind a fair fight, but these lies and the perpetuating of that kind of nonsense to try, you know, gain some political capital is just outrageous and he should be ashamed of himself.",
  "If a Republican did that...\n\n\n\nTAPPER: President Obama --\n\n\n\nTRUMP JR.: ... they would be calling for people...\n\n\n\nTAPPER: Yes.",
  "TRUMP JR.: ... to bring out the electric chair.",
  "TAPPER: I want to turn to your father's speech on Thursday night.",
  "President Obama weighed in saying -- quote -- \"this idea that America is somehow on the verge of collapse, this vision of violence and chaos everywhere doesn't really jive with the experience of most people\" -- unquote.",
  "What's your response?",
  "TRUMP JR.: Apparently he hasn't turned on the news in the last few months, Jake.",
  "If you look at what's going on in this country it's a disaster.",
  "Anything that's left of our economy is only there because it's art initially inflated with low interest rates that don't work in the long run.",
  "It's a lie.",
  "You can't turn on the T.V.",
  "these days without seeing cops getting shot.",
  "You have people enabling these things.",
  "We're creating a system (ph) where we're encouraging criminals essentially to go out and pretend that they are vigilantes.",
  "I mean, it is ridiculous.",
  "We have to defend our cause (ph) and take care of our people.",
  "We have to get law and order back into this world because it doesn't exist.",
  "And if President Obama wants to go on the air and say, look at the America we live in, it's so phenomenal today versus eight years ago.",
  "I don't think I know an American that believes that to be the case.",
  "We are in a mess and we have to finally acknowledge that, Jake.",
  "Sound bites are wonderful, but we actually have to do something in terms of action for a change.",
  "TAPPER: Well, let me play devil's advocate here...\n\n\n\nTRUMP JR.: Yes.",
  "TAPPER: ... because I want to push back a little bit.",
  "The crime rate is down overall nationwide and has been trending down, unemployment is much, much lower than when President Obama took office.",
  "Now, I'm not defending --\n\n\n\nTRUMP JR.: Wait, wait, wait.",
  "Jake, let's talk about that.",
  "TAPPER: Go ahead.",
  "TRUMP JR.: Let's talk about the murder rate for cops skyrocketing.",
  "Let's talk about the real unemployment rate.",
  "Because the way we actually measure unemployment is after X number of months if someone can't find a job, congratulations, they're miraculously off.",
  "When you talk about underemployment which Obamacare has destroyed, people that are working 30 hours a week instead of 40 hours a week so companies don't have to put them on Obamacare.",
  "When you talk about people that just aren't even registered because they don't count them anymore.",
  "They have been out of work for so long.",
  "They'd love to work if they could but they can't that doesn't count.",
  "These are artificial numbers, Jake.",
  "These are numbers that are massaged to make the existing economy look good and make the administration look good when in fact it's a total disaster.",
  "So let's talk about real numbers.",
  "You know, when we talk about the numbers as they see it it's fake accounting, it doesn't really work.",
  "And that's not what the actual state of this country is.",
  "TAPPER: So when your father -- if your father becomes president he won't use the Bureau of Labor Statistics unemployment rate.",
  "He will use the overall rate which includes people who have left the workforce and people who work part time.",
  "He'll -- he's going to switch because every president uses -- has used the typical number.",
  "He's going to use this number that includes everything?",
  "TRUMP JR.: Listen, I don't know what he's going to do, I'm not a policy wonk in terms of what we are going to decide to do, but I think we have to acknowledge that there's those numbers and then there is the real situation and they are very different.",
  "OK?",
  "We all understand that, you are acknowledging that at least.",
  "Let's talk about it.",
  "I think those are the people that my father is speaking.",
  "Those are the people that have been forgotten in this country.",
  "And that's exactly what it is.",
  "You know, unemployment is great because these people just can't even find jobs so they don't count anymore.",
  "Those are the people we're talking to.",
  "Those are the people we want to put the work, Jake.",
  "Those are the people that can't feed their families and we're telling them that they're employed because some bureaucrat (INAUDIBLE) says, well, this is the way the numbers work (ph).",
  "It doesn't work that way in the real world.",
  "TAPPER: Your father raised the prospect of bringing on Roger Ailes the former chairman and CEO of FOX News and the idea being Mr. Trump said something along the lines of people are talking about maybe he would run my campaign.",
  "Is that actually in play, roger Ailes coming on board and running the campaign?",
  "TRUMP JR.: Not that I'm aware of.",
  "I mean, I know they are friends and have a long-term relationship but I'm happy with the work that Paul Manafort is doing, I think our team is really coming into place and swing, it's been exciting to be a fly on the wall watching a lot of this stuff go down.",
  "Because -- you know, again, we're trying to give a voice to the people who have been forgotten and I think the campaign is doing a wonderful job of that.",
  "TAPPER: Lastly, Don, your speech obviously very well received and there are Republicans out there wondering if you might run for office someday yourself.",
  "[09:35:04]\n\n\n\nIt has even been raised a possible run against New York City Mayor Bill de Blasio.",
  "Are these ideas that you're contemplating?",
  "TRUMP JR.: You know, listen, I had a good time up there.",
  "It was exciting to be able to have a platform like that to speak my voice because as you can hear from this interview I'm really frustrated with what's going on in this country, Jake.",
  "And if I can do that one day I'd love to be able to do it for the people of this country.",
  "That's how I can pay back and give something back.",
  "I'd love to do it but right now I'm more concerned about getting my father in there because I know that he will do a wonderful job with that.",
  "I know he's going to fight for the people.",
  "You know, it's not going to be about signed (ph) by politics.",
  "It's not going to be about divisive politics and emails.",
  "You know, accusing people of working with the Russian government.",
  "It's not going to be about, you know, going against our opponents calling it a Jewish heritage and try to use that against them in the (INAUDIBLE).",
  "If Republicans did that it would be disgusting and that's what you're going to see in a Clinton administration.",
  "This sort of divisiveness has to stop.",
  "They should be ashamed of themselves.",
  "And again, if we did that, if the RNC did that, if my father's campaign did that they'd be calling for people to get the electric chair.",
  "So I want my father to win.",
  "I know he can fix this country.",
  "I know he can take care of the people that needs to be taken care of for a change.",
  "And I think we're going to do a great job.",
  "So that's my 100 percent focus until November.",
  "TAPPER: But after that you might actually consider running for office yourself including mayor of New York.",
  "TRUMP JR.: Well, I never like to rule anything out, Jake.",
  "You know, I want to keep optionality.",
  "As my father has always said, I want to -- we always like to keep our options open.",
  "So if I can do that as a service to our country I'd love to do it.",
  "TAPPER: All right.",
  "Don Jr., thank you so much.",
  "Really appreciate it.",
  "TRUMP JR.: Thank you, Jake.",
  "TAPPER: Coming up, hola America, Hillary's new vice president showing off his fluent Espanol.",
  "Can he mobilize Latino voters?",
  "That's next.",
  "(COMMERCIAL BREAK)\n\n\n\n[09:41:06]\n\n\n\n(BEGIN VIDEO CLIP)\n\n\n\nSEN. TIM KAINE (D), HILLARY CLINTON'S VICE PRESIDENT: Bienvenidos a todos a nuestro pais porque somos americanos todos.",
  "(CHEERING AND APPLAUSE)\n\n\n\n(END VIDEO CLIP)\n\n\n\nTAPPER: That's Hillary Clinton's vice presidential choice, Senator Tim Kaine of the commonwealth of Virginia at their first rally as candidates.",
  "If you don't speak Spanish what he said was, welcome everyone to our country because we are all Americans, as kind of a pointed jab at Donald Trump, big question of course will it translate to votes?",
  "With me here on the convention floor to discuss it all Andre Bauer, CNN political commentator and Donald Trump supporter, Neera Tanden, president and CEO of the Center for American Progress and a former senior adviser to Hillary Clinton.",
  "Kellyanne Conway, senior adviser and pollster to Donald Trump, and Van Jones, CNN political commentator -- and you know what?",
  "Van's fired up about something so I'm just going to scrap what I was going to -- I was planning on -- are you upset about the DNC leak?",
  "Is that the thing that's --\n\n\n\nVAN JONES, CNN POLITICAL COMMENTATOR: I'm upset about a lot of stuff.",
  "Number one, I think the DNC leak is just a disaster.",
  "I think, you know, a chair has to be fair.",
  "If you're going to be the referee, be the referee, you can't put somebody else's jersey on.",
  "And the fact that we are here on the verge of a convention to try to stop Donald Trump and we still have the same person in the chair it's just an outrage.",
  "And I just think that she should apologize, just apologize and resign.",
  "Number one.",
  "Number two, Robby Mook came out here on your program and he said something that was so unfair to all the young activists of color who were hoping that we might have a brown or a black nominee.",
  "He was like, oh, nobody feels that way.",
  "That's not true.",
  "There were people who were hoping for, you know, one of the Castro brothers or for a Perez or for a Cory Booker.",
  "Don't come here at the beginning of the convention and pooh-pooh that and say, oh, no, we are all happy.",
  "Listen, people like Tim Kaine but give people a minute to have a moment of heart break.",
  "I'm just concerned that you've got a tone deaf DNC chair, Robby should not have said that and I'm just worried that we are not respecting -- you have 43 percent of the delegates coming here, they are Bernie Sanders people.",
  "They aren't all happy yet.",
  "We've got a lot of work to do and you can't insult people who have been trying to be a part of this process, leave that chair in place, that's an insult.",
  "Robby come out here and say that.",
  "That's an insult saying insult.",
  "Give us an opportunity to come together as a party.",
  "TAPPER: Neera.",
  "NEERA TANDEN, PRESIDENT AND CEO, CENTER FOR AMERICAN PROGRESS: Look, I agree that the problems with the DNC leak are pretty fundamental.",
  "I think that what Robby was trying to say is that a lot of people are really excited about Tim Kaine's selection, you know, this is a person who was a civil rights lawyer for 17 years.",
  "I don't think he was trying to denigrate Bernie Sanders supporters and I was really optimistic about what Senator Sanders said in his remarks.",
  "You know, I look forward to what he is going to say not only to the country but to his delegates and his activists about the importance of this election.",
  "And I think that's something we all should focus on.",
  "TAPPER: Andre.",
  "ANDRE BAUER, CNN POLITICAL COMMENTATOR: I don't think they lost anything but I think it was an opportunity to really make a gain for the Democratic Party.",
  "I think they should have put someone of color or a businessperson to try to offset the group that Trump is hitting.",
  "I think, again, the talking heads and a lot of the people within the parties are missing the Bernie folks and the Trump folks and they are not getting them on their radar to digest.",
  "There is a group of folks out there that feel like nobody is talking about them, nobody cares about them anymore and they're frustrated.",
  "TAPPER: Kellyanne, as a polling matter, as somebody who wants to defeat Hillary Clinton in the fall, do you think that Tim Kaine was a good pick, feeding into the Clinton idea of stable, experienced --\n\n\n\nKELLYANNE CONWAY, SENIOR ADVISOR, DONALD J. TRUMP FOR PRESIDENT: Steady is ready I call it.",
  "TAPPER: Yes.",
  "Or should she have gone with somebody of color who was maybe a little less well known or younger but somebody that might appeal more to people of color like Van who wanted somebody -- I mean --\n\n\n\n[09:45:02]\n\n\n\nCONWAY: I completely understand what Van is saying.",
  "TAPPER: Yes.",
  "CONWAY: And especially just this sort of toxic brew, this hot mess that is the Democratic Party right now going into their convention...\n\n\n\nTANDEN: Oh, my God.",
  "CONWAY: ... the WikiLeaks, the Kaine pick demoralizing lots of folks who saw that there were other people on the short list who animated them more.",
  "I have to go with Michael Moore here the liberal activist who said progressives will stay home.",
  "Former NAACP Chair -- President Ben Jealous said this doesn't add anything, that he was hoping for a person of color to reach other to different demographics.",
  "And here is the problem for Hillary Clinton, she's seen as safe and scripted.",
  "This was a very safe pick choice for her.",
  "Although Tim Kaine has a liberal record he actually has zero to animate the 43 percent or so of the party or Bernie Sanders delegates who are coming in here wanting to feel like they are part of this party.",
  "Between that and the DNC leaks questioning his religiosity this is not a pretty picture.",
  "TAPPER: Go ahead.",
  "TANDEN: You know, I recognize that Kellyanne and Andre want to criticize the V.P.",
  "pick, I get that.",
  "(CROSTALK)\n\n\n\nTANDEN: But the reality is -- but the reality of this is that we have a lot of people from the left and moderate groups who are supporting Senator Kaine selection.",
  "And, you know, I have to say I hear from people like Senator Flake from Arizona, he said, he's a great pick.",
  "Then you also hear from (INAUDIBLE) labor (ph) a whole series of groups and Senator Sanders who just said he has a great respect for him and recognizes he'll be a strong pick.",
  "JONES: Yes.",
  "I think that Tim Kaine is probably going to wind up being one of the\n\n\n\nmore beloved people in the country by both sides.",
  "I have never heard anybody say a bad thing about Tim Kaine.",
  "I just think that there is a progressive wing of the party that needs a minute to digest this.",
  "TANDEN: Absolutely.",
  "JONES: I think there is a black and brown base to the party that needs a minute to digest this and when Robby Mook comes out here and saying, hey, you know, everybody is happy.",
  "That just rubs people the wrong way.",
  "I don't think our party is a hot mess.",
  "I think I saw a hot mess last week.",
  "BAUER: I just don't think (INAUDIBLE).",
  "I don't think there are a whole lot of new voters by putting him on the ticket.",
  "He is a safe pick.",
  "I'm not badmouthing him, he is a nice guy, I just don't think he reaches out and grabs any Trump voters, any independents, any moderates, any folks that are looking at Gary Johnson.",
  "I don't think bring any of those people back into (ph) the (ph) fold (ph)..\n\n\n\n(CROSSTALK)\n\n\n\nTAPPER: ... the governing pick that --\n\n\n\n(CROSSTALK)\n\n\n\nTANDEN: Yes.",
  "I think it's a governing pick but I also think there are a slew of independent voters who are looking at the Trump -- what happened over the last four days and are actually thinking, you know, that is a terrible vision of America.",
  "And I think Tim Kaine's optimism and the fact that you have a lot of Republicans who are saying positive things about him in his state, in the Senate, actually is reassuring and also he has got a strong progressive record --\n\n\n\n(CROSSTALK)\n\n\n\nCONWAY: Let's be fair.",
  "The idea that other senators, other politicians are saying this politician is great --\n\n\n\n(CROSSTALK)\n\n\n\nTANDEN: We're (ph) really hot looking --\n\n\n\n(CROSSTALK)\n\n\n\nCONWAY: It doesn't really reach past -- this is a classic D.C. political insider resume I think at a time, Jake, when Hillary Clinton really needed to get an outsider.",
  "This is an insider versus (ph) insurgent election.",
  "But look, if you're Hillary Clinton it's easy to be overshadowed.",
  "She will be overshadowed here (INAUDIBLE) President Obama, President Clinton, Bernie Sanders, Elizabeth Warren, you name it.",
  "There were many people on her alleged short list who would have overshadowed here immediately.",
  "And I don't think Tim Kaine --\n\n\n\n(CROSSTALK)\n\n\n\nTANDEN: Better to be overshadowed than plagiarism.",
  "TAPPER: I want to ask you a quick question about Trump -- Mr. Trump talking about --\n\n\n\nCONWAY: DNC leaks, she just -- she just mentioned plagiarism.",
  "Amazing.",
  "JONES: Can I get a question here?",
  "TAPPER: Let me just -- let me just -- I want to change it.",
  "Roger Ailes is being discussed by Donald Trump as somebody who might be brought on to the campaign.",
  "What do you make of that?",
  "JONES: Listen, I mean, that is typical of Donald Trump to do something like that.",
  "Listen, you know, Roger Ailes has done enough damage to the country just with the stewardship of FOX.",
  "I think FOX has actually made the conversation harder in America and then apparently he was not only doing damage externally but also internally.",
  "I don't think anybody in public life should this quickly while there is litigation try to rehabilitate him.",
  "And that's part of why people are very, very afraid of a Trump presidency.",
  "There is a tone defense there.",
  "I want to say this, listen, we have got a whole bunch of people on their way to Philadelphia right now and some of them are very happy about what's going on and some of them need some persuading.",
  "They need some hand holding.",
  "They need a little bit of respect, a little bit of patience because otherwise this thing could become a very bad thing.",
  "I don't want two train crashes in a row, the Republicans had their train crash, let's try to respect each other and be good to each other.",
  "TAPPER: All right.",
  "Thank you so much one and all.",
  "Appreciate it.",
  "After the break it's the biggest political decision Hillary Clinton and Tim Kaine will have to make if they want to win Pennsylvania.",
  "Philadelphia's messy politics heat up next.",
  "(COMMERCIAL BREAK)\n\n\n\n[09:54:07]\n\n\n\nTAPPER: Welcome back.",
  "Politicians love the symbolism of coming here to Philadelphia, the birthplace of America.",
  "We have the Liberty Bell here, Independence Hall, the home of Betsy Ross.",
  "But if a presidential hopeful wants to really feel the brotherly love, they'd better be prepared for a critical and cheesy political test.",
  "This is the subject of this week's \"State of the Cartoonion.\"",
  "(BEGIN VIDEOTAPE) TAPPER (voice-over): With the Democratic Convention taking place in Philadelphia this year, the real question facing many delegates is not Bernie or Hillary, it's Pats or Geno's.",
  "That's right it's cheese day not politics that really divide this town.",
  "And many presidential wannabes have fallen victim in the great cheese steak wars.",
  "John Kerry in 2004 ordered his cheesecake with Swiss.",
  "Thank heaven it wasn't (INAUDIBLE) I suppose.",
  "President Bush then mocked Kerry by saying he knew the proper order was wiz wit, that's with Cheez Whiz, supposedly the proper order but the true Philadelphian's provolone also show some cred.",
  "[09:55:11]\n\n\n\nWisconsin Governor Scott Walker he went with American cheese, questionable, but what raised hackles among the tough Philly crowd was his cutting in line and not cleaning up after himself.",
  "Philadelphians can be tough.",
  "We once booed Santa Claus in an Eagles' game but to be fair, the previous Christmas had been rather wanting.",
  "Kerry should be noted did win Pennsylvania, so when it comes to all this cheese steak back and forth let's not overstate the roll (ph).",
  "(END VIDEOTAPE)\n\n\n\nTAPPER: As Hillary Clinton prepares to officially become the Democratic presidential nominee, CNN is providing live coverage from Philadelphia all week, special coverage begins tomorrow, on the lead at 4:00 p.m. Eastern.",
  "Thanks for watching.",
  "I'm Jake Tapper in Philadelphia.",
  "\"FAREED ZAKARIA GPS\" is next."
]