[
  "The FBI said Monday it is investigating how thousands of Democratic National Committee emails were hacked, a breach that Hillary Clinton's campaign maintains was committed by Russia to benefit Donald Trump.",
  "A statement from the FBI confirmed that it is \"investigating a cyber intrusion involving the DNC,\" adding that \"a compromise of this nature is something we take very seriously.\"",
  "Wikileaks posted emails Friday that suggested the DNC was favoring Clinton over her rival Sen. Bernie Sanders during the primary season.",
  "Clinton's campaign pointed to a massive hacking of DNC computers in June that cybersecurity firms linked to the Russian government.",
  "Clinton campaign chairman John Podesta added fuel to the debate Monday, saying there was \"a kind of bromance going on\" between Russian President Vladimir Putin and Trump.",
  "The Clinton campaign says Russia favors Trump's views, especially on NATO.",
  "Trump on Monday dismissed as a \"joke\" claims by Hillary Clinton's campaign that Russia is trying to help Trump by leaking thousands of emails from the Democratic National Committee.",
  "\"The new joke in town is that Russia leaked the disastrous DNC emails, which should have never been written (stupid), because Putin likes me,\" Trump wrote as part of a series of Tweets.",
  "\"Hillary was involved in the email scandal because she is the only one with judgement (sic) so bad that such a thing could have happened.\"",
  "The hacking enraged die-hard Sanders supporters who have long claimed that the DNC had its finger on the scale throughout the primaries.",
  "The disclosures prompted the resignation of DNC Chairwoman Debbie Wasserman Schultz on the eve of the party's convention in Philadelphia, where Clinton is expected to officially accept the nomination for president.",
  "It wasn't immediately clear how WikiLeaks received copies of the internal Democratic emails.",
  "Democratic Party officials learned in late April that their systems had been attacked after they discovered malicious software on their computers.",
  "A cybersecurity firm they employed found traces of at least two sophisticated hacking groups on the Democrats' network -- both of which have ties to the Russian government.",
  "Those hackers took at least one year's worth of detailed chats, emails and research on Donald Trump, according to a person knowledgeable of the breach who wasn't authorized to speak publicly about the matter.",
  "Director of National Intelligence James Clapper has said U.S. officials have seen indications of foreign hackers spying on the presidential candidates, and that they expect more cyberthreats against the campaigns.",
  "Russian presidential spokesman Dmitry Peskov would not comment on allegations that Russia is behind the leaked emails, instead pointing to stataements by Trump's son, Donald Trump Jr., dismissing the claims.",
  "Clinton's campaign stood firmly behind their claims of Russian involvement Monday.",
  "\"There is a consensus among experts that it is indeed Russia that is behind this hack of the DNC,\" Clinton campaign spokesman Brian Fallon told CNN.",
  "On Sunday, Clinton campaign manager Robby Mook said that it was \"concerning last week that Donald Trump changed the Republican platform to become what some experts would regard as pro-Russian.\"",
  "Trump's senior policy adviser Paul Manafort called statements by the Clinton campaign \"pretty desperate.\"",
  "\"It's a far reach, obviously,\" Manafort told reporters.",
  "\"To lead their convention with that tells me they really are trying to move away from what the issues are going to be in this campaign.",
  "It's pretty absurd.\"",
  "Trump told The New York Times last week that he would decide whether to protect America's NATO allies against Russian aggression based on whether those countries \"have fulfilled their obligations to us,\" hinting that he might pivot away from the decades-old agreement.",
  "Some Republicans opposed to Trump have indeed sought to cast him as pro-Putin, a position that would put him at odds with both Republican and Democratic foreign policy and also diverge from the current GOP party platform adopted at the convention last week.",
  "Trump supporters succeeded in preventing a reference to arming Ukraine from getting into this year's platform, but the manifesto itself is demonstrably not pro-Russia.",
  "It accuses \"current officials in the Kremlin\" of eroding the \"personal liberty and fundamental rights\" of the Russian people.\"",
  "\"We will meet the return of Russian belligerence with the same resolve that led to the collapse of the Soviet Union,\" the Republican platform says.",
  "\"We will not accept any territorial change in Eastern Europe imposed by force, in Ukraine, Georgia, or elsewhere, and will use all appropriate constitutional measures to bring to justice the practitioners of aggression and assassination.\""
]