[
  "Donald Trump took a wild turn at a news conference Wednesday, saying he hopes Russia finds emails deleted by Hillary Clinton from her time as secretary of state.",
  "\"Russia, if you're listening, I hope you're able to find the 30,000 emails that are missing, I think you will probably be rewarded mightily by our press,\" the Republican presidential nominee told reporters.",
  "After the news conference, Trump campaign Senior Communications Advisor Jason Miller clarified to NBC that Trump wasn't calling on anyone to intervene, but instead was pushing anyone who has them to hand them over to authorities.",
  "Trump tweeted as much minutes after the news conference.",
  "\"I think it's also important here to not let Hillary off the hook for why we're even having this talk,\" Miller said.",
  "\"Because she illegally bungled 33,000 emails from her home server, and now the DNC had their anti-Sanders smear campaign emails shared with the world.\"",
  "The Clinton campaign was quick to respond to the initial comments.",
  "\"This has to be the first time that a major presidential candidate has actively encouraged a foreign power to conduct espionage against his political opponent,\" top policy advisor Jake Sullivan said in a statement.",
  "\"This has gone from being a matter of curiosity, and a matter of politics, to being a national security issue.\"",
  "Brendan Buck, a spokesperson for Republican House Speaker Paul Ryan, said in a response statement that \"Russia is a global menace led by a devious thug.",
  "Putin should stay out of this election.\"",
  "However, former House Speaker Newt Gingrich seemingly defended Trump's remarks in a tweet, writing that the \"media seems more upset by Trump's joke about Russian hacking than by the fact that Hillary's personal server was vulnerable to Russia\".",
  "The remarks came as the consensus within the American intelligence community grows that Russia was behind the recent hack of the Democratic National Committee's servers, The New York Times reported.",
  "Trump said he was not certain Russia was behind the hack, but said, \"if it is Russia, it's really bad for a different reason, because it shows how little respect they have for our country when they would hack into a major party and get everything.\"",
  "Speaking at the Florida news conference, Trump also tore into top Clinton aide Huma Abedin's husband — former Rep. Anthony Weiner — while questioning Clinton's ability to receive security briefings.",
  "\"[Clinton's] number one person, Huma Abedin, is married to Anthony Weiner, who is a sleezeball and a pervert,\" Trump said.",
  "\"I don't like Huma going home at night and telling Anthony Weiner all of these secrets, OK?",
  "So, how can Hillary Clinton be briefed on this unbelievably delicate information when it was just proven that she lied.\"",
  "\"I don't think that it's safe to have Hillary Clinton in light of what just happened and in light of what we just found out, I don't think it's safe to have Hillary Clinton be briefed on national security because the word will get out,\" he added.",
  "As the conference came to an end, he returned to criticizing Clinton, noting her limited number of press conferences.",
  "\"I think it's time for Hillary Clinton to do a news conference because its almost a year now, and it would be interesting to see how she does,\" Trump said.",
  "As he wrapped up, he answered one last question about any advice he may have for President Barack Obama as he addresses the Democratic Convention Wednesday night in Philadelphia.",
  "\"Might as well just tell him to have a good time, he has done one bad job,\" Trump said.",
  "The remarks came in the middle of the Democratic National Convention, and may have been calculated to draw attention away from the party gathering, according to Princeton political historian Julian Zelizer.",
  "\"All of that is an effort to mix up, and to confuse and to stifle this choreographed Democratic production,\" Zelizer told CNBC.com.",
  "\"With him, the more dramatic the statement the better the coverage.\"",
  "—NBC News contributed to this report."
]