[
  "Donald Trump said that the people of Russia-annexed Crimea appear to want to remain under Russia's control –- and that a President Trump would \"look at\" whether the U.S. would recognize Russian control of the territory.",
  "Interested in Donald Trump?",
  "Add Donald Trump as an interest to stay up to date on the latest Donald Trump news, video, and analysis from ABC News.",
  "Add Interest\n\n\"I'm gonna take a look at it,\" Trump told ABC News' George Stephanopoulos in an interview on \"This Week\" Sunday.",
  "\"But you know, the people of Crimea, from what I've heard, would rather be with Russia than where they were.",
  "And you have to look at that, also.\"",
  "Trump was asked to clarify a comment he made in a recent news conference indicating he was looking at whether Crimea should officially be considered Russian territory.",
  "At the news conference, Trump said he \"would be looking at\" the possibility of lifting sanctions against Russia tied to its annexation of Crimea, which the U.S. government refuses to accept.",
  "Trump said that if he's elected president he will make sure Russian President Vladimir Putin makes no further incursions into Ukraine.",
  "\"He's not going into Ukraine, OK, just so you understand,\" Trump said on \"This Week.\"",
  "\"You can mark it down.",
  "You can put it down.”\n\nAsked further about Russia's current presence in Ukraine, of which Crimea is part, Trump then acknowledged Russia was already in Ukraine \"in a certain way.\"",
  "\"But I'm not there.",
  "You have Obama there,\" Trump said.",
  "\"And frankly, that whole part of the world is a mess under Obama, with all the strength that you're talking about and all of the power of NATO and all of this.\"",
  "Trump also said he was personally \"not involved\" in writing a portion of the GOP platform with language softening the United States' diplomatic stance on Ukraine.",
  "Trump pushed back against accusations that he is too easy on Putin, saying that if he's elected and the U.S. gets along with Russia, \"that would be a great thing.\"",
  "\"When Putin goes out and tells everybody, and you talk about relationship, but he says, 'Donald Trump is gonna win.",
  "And Donald Trump is a genius.'",
  "And then I have people saying, 'You should disavow,'\" Trump said.",
  "\"I said, 'I'm gonna disavow that?'",
  "But when Putin says good things, and when we have a possibility of having a good relationship with Russia, I think that's good.\"",
  "\"If we can have a good relationship with Russia, and if Russia would help us get rid of ISIS, frankly, as far as I'm concerned, you're talking about tremendous amounts of money and lives and everything else,\" Trump added.",
  "\"That would be a positive thing, not a negative.\"",
  "Trump caused an uproar during a press conference last Wednesday when he called on Russia to release 30,000 emails deleted from Hillary Clinton’s private email server – a comment which the Clinton campaign said amounted to a presidential candidate encouraging a foreign adversary to conduct espionage against the United States.",
  "Trump later brushed his comment off as sarcasm.",
  "On \"This Week,\" Trump said repeatedly that he has \"no relationship with Putin,\" adding that he’s never met him in person or spoken on the phone, and that he has no business ties or debts to Russia.",
  "\"He was saying very good things about me.",
  "But I don't have a relationship with him,\" Trump said.",
  "\"I didn't meet him.",
  "I haven't spent time with him.",
  "I didn't have dinner with him.",
  "I didn't-- go hiking with him… I wouldn't know him from Adam except I see his picture, and I would know what he looks like.\""
]