[
  "The Turkish man who gave Mike Flynn a $600,000 lobbying deal just before President Donald Trump picked him to be national security adviser has business ties to Russia, including a 2009 aviation financing deal negotiated with Vladimir Putin, according to court records.",
  "The man, Ekim Alptekin, has in recent years helped to coordinate Turkish lobbying in Washington with Dmitri “David” Zaikin, a Soviet-born former executive in Russian energy and mining companies who also has had dealings with Putin’s government, according to three people with direct knowledge of the activities.",
  "Story Continued Below\n\nThis unusual arrangement, in which Alptekin and Zaikin have helped steer Turkish lobbying through various groups since at least 2015, raises questions about both the agenda of the two men and the source of the funds used to pay the lobbyists.",
  "Although Turkey is a NATO ally, its president, Recep Tayyip Erdogan, has grown increasingly authoritarian and friendly with Putin.",
  "And the hiring of Flynn by Alptekin came at a time when Flynn was working for Trump’s campaign and Putin’s government was under investigation for interfering with the U.S. election.",
  "Flynn’s lawyer, Robert Kelner, declined to comment.",
  "In a filing with the Justice Department, Flynn said he relied on assurances from Alptekin that he was not directly or indirectly funded by a foreign government.",
  "But shifting explanations and a web of business ties raise questions about the arrangement.",
  "Flynn has offered evolving accounts of his lobbying work for Alptekin.",
  "In September, Flynn reported his client as a Dutch shell company owned by Alptekin.",
  "After being forced to leave the White House — reportedly because he lied to Vice President Mike Pence about his conversations during the transition with the Russian ambassador — Flynn filed new paperwork in March acknowledging that his lobbying work “principally benefitted” the Turkish government.",
  "The revelation of Russian business ties to the man who hired Flynn threatens to complicate the White House’s struggle to escape the shadow of the FBI investigation into whether members of the Trump campaign coordinated with Russian agents.",
  "Flynn has been a focus for concerns about Russian ties to both the Trump campaign, for which he was a key adviser and surrogate, and the Trump administration, in which, as national security adviser, he had access to the most sensitive state secrets.",
  "He also has a history of failing to disclose ties to Russia.",
  "His original White House ethics disclosure failed to include payments from Kremlin propaganda network RT and two other Russian companies.",
  "The RT payment was for a paid speech Flynn gave at a Moscow gala where he sat at the same table as Putin.",
  "A White House spokesman declined to comment.",
  "Zaikin declined to be interviewed but said in an email that he wasn’t involved in Flynn’s lobbying and doesn’t know Alptekin.",
  "Alptekin, in an interview, said he hired Flynn with his own money and did not coordinate any lobbying for the Turkish government.",
  "He also denied knowing Zaikin.",
  "But Alptekin acknowledged that he has attended events and met with leaders of the Turkish Heritage Organization, a Washington-based group of Turkish-Americans loyal to Erdogan.",
  "The organization was started when Zaikin asked a Washington-based international political consultant named John Moreira to help set it up, Moreira told POLITICO.",
  "Asked why Zaikin — who is not Turkish and has no apparent ties to Turkey — would be organizing a Turkish heritage organization, Moreira said he thought Zaikin had Turkish friends and business associates.",
  "“I don’t know who David was working for.",
  "He just asked me to do this,” Moreira said.",
  "Moreira said he was paid to help manage the heritage organization but would not say by whom.",
  "Moreira said he gave Zaikin weekly updates on the organization’s activities and that Zaikin visited Washington about every other month.",
  "On at least one occasion, Alptekin, who was born in Turkey and grew up in the Netherlands, met with communications consultants working for the Turkish Heritage Organization, he said.",
  "But three people with direct knowledge of the situation said it was more than just one meeting; Zaikin and Alptekin worked together to help coordinate pro-Turkish lobbying.",
  "For his part, Zaikin said, “I introduced [the Turkish Heritage Organization] to a few companies who I believed were industry professionals in good standing.",
  "I was present at a few meetings.”\n\nZaikin, 49, was born in Ukraine and grew up as a citizen of the Soviet Union.",
  "He said in emails that doctors excused him from the Soviet military draft because of an injury, and that his family left the Soviet Union in 1990.",
  "He subsequently became a Canadian citizen and now lives in London.",
  "Breaking News Alerts Get breaking news when it happens — in your inbox.",
  "Email Sign Up By signing up you agree to receive email newsletters or alerts from POLITICO.",
  "You can unsubscribe at any time.",
  "In the 2000s, Zaikin was an executive in Russia’s oil industry at a time when Putin was consolidating control over the country’s mineral wealth to the financial benefit of himself and the circle of oligarchs who are his key supporters and associates.",
  "As chairman and CEO of a company called Siberian Energy Group, Zaikin obtained mineral interests and exploration licenses in Russia’s Kurgan province, according to filings with the Securities and Exchange Commission.",
  "Siberian Energy Group’s dealings under Zaikin were characteristic of the equity trades, offshore financing schemes and consulting agreements that Putin’s allies have used to protect and hide assets.",
  "In 2008, Zaikin made a deal with an ex-KGB oligarch involved in the giant state oil company Gazprom.",
  "Zaikin’s company sold the oligarch a 2.5 percent stake in a subsidiary, known as KNG, for shares worth $10, equivalent to valuing the entire subsidiary at $400, according to SEC disclosures.",
  "That came less than two years after Zaikin’s company bought KNG for the equivalent of $2.7 million.",
  "The same month as the deal with the oligarch, Zaikin’s company issued shares to a limited liability company in Moscow called Business Standard.",
  "In 2007, Zaikin’s company agreed to pay the firm thousands more shares in exchange for what the contract called “certain consulting services,” including help in obtaining oil and gas drilling licenses from the Russian government.",
  "Zaikin was also a director of a subsidiary called Zauralneftegaz that explored for oil and gas in West Siberia.",
  "The company was in part controlled by shell companies set up by a London law firm involved in the Panama Papers, the massive leak of records from an offshore finance law firm that showed how Putin associates secretly moved around $2 billion in assets.",
  "Alptekin has had his own business dealings in Russia.",
  "As a partner in an investment group called ETIRC as early as 2006, Alptekin bought a stake in a New Mexico jet manufacturer called Eclipse Aviation.",
  "In September 2008, Eclipse announced plans to build a $205 million factory in Russia financed by Russian state bank Vnesheconombank, whose board was chaired by Putin, then prime minister.",
  "A photo in the trade press showed Putin personally inspecting one of Eclipse’s jets.",
  "But a month later, Eclipse filed for bankruptcy protection.",
  "Alptekin and his partners planned to buy out the company with financing from the Putin-chaired bank.",
  "Putin was personally involved in approving a loan from the bank to Eclipse, according to court records.",
  "“The Eclipse project is one of the top priority to be funded and has been approved by Prime Minister Putin,” the minutes of an Eclipse board meeting Feb. 16, 2009, said, referring to ETIRC’s planned purchase of Eclipse.",
  "But the funding apparently never materialized, and the sale didn’t go through.",
  "Instead, Alptekin and partners bought the old company’s assets for $40 million and formed a company called Eclipse Aerospace.",
  "When the company sought bankruptcy protection, it had declared assets valued at almost $1.1 billion.",
  "“I think it was a good deal,” Alptekin said in his interview with POLITICO.",
  "Alptekin acknowledged ETIRC’s negotiations with the bank chaired by Putin, but said he never interacted with any Russian officials.",
  "There are no Russians involved in the new company, he said.",
  "Today, that company, known as EA Group, markets Eclipse jets in Turkey, Russia and the Middle East, according to its website.",
  "But Alptekin, in his POLITICO interview, said he lost the license to market the jets in Russia because he failed to sell any.",
  "The company also has an arms-dealing division, focusing on Turkey and the Middle East.",
  "Alptekin said he sold video surveillance equipment for Turkish police helicopters and declined to discuss his other deals.",
  "He said the arms division isn’t active currently.",
  "In his Justice Department filings, Flynn said the lobbying work he did for Alptekin focused on pressuring the U.S. to hand over Fethullah Gulen, a Turkish cleric living in Pennsylvania whom Erdogan claims is trying to overthrow him.",
  "The lobbying work that Alptekin and Zaikin helped organize on behalf of Turkish groups also focused on Gulen.",
  "Zaikin did not sign checks or contracts — the K Street firms were hired through the Turkish Heritage Organization and another nonprofit called the Turkish Institute for Progress, according to lobbying disclosure records.",
  "Zaikin also asked Moreira to help set up the Turkish Institute for Progress, Moreira said.",
  "But the firms sometimes sent invoices to one of Zaikin’s companies, Key Elements Group in London, according to people with direct knowledge of the dealings.",
  "Zaikin dissolved the company in December, according to British corporate records.",
  "The Turkish Institute for Progress’s president until December, a Turkish woman in New Jersey named Derya Taskin, initially denied knowing Zaikin.",
  "Later, she acknowledged hiring Moreira and knowing a “David” who worked with him.",
  "Taskin declined to disclose the group’s donors.",
  "She said her organization’s nonprofit status was still pending approval so she could not provide an annual IRS filing.",
  "Asked how she connected with the lobbying firms her group hired, Taskin said, “We just Googled them.” Later, she acknowledged that Moreira recommended the firms.",
  "The Turkish Heritage Organization says it operates independently of the Turkish government and of the Turkish Institute for Progress.",
  "But emails hacked from Erdogan’s son-in-law Berat Albayrak and published by WikiLeaks in December appear to show that the organization’s leaders reported to Albayrak and other Turkish officials about their lobbying activities in Washington.",
  "The emails, which were stolen by a Turkish Marxist group called RedHack, also appear to show Zaikin receiving reports of those lobbying activities.",
  "In February 2015, Turkish Heritage Organization member Ali Cinar alerted Zaikin and the group’s other leaders to a congressional letter critical of Erdogan, according to one of the emails.",
  "The heritage organization’s president at the time, Halil Danismaz, forwarded the email to Albayrak, Erdogan’s son-in-law, and Erdogan’s son Bilal.",
  "Danismaz, who left the group and the U.S. last year, denied reporting to Albayrak and said Zaikin introduced the heritage organization to “companies who can help us on PR and similar issues.\"",
  "“I have been a victim of massive defamation campaign sponsored by sophisticated GULEN owned infrastructure,” he said in an email to POLITICO.",
  "Cinar, now the Turkish Heritage Organization’s president, confirmed the emails’ authenticity but said he wasn’t aware of Zaikin’s Russian ties or Danismaz’s apparent contacts with Turkish officials.",
  "He said Zaikin was a consultant to Danismaz.",
  "“We don’t do lobbying for the Turkish government,” he said.",
  "In another email from the same hack, Moreira, the American consultant who was working with Zaikin, updated Zaikin, Cinar and longtime Turkey lobbyist Lydia Borland about a congressional resolution commemorating the 100th anniversary of the Armenian Genocide.",
  "Danismaz told Erdogan’s son and son-in-law that the heritage organization would soon publicize its own resolution that their lobbyists were promoting to members of Congress.",
  "Moreira’s message included the original email signature from one of the lobbying firms working for the Turkish Institute for Progress.",
  "Albayrak, Erdogan’s son-in-law, was one of the Turkish officials who Alptekin arranged for Flynn to meet in New York in September, according to Flynn’s disclosures.",
  "They discussed kidnapping Gulen to remove him to Turkey, according to a person who was briefed on the meeting."
]