[
  "Paul Manafort, campaign manager for Donald Trump | Win McNamee/Getty Images Trump campaign chair denies he accepted Ukraine cash payments Paul Manafort has lashed out at the New York Times newspaper after it claimed he took more than $12 million in cash from a former Ukraine president.",
  "Donald Trump’s campaign chairman, Paul Manafort, slammed the New York Times Monday on the morning after the newspaper published a story reporting that secret ledgers in Ukraine show more than $12 million in cash earmarked for him.",
  "The report states that the political party of former Ukraine President and pro-Russia ally Viktor Yanukovych set aside $12.7 million for Manafort.",
  "Investigators say the money was part of an illegal, undisclosed payment system, the Times reports.",
  "“Once again, the New York Times has chosen to purposefully ignore facts and professional journalism to fit their political agenda, choosing to attack my character and reputation rather than present an honest report,” Manafort said in a statement obtained by NBC News.",
  "“The suggestion that I accepted cash payments is unfounded, silly and nonsensical.”\n\nThe story comes a little more than a day after the Times published a story examining the internal struggles facing Trump’s campaign, a story that also elicited strong responses from the Republican nominee and his campaign.",
  "It’s unclear if Manafort actually received payments, but prosecutors told the Times that Manafort “must have realized the implications of his financial dealings.”\n\nBut Manafort strongly denied that he ever received off-the-books payments or has done work with the governments of Ukraine or Russia.",
  "“My work in Ukraine ceased following the country’s parliamentary elections in October 2014,” Manafort says.",
  "“In addition, as the article points out hesitantly, every government official interviewed states I have done nothing wrong.”\n\nThe Times story was retweeted by Corey Lewandowski, the former Trump campaign manager and Manafort rival who was fired in June.",
  "Hillary Clinton’s campaign chairman, Robby Mook, called the alleged connections between Manafort and members of pro-Russian factions troubling.",
  "“Donald Trump has a responsibility to disclose campaign chair Paul Manafort’s and all other campaign employees’ and advisers’ ties to Russian or pro-Kremlin entities, including whether any of Trump’s employees or advisers are currently representing and or being paid by them,” Mook said in a statement."
]