[
  "Obama says he told Putin to ‘cut it out’ on Russia hacking\n\nPresident Barack Obama said Friday that he told Russian President Vladimir Putin in September to “cut it out” in regard to allegations that his nation engaged in cyberattacks against the U.S. electoral process.",
  "Obama added that further hacking by Russia did not occur following Obama’s admonition.",
  "By the time Obama and Putin met face-to-face, the Russian cyberattack against the Democratic National Committee had already occurred.",
  "Obama said that in speaking with his Russian counterpart, his goal was to prevent any attacks against actual election infrastructure.",
  "Story Continued Below\n\n“What I was concerned about in particular was making sure [the DNC hack] wasn't compounded by potential hacking that could hamper vote counting, affect the actual election process itself,” the president said at his end-of-year press conference.",
  "“So in early September when I saw president Putin in China, I felt that the most effective way to ensure that that didn't happen was to talk to him directly and tell him to cut it out and there were going to be serious consequences if he didn't.",
  "And in fact we did not see further tampering of the election process.”\n\nMultiple media outlets have reported that U.S. intelligence officials have concluded that Putin was directly involved in his government’s efforts to meddle in last month’s election.",
  "Obama on Friday would not directly confirm Putin’s involvement in the cyberattacks but implied that such an action could only have happened with the Russian strong man’s say-so.",
  "It was the closest the president has come to fingering Putin directly for the attacks.",
  "“We have said and I will confirm that this happened at the highest levels of the Russian government,” Obama said.",
  "“And I will let you make that determination as to whether there are high-level Russian officials who go off rogue and decide to tamper with the U.S. election process without Vladimir Putin knowing about it.”\n\nObama said his administration actively sought to avoid politicizing the issue of Russian hacking from the White House, leaving it as a campaign issue for President-elect Donald Trump and his opponent, Hillary Clinton, to address.",
  "To offer any commentary beyond simply alerting the public that it had happened would have been interpreted as a partisan attack, Obama said.",
  "“I wanted to make sure everybody understood we were playing this thing straight.",
  "That we weren't trying to advantage one side or another but what we were trying to do is let people know that this had taken place,” he said.",
  "“Part of the goal here was to make sure we did not do the work of the leakers for them by raising more and more questions about the integrity of the election right before the election was taking place at a time when the president-elect himself was racing questions about the integrity of the election.”\n\nTrump has thus far been unwilling to concede the assessment of all 17 federal intelligence agencies that Russia is to blame for the wave of politically targeted cyberattacks.",
  "He has taken particular exception to the leaked assessment of the CIA that the Kremlin launched those attacks specifically to aid Trump in winning the White House.",
  "Minutes before Obama took the podium on Friday, a U.S. official confirmed that the FBI and Office of the Director of National Intelligence agreed with the CIA’s conclusion.",
  "The president-elect and his surrogates have suggested that the CIA assessment could have been leaked to The Washington Post by the White House or some other Democrat and may have been politically motivated to delegitimize Trump’s candidacy.",
  "Trump has complained loudly and regularly this week on Twitter about the issue’s resurgence, and his surrogates have objected strenuously in media appearances to any suggestion that the attacks had any impact on the election or that they were carried out by Russia.",
  "A spokesman for Russia’s foreign ministry said Thursday that the U.S. intelligence community’s assessment of Russian culpability was “laughable nonsense.” The Kremlin has regularly denied any involvement and has challenged the U.S. to present evidence proving Russia’s guilt.",
  "Obama said Friday that “we will provide evidence that we can safely provide” but added that the proprietary nature of cybersecurity operations means that much of the intelligence will remain classified.",
  "Last week, the Obama administration ordered the intelligence community to issue a comprehensive report on election hacking before the president leaves office on Jan. 20.",
  "The White House has vowed to declassify as much of that report as it can, but warned that much of it will stay private.",
  "Clinton, for her part, said Russia’s efforts were at least in part to blame for her surprise loss on Election Day, telling fundraisers at a thank you event in New York on Thursday night that Putin was exacting retribution for remarks she made as secretary of state criticizing the legitimacy of Russian elections.",
  "She also blamed FBI Director James Comey, who announced less than two weeks before the presidential election that the bureau was examining fresh evidence in its investigation into her email practices while leading the state department, for her loss.",
  "Obama refused to go as far as Clinton did when he spoke to reporters on Friday, saying only that “I'm going to let all the political pundits in this town have a long discussion about what happened in the election.”\n\nWhen the intelligence community initially released its assessment pointing the finger at Russia for the cyberattacks, White House Press Secretary Josh Earnest said Obama would retaliate against the Russian government but would not specify whether such a response had already been carried out or what it was or would be.",
  "The president himself reiterated that sentiment on Friday, suggesting that some U.S. retaliations would be felt only by the Russian government and would be by design not perceptible to the general public.",
  "“Our goal continues to be to send a clear message to Russia or others not to do this to us because we can do stuff to you.",
  "But it is also important for us to do that in a thoughtful methodical way.",
  "Some of it we do publicly.",
  "Some of it we will do in a way that they know but not everybody will,” he said.",
  "“So at a point in time where we've taken certain actions that we can divulge publicly, we will do so.",
  "There are times when the message will be directly received by the Russians and not publicized.”"
]