[
  "Trump on RT: Johnson shouldn't debate; Russian election interference 'probably unlikely'\n\nIn an interview on a state-funded Russian television network, Donald Trump said Thursday that he doesn’t want to see third-party candidates in the upcoming presidential debates, and that he believes Russian interference in American elections was \"probably unlikely,\"\n\nSpeaking with Larry King on RT (Russia Today), the Republican nominee suggested that claims of Russian interference are likely coming from across the aisle.",
  "Story Continued Below\n\n\"I think maybe the Democrats are putting that out.",
  "Who knows, but I think it’s pretty unlikely,\" he said.",
  "Trump went on to condemn any foreign influence in the U.S. election, deeming any such action \"inappropriate.\"",
  "\"I hope that if they are doing something, I hope that somebody’s going to be able to find out that they can end it because that would not be appropriate at all,\" the Republican nominee said.",
  "Trump was heavily criticized for repeatedly praising Russian President Vladimir Putin as a superior leader to President Barack Obama -- “He does have an 82 percent approval rating” -- in Wednesday evening's “commander-in-chief forum” broadcast on NBC.",
  "Hillary Clinton has accused Russia of actively trying to elect Trump.",
  "A Trump campaign spokesperson later said that the Republican candidate expected the interview with King to be appear on his podcast, not RT.",
  "In a wide-ranging interview, Trump went on to say that he didn't see Libertarian Gary Johnson and other third-party candidates as a “factor” in the election.",
  "Asked about Johnson’s inability to recall the city of Aleppo when asked about the Syrian civil war, Trump said he didn’t think it would have much impact on the candidate, and even less so on the general election.",
  "“I don’t know that it will hurt him that much frankly.",
  "Maybe it’ll hurt him a little bit,” the Republican nominee said.",
  "“I think he’ll scoot down.”\n\nTrump, who has lately seen a slight uptick in polling despite an increasingly dire electoral map, forecasted that Johnson and another general election candidate – presumably Jill Stein, who is polling fourth nationally – would slowly fade away.",
  "“They seem to be going down, the other two, they seem to be going down a little bit,” he said.",
  "“We’ll see what happens.”\n\nKing asked Trump directly if he would like to see Johnson on the debate stage, a prospect the New York mogul quickly shot down.",
  "“No, I’d rather be Hillary and myself because we’re the only two with a chance of winning,” he said.",
  "Current standards require candidates to be polling at or above 15 percent nationally to qualify for presidential debates.",
  "Johnson has long hovered above 10 percent without consistently crossing the needed threshold."
]