[
  "GENEVA (AP) — Russia lodged a formal complaint last month with the United Nations over a top U.N. official's condemnations of Donald Trump and some European politicians, an intervention that underscores the unusual links between the Republican presidential nominee and the Kremlin.",
  "There is no evidence Trump sought Russia's assistance, or was even aware of the criticism by Zeid Ra'ad al-Hussein, the U.N. high commissioner for human rights.",
  "Vitaly Churkin, Russia's ambassador to the United Nations, told The Associated Press on Friday that he complained to U.N. Secretary-General Ban Ki-moon about Zeid's remarks.",
  "Three diplomats familiar with the conversation said the complaint occurred in a private meeting Sept. 13.",
  "Churkin angrily protested a pair of speeches by Zeid that denounced \"demagogues\" and specifically targeted Trump and several populist leaders in Europe, even likening their tactics to Islamic State propaganda.",
  "\"Prince Zeid is overstepping his limits from time to time and we're unhappy about it,\" Churkin said Friday.",
  "\"He criticized a number of heads of state, government.",
  "He should stick to his file, which is important enough.\"",
  "In a speech in Cleveland three months before Republicans gathered there to nominate Trump, Zeid said: \"In what may be a crucial election for leadership of this country later this year, we have seen a full-frontal attack — disguised as courageous taboo-busting — on some fundamental, hard-won tenets of decency and social cohesion that have come to be accepted by American society.\"",
  "\"Less than 150 miles away from where I speak, a front-running candidate to be president of this country declared, just a few months ago, his enthusiastic support for torture,\" said Zeid, a Jordanian royal, referencing a speech Trump gave in Ohio in November promising to restore waterboarding and introduce even harsher interrogation methods for suspected terrorists.",
  "Trump campaign spokeswoman Hope Hicks did not immediately respond to several requests for comment.",
  "The Kremlin has said it has no position on the U.S. election.",
  "Its officials regularly oppose the U.N. interfering in what it considers the internal politics of sovereign nations.",
  "Still, Churkin's personal intervention could add to questions about the relationship between Trump and Russia.",
  "Trump has praised President Vladimir Putin's strength and leadership, vowing to improve ties between Washington and Moscow if he defeats Democrat Hillary Clinton on Nov. 8.",
  "He has questioned whether NATO, an alliance of Western nations formed to counter the Soviet Union, is outdated.",
  "He has suggested Russia hasn't entered Ukraine although it annexed the Crimea region in 2014 and is supporting anti-government rebels in the east.",
  "And he urged Moscow to find emails that Clinton deleted from the private server she used while secretary of state.",
  "The Obama administration, meanwhile, hardened accusations Friday that Russia is interfering in the presidential election.",
  "The Director of National Intelligence's office and Homeland Security Department blamed Moscow for cyber-intrusions including the hack of the Democratic National Committee's emails, saying, \"Only Russia's senior-most officials could have authorized these activities.\"",
  "Three diplomats, including two U.N. officials who were familiar with the meeting between Churkin and Ban, said the Russian complained \"virulently\" to Ban about Zeid's Cleveland speech and one in Europe in September.",
  "A senior U.N. diplomat familiar with the discussion said Churkin specifically \"condemned the fact that Zeid mentioned Trump.\"",
  "The diplomats weren't authorized to speak publicly about the matter and spoke on condition of anonymity, fearing possible diplomatic repercussions from Russia, a powerful, permanent member of the U.N. Security Council.",
  "\"We don't comment on meetings with ambassadors,\" U.N. spokesman Farhan Haq said.",
  "Trump's policy pitches have upset human rights officials like Zeid, including the candidate's calls to build a wall along the U.S.-Mexico border, temporarily ban Muslim immigration and even potentially kill the families of Islamic extremists.",
  "Trump's positions on Russia have faced sharp attacks from some Republican leaders as well as Clinton.",
  "His supporters pressured Republicans to back away from supporting U.S. lethal aid to Ukraine, which many GOP leaders want.",
  "Instead, the platform backed \"appropriate assistance\" to Ukraine.",
  "Paul Manafort, a former Trump campaign manager, resigned this summer over revelations about Manafort's work for Ukraine's Moscow-backed former president and other pro-Russian officials.",
  "And Carter Page, a former Trump foreign policy adviser, criticized the U.S. and other Western governments on a July trip to Moscow for \"their often-hypocritical focus on ideas such as democratization, inequality, corruption and regime change.\"",
  "Clinton's campaign pounced on the Russian complaint.",
  "\"This is not only strange — it's scary,\" senior policy adviser Jake Sullivan said.",
  "\"A major-party candidate for the presidency of the United States is being protected by the Kremlin.",
  "Wow.\"",
  "Eight days before Churkin's demarche, Zeid went after Trump again in a Sept. 5 speech in The Hague, Netherlands, lumping the billionaire businessman with several populist leaders in Europe.",
  "\"All seek in varying degrees to recover a past, halcyon and so pure in form, where sunlit fields are settled by peoples united by ethnicity or religion,\" Zeid said, calling it a sentiment they share with the Islamic State.",
  "Zeid concentrated on Dutch nationalist Geert Wilders, who opposes asylum for refugees and, similar to Trump, immigration from Muslim countries.",
  "Wilders also advocates closing mosques and Islamic schools, and outlawing the Quran.",
  "Zeid also criticized by name the pro-Brexit head of the U.K.",
  "Independence Party, Nigel Farage, who appeared with Trump at an August rally; Slovak Prime Minister Robert Fico; Austrian presidential candidate Norbert Hofer; French nationalist leader Marine Le Pen; Hungarian Prime Minister Viktor Orban, and Czech President Milos Zeman.",
  "U.S. and European officials accuse Russia of supporting several of these politicians' parties.",
  "Russia doesn't acknowledge such support.",
  "Allies of Wilders, Orban, Le Pen and Farage complained vociferously after Zeid's speech.",
  "Trump didn't publicly respond.",
  "While Zeid's criticism carries no legal weight, his position gives him a highly visible pulpit to shame governments and politicians around the world.",
  "The U.S. — like Russia and other powerful governments — lobbies hard to avoid condemnation.",
  "___\n\nKlapper reported from Washington.",
  "Associated Press writers Edith M. Lederer at the United Nations, Jill Colvin in Washington and Lisa Lerer in White Plains, New York, contributed to this report."
]