[
  "\"On Oct. 7, the Access Hollywood tape comes out.",
  "One hour later, WikiLeaks starts dropping my emails.\"",
  "So many extraordinary things happened in the 2016 presidential campaign that it can be hard sometimes to remember the sequence of events.",
  "When Hillary Clinton's campaign chairman described the events of Oct. 7, 2016, during a post-election interview on NBC’s Meet the Press, we had to rewind the clock.",
  "\"On Oct. 7, the Access Hollywood tape comes out.",
  "One hour later, WikiLeaks starts dropping my emails,\" Podesta told Chuck Todd on Dec. 18, 2016.",
  "\"One could say that those things might not have been a coincidence.\"",
  "The Access Hollywood tape Podesta referenced showed Donald Trump making lewd comments about women during a 2005 interview.",
  "\"I’ve got to use some Tic Tacs, just in case I start kissing her,\" Trump tells interviewer Billy Bush.",
  "\"You know I’m automatically attracted to beautiful — I just start kissing them.",
  "It’s like a magnet.",
  "I just kiss.",
  "I don’t even wait.",
  "And when you’re a star, they let you do it.",
  "You can do anything.\"",
  "The tape was discovered and first published by the Washington Post's David Fahrenthold right around 4 p.m.",
  "ET on Oct. 7.",
  "Fahrenthold shared a link to his story on Twitter.",
  "Trump recorded on hot microphone having extremely lewd conversation about women in 2005.https://t.co/JV3A9oBJ7c — David Fahrenthold (@Fahrenthold) October 7, 2016\n\nLess than an hour later, WikiLeaks revealed that it had received 50,000 of Podesta’s emails.",
  "It released 2,050 initially.",
  "It, too, shared the news via Twitter.",
  "We authenticated the time of each tweet using the Twitter source code and this very helpful blog post.",
  "We obviously cannot assess if the two events were connected, as Podesta suggested, but on the timeline he’s right on.",
  "Here's how Time described the events in an article published that day.",
  "\"The bombshell dropped on the Washington Post’s website just after 4 p.m.: a video of Donald Trump, in 2005, using extremely vulgar language to describe women, detailing his attempt to bed a married woman and bragging that he can grope women because he is a celebrity.",
  "Less than an hour later, Wikileaks published more than 2,000 emails from what appeared to be the personal account of the chairman of Hillary Clinton’s presidential campaign.\"",
  "Podesta's claim rates True.",
  "https://www.sharethefacts.co/share/4e5f0b67-694b-461a-91a7-b98f4e164d74\n\nCorrection: WikiLeaks' first post of Twitter was around 4:30 p.m. An earlier version of this fact-check referred to a subsequent tweet."
]