[
  "The batch of emails provided a glimpse into the inner workings of the Hillary Clinton campaign.",
  "| Getty The most revealing Clinton campaign emails in WikiLeaks release The trove includes excerpts of Clinton's paid Wall Street speeches that were deemed problematic.",
  "WikiLeaks released a trove of emails apparently hacked from Hillary Clinton’s campaign chairman email account, unleashing thousands of messages that reveal for the first time excerpts of Clinton’s paid speeches — including those delivered before Wall Street — that were flagged as problematic or potentially damaging.",
  "The late-Friday release came almost immediately after a devastating tape emerged of Donald Trump in 2005 talking about how being “a star” entitled him to make aggressive sexual advances on women, fueling speculation that WikiLeaks is trying to tip the balance of the election.",
  "Story Continued Below\n\nThe batch of emails — which Wikileaks promised is the first of many more to come — provided a glimpse into the inner workings of the campaign, and offered telling details about Clinton’s views on trade and the middle class.",
  "In one of the most notable exchanges, Clinton campaign research director Tony Carrk emails other members of the team on Jan. 25, 2016 to share excerpts of her paid speeches that could come back to bite the campaign.",
  "“Attached are the flags from HRC’s paid speeches we have from HWA.",
  "I put some highlights below.",
  "There is a lot of policy positions that we should give an extra scrub with Policy,” Carrk writes.",
  "The first excerpt highlighted — with the header *CLINTON ADMITS SHE IS OUT OF TOUCH* — is from a Goldman Sachs-Black Rock event in 2014 in which Clinton discusses her distance from middle-class Americans.",
  "“My father loved to complain about big business and big government, but we had a solid middle class upbringing.",
  "We had good public schools.",
  "We had accessible health care.",
  "We had our little, you know, one-family house that, you know, he saved up his money, didn't believe in mortgages.",
  "So I lived that,” she said in the speech.",
  "“And now, obviously, I'm kind of far removed because the life I've lived and the economic, you know, fortunes that my husband and I now enjoy, but I haven't forgotten it.”\n\nThe speech excerpts also delve into her support for a Canadian-style universal health care system and offer revealing comments about trade, which could prove controversial after Clinton dragged her feet in voicing fierce opposition to the Trans-Pacific Partnership trade deal that progressives loathe.",
  "Beyond those excerpts, the emails affirm the campaign’s reputation for extreme caution, with an eagerness to proactively influence news coverage.",
  "Whether it’s plotting the candidates’ response to an early attack on influence peddling at the Clinton Foundation or writing jokes for an Iowa dinner speech, ad hoc committees — often incorporating advice from Bill Clinton — are shown agonizing over wording and tone.",
  "Under fire, they’re determined “not to look beleaguered,” as one aide put it.",
  "Clinton’s campaign would not confirm the authenticity of the emails — though it did not explicitly deny it either.",
  "Podesta tweeted on Friday evening that he did not “have time to figure out which docs are real and which are faked.”\n\nClinton spokesman Glen Caplin said in an email that, “Earlier today the U.S. government removed any reasonable doubt that the Kremlin has weaponized WikiLeaks to meddle in our election and benefit Donald Trump’s candidacy.”\n\nHe added, “We are not going to confirm the authenticity of stolen documents released by Julian Assange who has made no secret of his desire to damage Hillary Clinton.",
  "Guccifer 2.0 has already proven the warnings of top national security officials that documents can be faked as part of a sophisticated Russian misinformation campaign.”\n\nThe Republican National Committee seized on the leaked excerpts, trying to drive a wedge between Clinton and former supporters of Sen. Bernie Sanders, who had made his calls for her speech transcripts a centerpiece of his primary challenge.",
  "“With today’s WikiLeaks revelations we are finding out who Hillary Clinton really is, and it’s not hard to see why she fought so hard to keep her transcripts of speeches to Wall Street banks paying her millions of dollars secret,” said RNC Chairman Reince Preibus in a statement.",
  "“The truth that has been exposed here is that the persona Hillary Clinton has adopted for her campaign is a complete and utter fraud.",
  "How can Bernie Sanders and many like-minded Democrats continue to support her candidacy in light of these revelations?”\n\nClinton spokesman Brian Fallon appeared to criticize the media for digging through the trove on Friday evening.",
  "“Striking how quickly concern abt Russia's masterminding of illegal hacks gave way to digging thru fruits of hack.",
  "Just like Russia wanted,” he wrote on Twitter.",
  "Indeed, here are eight more e-mail exchanges that shed light on the methods and mindset of Clinton's allies in Brooklyn and Washington:\n\n1) Clinton Foundation event at Goldman Sachs\n\nIn a May 2014 email, Clinton’s soon-to-be campaign manager Robby Mook called it “troubling” that Goldman Sachs had been selected to host an upcoming Clinton Foundation event.",
  "“I flagged for Tina and Cheryl as well but it's a little troubling that Goldman Sachs was selected for the foundation event,” he wrote in an email to Podesta.",
  "His comment was in reference to a New York Times story included in the email that described how “The most generous donors to the Bill, Hillary & Chelsea Clinton Foundation will convene on June 6 at the Goldman Sachs.”\n\n2) Clinton’s Keystone response\n\nIn August, 2015, senior aides to Hillary Clinton debated intensely how to react to the Obama administration’s decision to reject the Keystone Pipeline, which they had heard was imminent.",
  "“I just wanted to try to politically get ahead of this and where we are on the issue if this in fact happens,” wrote Nikki Budzinski, Clinton’s labor outreach director.",
  "“The trades are also hearing that HRC will put out a statement stating that she encouraged Obama to take this position.",
  "Politically with the building trades, this would be a very dangerous posture.”\n\nPodesta replied, “Your [sic] in trouble, girl.",
  "Seriously, doubt we'll say we ‘encouraged’ but assume we'll support if it goes that way.”\n\nThe decision by the Obama administration was ultimately delayed, which aides presumed was to kick it past the Oct. 19 Canadian elections.",
  "Then, adviser Jake Sullivan suggested that she may simply reveal her opposition in response to a question.",
  "3) Challenging Trey Gowdy\n\nIn March 2015, the Clinton campaign brass wondered whether they could recruit a friendly lawmaker to question House Benghazi investigators’ attempts to force Clinton to release her emails.",
  "“Do we have some D who can squarely at Gowdy and demand he release all his emails for that last two years so people can see for themselves how politically motivated his investigations are?” wondered Clinton pollster Joel Benenson.",
  "The problem?",
  "No one wanted to do it.",
  "They considered Elijah Cummings but then suggested they choose an “HRC Warrior,” as Podesta put it.",
  "“Who is her most fearsome House ally?” he wondered.",
  "Mook suggested Nita Lowey, Steve Israel or “SJL” – apparently Sheila Jackson Lee of Texas.",
  "As it turned out, none of them seemed eager.",
  "“After i suggested this earlier in the week i talked to few people on the Hill,” wrote Jim Margolis, another Clinton strategist.",
  "“The challenge is getting a member of congress to do it... because they think they will be called upon to make the same disclosure.",
  "I pointed out that they don't believe private emails should be made public, so there is no hypocrisy.",
  "But there is nervousness just the same.”\n\n“Maybe a retiring senator like Mikulski.",
  "I'll keep working it, too,” he said.",
  "4) 'Clinton Cash' rapid response\n\nClinton’s team scrambled in the spring of 2015 to reaction to allegations made about the Clinton Foundation in “Clinton Cash: The Untold Story of How and Why Foreign Governments and Businesses Helped Make Bill and Hillary Rich.”\n\nEmails show an elaborate response plan, even debuting a rapid-response website for grassroots supporters to get talking points.",
  "“The biggest question for this group is if and how HRC engages on Clinton Cash this week and what are the ‘two lines’ she would deliver,” Jake Sullivan wrote on May 3 to 10 top aides, including Jennifer Palmieri, Robby Mook, Mandy Grunwald, Joel Benenson and Jim Margolis.",
  "Benenson responded with a few lines for Clinton to say about the foundation’s “life-saving work around the world.”\n\n“The notion that that anyone donating to the foundation was going to influence me in my job is absurd,” Benenson suggested Clinton say, to which Margolis suggested, adding “and never happened.”\n\nOf the rapid-response website, Sullivan wrote, “John [Podesta] and I discussed yesterday and think it is important that supporters and press know that we will deal aggressively with unfair attacks, but our real focus and hers is her proactive vision.",
  "Important that we do not appear beleaguered.”\n\nIn April, the team looked for ways to have reporters thoroughly debunk “Clinton Cash” before its release.",
  "“Amy Chozick from the NYT called us to indicate she had obtained a copy of the book on her own and intends to file a separate story tomorrow.",
  "Her story will not unpack all of the book's claims … she will do a more process-y story about the book's existence, the fact that the publisher has approached multiple media outlets in advance of the book's publication to spoon-feed them some of the book's research,” Clinton spokesman Brian Fallon wrote to other Clinton advisers.",
  "He added, “We think this story, though it was not originated by us, could end up being somewhat helpful in casting the book's author as having a conservative agenda.”\n\nWhen the author, Peter Schweitzer, stumbled through an awkward interview with ABC’s George Stephanopoulos — himself a Clinton Foundation donor — the comms team took a victory lap as they sent around the transcript.",
  "\"[G]reat work everyone.",
  "this interview is perfect.",
  "he lands nothing and everything is refuted (mostly based on our work),” wrote spokesman Jesse Ferguson.",
  "“This is therapeutic to watch.",
  "George is cool as a cucumber, doesn't rush into it, but just destroys him slowly but surely over the course of the interview,” chimes in Nick Merrill.",
  "5) Joking about the Benghazi hearing\n\nOn Oct. 24, 2015, the Clinton team debated how sharp of a dig Clinton should take at Rep. Trey Gowdy after her marathon appearance before his committee investigating the Benghazi attack.",
  "As they discussed remarks she was set to deliver at the October Jefferson Jackson dinner the next night, Podesta had an idea for a joke.",
  "“I used to be obsessed with Donald Trump's hair, that was until I got to spend 11 hours staring at the top of Trey Gowdy's head,” Podesta suggested inserting into the speech.",
  "“I love the joke too but I think HRC should stay above the committee - and especially above personal insults about it.",
  "She's got every inch of the high ground right now,” Jake Sullivan replied.",
  "“Wow.",
  "You people are a bunch of ninnies,” joked Clinton comms director Jennifer Palmieri.",
  "But the team was determined to find some humor they could agree on.",
  "Mook suggested, an “Apprentice” joke, but noted, “I never saw the show.",
  "I'm also the worst person to generate jokes....”\n\nThen Jim Margolis revealed a suggestion from Bill Clinton himself: “Wishing after hour 8 that Bernie would come through the door with his ‘damn email’ line.” But Benenson killed the line:\n\n“It’s a joke that would work and room would love it,” he said.",
  "“However one caveat: I think it gives Bernie the credit for putting the email crap behind us instead of her --- she crushed the debate and she crushed at the committee.",
  "And while crowd may love it question for comms team is whether reporters would take it as proof that Bernie 'saved' her campaign from the email tempest.”\n\n6) Jeb’s economic message is not so different\n\nFollowing Jeb Bush’s “right to rise” speech on Feb. 5 in Detroit, Clinton’s aides had different reactions.",
  "\"It's a scary new wrapping paper for trickle down,” said Jeffrey Liszt, an outside pollster.",
  "Outside comms adviser Mandy Grunwald’s take: \"Very little in this speech that HRC wouldn't say….”\n\n7) Bernie oppo\n\nIn October 2015, just as Sanders' campaign was starting to pick up steam, Tony Carrk emailed colleagues a list of potential points to use against the Vermont senator.",
  "The email, with the subject line \"PLS REVIEW: Sanders Hits\" featured paragraphs of potential lines of attack against Sanders on labor and the environment, a 1994 crime bill, gun control, gay marriage, and the environment.",
  "The Clinton campaign ended up using some of the potential attacks, like Sanders supporting the Commodities Futures Modernization Act, which blocked regulating credit default swaps, while also bashing repeal of the Glass-Steagall Act.",
  "Another point proposes attacking Sanders on spending.\n\n\"",
  "Sen. Sanders has not told the American people how much his plans will cost and how he will pay for them.",
  "When asked for specifics, he demurs.",
  "When other estimates show trillions in new spending, he simply rejects them without offering his own estimate,\" Carrk wrote.",
  "8) Sounding 'Pro-Keystone'\n\nIn the speech excerpts, Clinton-allied researchers flagged her positive remarks about the Keystone XL Pipeline and trade, made well before she came out against the pipeline and the Trans-Pacific Partnership trade deal.",
  "\"My dream is a hemispheric common market, with open trade and open borders, some time in the future with energy that is as green and sustainable as we can get it, powering growth and opportunity for every person in the hemisphere,” Clinton told a Brazilian bank in 2013.",
  "She added, “We have to resist, protectionism, other kinds of barriers to market access.”\n\nAn aide flagged these remarks as sounding “Pro-Keystone”: \"Keystone is a contentious issue, and of course it is important on both sides of the border for different and sometimes opposing reasons, but that is not our relationship.” The Huffington Post has reported that the June 2014 speech to tinePublic, Inc., was among several speeches with ties to two Canadian banks with a financial interest in the oil project.",
  "Brent Griffiths and Daniel Strauss contributed reporting."
]