[
  "Hillary Clinton's campaign chairman John Podesta blamed Russia for the hack into his emails that WikiLeaks published on Oct. 7.",
  "While speaking to reporters on the campaign plane, he said he believes Trump, \"had advanced warning about what Assange was going to do.\"",
  "(Reuters)\n\nOn a plane somewhere over the United States on Tuesday, Hillary Clinton campaign chairman John Podesta spoke to reporters about his email being hacked and the contents ending up at WikiLeaks.",
  "Podesta suggested that Roger Stone, a longtime ally of Donald Trump's who is working with a pro-Trump super PAC, may have known about the email hacking before the release.",
  "\"I think it’s a reasonable assumption to — or at least a reasonable conclusion — that Mr. Stone had advance warning and the Trump campaign had advance warning about what Assange was going to do,” Podesta said.",
  "Is that a reasonable assumption, much less a reasonable conclusion?",
  "Podesta pointed to this tweet as evidence of Stone's knowledge of the leak.",
  "Trust me, it will soon the Podesta's time in the barrel.",
  "#CrookedHillary — Roger Stone (@RogerJStoneJr) August 21, 2016\n\nThat came out Aug. 21.",
  "Earlier that month, in a speech to the Southwest Broward Republican Organization, Stone said he'd been in contact with WikiLeaks.",
  "\"I actually have communicated with Assange,” Stone said about Julian Assange, the anti-secrecy group's leader.",
  "Then he said, \"I believe the next tranche of his documents pertain to the Clinton Foundation, but there's no telling what the October surprise may be.”\n\nThat's not what it was.",
  "Stone has a habit of firing wildly in the dark, hoping he hits something.",
  "Earlier this month, he offered another prediction:\n\nThat was Sunday, Oct. 2.",
  "Wednesday came and went; Assange held a news conference that was mostly content-free.",
  "(Even prominent conspiracy theorist Alex Jones bashed Assange for the lack of revelations.)",
  "Stone was unbowed:\n\nJulian Assange will deliver a devastating expose on Hillary at a time of his choosing.",
  "I stand by my prediction.",
  "#handcuffs4hillary — Roger Stone (@RogerJStoneJr) October 6, 2016\n\nThis doesn't really seem like someone with much inside information.",
  "And for what it's worth, WikiLeaks denies having contact with him.",
  "An emailer pointed me to another possible example of Trump forces knowing what was coming down the pike.",
  "On Friday, former Trump campaign manager Corey Lewandowski called in to CNN to speak with Wolf Blitzer.",
  "Asked about the hot-mic tape from \"Access Hollywood,” Lewandowski changed the subject.",
  "In the last month before Election Day, Democrat Hillary Clinton's presidential campaign has faced questions about emails posted by the WikiLeaks organization.",
  "Here's what you should know about them.",
  "(Sarah Parnass/The Washington Post)\n\n\"I'm not trying to change the subject here — we don't have any understanding of what Hillary Clinton has said in those meetings with Wall Street where she was paid for these speeches.",
  "She's never released those transcripts,” he said.",
  "\"[W]hat we don't know is what Hillary Clinton has said in some of these speeches, because she refuses to release the audio.",
  "Do we have a bombshell in there and we'll find that out in a week from now?",
  "I don't know the answer.”\n\nAs it turns out, those speeches were in the WikiLeaks file dump.",
  "But Lewandowski spoke with Blitzer at 6:30 p.m. At 6 p.m., BuzzFeed had already reported on the snippets of the transcripts found in Podesta's emails.",
  "It's certainly possible that Lewandowski had already seen the article when he spoke to Blitzer.",
  "Or, in Podesta's words, it's a \"reasonable conclusion.”\n\nUpdate: On Wednesday evening a local news station in Florida reported that Stone said he had \"a good mutual friend\" with Assange who passed information back and forth but that he was not provided material in advance.",
  "This is all the publicly available information.",
  "Podesta also told reporters that he'd been in contact with the FBI, who had informed him that the hack of his email was being looked at as part of a broader pattern of hacks by Russian-linked actors.",
  "Perhaps Podesta has access to information as a result of that conversation that we don't.",
  "Or, perhaps he understands the value of implying that there's a stronger connection between WikiLeaks and the Trump campaign than is immediately apparent.",
  "Clinton's team has repeatedly worked to reinforce the perception of links between the Russian government and her opponent, which this argument reinforces.",
  "So far though, the accusation seems a lot like the plane from which Podesta was speaking: ungrounded."
]