[
  "Follow CBSMIAMI.COM: Facebook | Twitter\n\nMIAMI (CBSMiami) – Roger Stone, a self-described master of the political dark arts and the longtime ally of Donald Trump, admits he has had “back-channel communications” with WikiLeaks founder Julian Assange over the release of thousands of emails stolen from the Hillary Clinton campaign.",
  "Stone, however, said he was not provided the hacked material in advance nor was he involved in the timing of their release.",
  "“I do have a back-channel communication with Assange, because we have a good mutual friend,” Stone told CBS4 News Wednesday evening.",
  "“That friend travels back and forth from the United States to London and we talk.",
  "I had dinner with him last Monday.”\n\nAssange was granted asylum by the government of Ecuador in 2012 and has resided ever since in that country’s London embassy.",
  "In the interview with CBS4 News, Stone denied he has ever had direct contact with Assange.",
  "“I have not talked to him,” Stone said.",
  "“I have not met with him.”\n\nStone’s involvement blossomed as an issue after the latest WikiLeaks dump that included embarrassing emails from John Podesta, chairman of the Clinton Campaign.",
  "Tuesday evening, Podesta accused Stone of plotting with WikiLeaks.",
  "Podesta pointed to a Tweet Stone posted on August 21, which stated: “Trust me, it will soon [be] Podesta’s time in the barrel.”\n\nSeven weeks later Podesta’s private emails were made public.",
  "“Stone pointed his finger at me, and said that I could expect some treatment that would expose me and ultimately sent out a tweet that said it would be my time in the barrel,” Podesta told reporters Tuesday.",
  "“So I think it’s a reasonable assumption to — or at least a reasonable conclusion — that Mr. Stone had advance warning and the Trump campaign had advance warning about what Assange was going to do … I think there’s at least a reasonable belief that Mr. Assange may have passed this information onto Mr. Stone.”\n\nStone, who regularly talks to Trump, told CBS4 News the Tweet was in reference to a separate story he was working on regarding Podesta that would accuse Podesta of possible criminal wrongdoing.",
  "He said the Tweet did not refer to the pending WikiLeaks material.",
  "Democrats have accused WikiLeaks and Assange of working with Russian security services, who they believe are actually responsible for hacking into the Clinton campaign.",
  "The campaign said it is part of a larger Russian conspiracy to swing the election to Trump.",
  "U.S officials have also identified the Russians as being behind the hacks.",
  "Stone said he doubted the Russians were involved.",
  "“I bet there is no evidence of a Russian conspiracy to fix the election,” he said.",
  "Speaking of Assange, Stone said: “He’s not a Russian agent.”\n\nLate Wednesday evening, the Clinton campaign released a statement on Stone’s claims.",
  "It read:\n\n“It is disturbing that Roger Stone, a longtime Donald Trump confidante, has confirmed the fact that he has “back-channel communications” with Wikileaks, an organization that is working with the Russian government to affect the American presidential election.”\n\nFor more on Campaign 2016, click here."
]