[
  "“Nothing could be further from the truth,” Mike Pence says.",
  "| AP Photo Pence denies Trump camp in cahoots with WikiLeaks\n\nIndiana Gov.",
  "Mike Pence said Friday morning that despite rumors and suggestions to the contrary, the Republican presidential ticket has absolutely nothing to do with the avalanche of Hillary Clinton campaign emails released in recent days by WikiLeaks.",
  "“Nothing could be further from the truth,” Pence said when asked by Fox News anchor Steve Doocy if Donald Trump’s campaign is “in cahoots” with the website releasing the emails.",
  "“I think all of us have, you know, have had concerns about WikiLeaks over the years and it's just a reality of American life today, and of life in the wider world.”\n\nStory Continued Below\n\nClinton campaign chairman John Podesta, whose allegedly hacked emails have been released in batches this week by WikiLeaks, said earlier this week that it would be a “reasonable conclusion” that Roger Stone, an ally of Trump’s campaign had “advance warning” of the email releases.",
  "That the email hackers have largely targeted Clinton’s campaign and not Trump’s, along with the U.S. government’s assertion the Russian government is behind at least some of the hacking, has stoked rumors that such attacks are politically motivated to aid the Manhattan billionaire.",
  "Stone has denied any connection to WikiLeaks, and neither Podesta nor anyone else from Clinton’s campaign has confirmed the authenticity of the released emails.",
  "What has been released thus far by WikiLeaks has proven to be more embarrassing than damaging to Clinton’s camp, exposing the planning process in the run-up to the launch of her White House bid and the inner workings of a presidential campaign.",
  "But Pence insisted that the media has been negligent in its coverage of the campaign, paying too much attention to allegations of sexual assault against Trump and not enough to the “avalanche” of information from the WikiLeaks emails.",
  "“Here you see the national media chasing after unsubstantiated allegations, the allegations that Donald Trump has categorically denied, and ignoring hard evidence, documented evidence, of deeds by the secretary of state,” he said.",
  "“This avalanche, the American people need to look at the evidence and understand that we have an opportunity to make America great again but we've got to have new leadership and that begins the day that Donald Trump becomes president.”"
]