[
  "Breaking News Emails Get breaking news alerts and special reports.",
  "The news and stories that matter, delivered weekday mornings.",
  "First Read is a morning briefing from Meet the Press and the NBC Political Unit on the day's most important political stories and why they matter.",
  "Trump’s striking consistency that Russia didn’t intervene in ’16 race\n\nAs President-elect Donald Trump today receives his intelligence briefing from top officials on Russia’s role in the 2016 presidential race, it’s worth listing his remarkable consistency denying Russian interference, which dates back to the debate season.",
  "“I don't think anybody knows it was Russia that broke into the DNC.",
  "[Hillary Clinton is] saying Russia, Russia, Russia, but I don't -- maybe it was.",
  "I mean, it could be Russia, but it could also be China.",
  "It could also be lots of other people.",
  "It also could be somebody sitting on their bed that weighs 400 pounds, OK?” (First presidential debate, Sept. 26, 2016)\n\n“[Clinton] has no idea whether it is Russia, China or anybody else... Our country has no idea.” (Third presidential debate, Oct. 19, 2016)\n\n“These are the same people that said Saddam Hussein had weapons of mass destruction.",
  "The election ended a long time ago in one of the biggest Electoral College victories in history.",
  "It’s now time to move on and ‘Make America Great Again.’” (Trump statement on Washington Post report that CIA assessed Russia was trying to help Trump win, Dec. 9, 2016)\n\n\"They have no idea if it's Russia or China or somebody.",
  "It could be somebody sitting in a bed some place.",
  "I mean, they have no idea.” (Trump interview on Fox News Sunday, Dec. 11, 2016)\n\n\"The 'Intelligence' briefing on so-called 'Russian hacking' was delayed until Friday, perhaps more time needed to build a case.",
  "Very strange!\"",
  "(Trump tweet, Jan. 3, 2017)\n\n\"Julian Assange said 'a 14 year old could have hacked Podesta' - why was DNC so careless?",
  "Also said Russians did not give him the info!",
  "(Trump tweet, Jan. 4, 2017)\n\n\"The dishonest media likes saying that I am in Agreement with Julian Assange - wrong.",
  "I simply state what he states, it is for the people....to make up their own minds as to the truth.",
  "The media lies to make it look like I am against \"Intelligence\" when in fact I am a big fan!\"",
  "(Trump tweets, Jan. 5, 2017)\n\n“The Democratic National Committee would not allow the FBI to study or see its computer info after it was supposedly hacked by Russia.....",
  "So how and why are they so sure about hacking if they never even requested an examination of the computer servers?",
  "What is going on?\"",
  "(Trump tweets, Jan. 5, 2017)\n\nYou can count on maybe one hand the issues where Trump has been very consistent.",
  "So his constant position here -- at least before today’s briefing -- is striking.",
  "Report: Russia celebrated Trump’s win, and U.S. identified Russian actors who turned over stolen Democratic material to WikiLeaks\n\nHere is some of the information that Trump is likely to receive at his briefing today, according to NBC’s reporting.",
  "“A senior U.S. intelligence official with direct knowledge confirmed to NBC News that the report on Russian hacking delivered to President Obama Thursday says that U.S. intelligence picked up senior Russian officials celebrating Donald Trump's win.",
  "The source described the intelligence about the celebration, first reported by the Washington Post, as a minor part of the overall intelligence report, which makes the case that Russia intervened in the election.” More: “The U.S. has also identified Russian actors who turned over stolen Democratic material to WikiLeaks, the source said.” And: “Two top intelligence officials with direct knowledge told NBC News that the report on Russian hacking also details Russian cyberattacks not just against the Democratic National Committee, but the White House, the Joint Chiefs of Staff, the State Department and American corporations.”\n\nBlast from the past\n\n“Boy, I love reading those WikiLeaks”: And here’s a reminder how Trump used Russia’s hacking – via the WikiLeaks disclosures – in the last week or so of the presidential race:\n\nOct. 31 from Warren, MI: “Did you see where, on WikiLeaks, it was announced that they were paying protestors to be violent, $1,500?...",
  "Did you see another one, another one came in today?",
  "This WikiLeaks is like a treasure trove.”\n\nNov. 2 from Orlando, FL: “Out today, WikiLeaks just came out with a new one, just a little a while ago, it's just been shown that a rigged system with more collusion, possibly illegal, between the Department of Justice, the Clinton campaign and the State Department.”\n\nNov. 2 from Pensacola, FL: “They said about Hillary, she's got bad instincts right.",
  "You know who said that, Podesta.",
  "I would fire Podesta so fast.",
  "I mean the way he talks about her, whether true, not true, who cares.",
  "He speaks so badly about her.",
  "Of course he didn't know there was a thing called WikiLeaks right.”\n\nNov. 4 from Wilmington, OH: “Boy, I love reading those WikiLeaks.”\n\nNov. 6 from Sioux City, IA: “Just today, we learned Hillary Clinton was sending highly classified information through her maid.",
  "Did you see?",
  "Just came out a little while ago, who therefore had total access to this information, completely jeopardizing the national security of the United States.",
  "This just came out.",
  "WikiLeaks.”\n\nNov. 7 from Manchester, NH: “Hillary has shown contempt for the working people of this country.",
  "Her campaign in WikiLeaks has spoken horribly about Catholics and evangelicals and so many others.",
  "They got it all down folks, WikiLeaks.",
  "WikiLeaks.",
  "And what Podesta said about her, bad instincts.",
  "He said she's got bad instincts.”\n\nMattis clashing with Team Trump?",
  "The Washington Post’s Josh Rogin: “The honeymoon seems to be ending between retired Gen. James N. Mattis and Donald Trump’s transition team amid an increasingly acrimonious dispute over who will get top jobs in the Defense Department — and who gets to make those decisions.",
  "With only two weeks left before Inauguration Day and days before Mattis’s Senate confirmation hearing, most major Pentagon civilian positions remain unfilled.",
  "Behind the scenes, Mattis has been rejecting large numbers of candidates offered by the transition team for several top posts, two sources close to the transition said.",
  "The dispute over personnel appointments is contributing to a tenser relationship between Mattis and the transition officials, which could set the stage for turf wars between the Pentagon and the White House in the coming Trump administration.”\n\nCotton: “I don't think we can just repeal Obamacare and say we're going to get the answer two years from now”\n\nBy the way, don’t miss what Sen. Tom Cotton (R-AR) told one us yesterday.",
  "\"I don't think we can just repeal Obamacare and say we're going to get the answer two years from now,\" he said on MSNBC’s “MTPDaily.” At least among some Senate Republicans, there’s a recognition that they need an Obamacare replacement ASAP.",
  "The problem?",
  "A replacement (which inevitably has tradeoffs and creates winners and losers) is so much harder than repeal itself.",
  "Trump Cabinet Watch"
]