[
  "Determined to stop Russia's interference in the presidential campaign, at least one of President Obama's senior advisers urged him to make the ultimate threat to Russian President Vladimir Putin, U.S. officials told NBC News:\n\nMess with the vote and we will consider it an act of war.",
  "SEE ALSO: Putin speaks out after Russian ambassador killed\n\nBut Obama opted not to issue a warning that specific when he spoke to Putin about the hacking during a September meeting at the G-20 summit in China, said intelligence officials offering NBC News exclusive new details.",
  "The president didn't want to inflame an already tense situation, the officials said.",
  "Instead, he used less specific language to warn Putin of consequences if Russian interference didn't stop.",
  "The release of hacked Democratic emails continued.",
  "RELATED: Obama through the years:\n\n\n\n26 PHOTOS Barack Obama through the years See Gallery Barack Obama through the years Barack Obama, candidate for a Senate seat in Illinois and one of the keynote speakers of the 2004 Democratic National Convention, addresses delegates during the second night of the event at the FleetCenter in Boston, July 27, 2004.",
  "More than 4,000 delegates to the convention will nominate John Kerry on Wednesday to challenge President George W. Bush in a November battle for the White House that is essentially a dead heat.",
  "REUTERS/Gary Hershorn US ELECTION HB/ Illinois U.S. Senate candidate Democrat Barack Obama (2nd R), wife Michelle and their daughters Malia (R), 3, and Sasha (L), 6, spend time in their Chicago hotel room, November 2, 2004.",
  "Obama faces Republican candidate Alan Keys in the first Senate race with two African American candidates.",
  "REUTERS/John Gress JG Senators Joseph Lieberman (D-CT) (L), Hillary Clinton (D-NY) (2nd L), Jeff Bingaman (D-NM) (R) and Barbara Boxer (D-CA) (2nd R) listen as Senator Barack Obama (D-IL) addresses a news conference on Capitol Hill in Washington November 17, 2005.",
  "Obama said that Americans are looking for leadership and can do better than what they have gotten from Washington in 2004.",
  "REUTERS/Jonathan Ernst U.S.",
  "Senators Hillary Clinton (D-NY) (R) and Barack Obama (D-IL) hold a news conference on a vote raising the federal minimum wage on Capitol Hill in Washington February 1, 2007.",
  "REUTERS/Jim Young (UNITED STATES) Democratic presidential candidate Senator Barack Obama (D-IL) (L) smiles beside Senator Edward Kennedy (D-MA) at a rally at American University in Washington January 28, 2008.",
  "Kennedy, a Democratic icon and a leading liberal voice, endorsed Obama on Monday for the party's presidential nomination and called the young lawmaker an inspirational uniter.",
  "REUTERS/Mike Theiler (UNITED STATES) US PRESIDENTIAL ELECTION CAMPAIGN 2008 (USA) U.S. Democratic presidential candidate, Senator Barack Obama (D-IL), greets entertainer and talk show host Oprah Winfrey at a rally in Des Moines, Iowa, December 8, 2007.",
  "Iowa holds the first-in-the-nation caucuses for the 2008 presidential election on January 3.",
  "REUTERS/Ramin Rahimian (UNITED STATES) US Democratic presidential candidates Senator Barack Obama (D-IL) and former Senator John Edwards (D-NC) talk during a Martin Luther King Day rally at the state capitol in Columbia, South Carolina January 21, 2008.",
  "REUTERS/Jonathan Ernst (UNITED STATES) US PRESIDENTIAL ELECTION CAMPAIGN 2008 (USA) US Democratic presidential candidate Senator Barack Obama (D-IL) (C) reacts as he holds a baby at a rally in Columbia, South Carolina, January 20, 2008.",
  "REUTERS/Jonathan Ernst (UNITED STATES) US PRESIDENTIAL ELECTION CAMPAIGN 2008 (USA) Democratic Vice-Presidential candidate Sen. Joe Biden (D-DE) (L) points to the crowd as Presidential candidate Sen. Barack Obama (D-IL) looks on after his acceptance speech at the 2008 Democratic National Convention in Denver, Colorado August 28, 2008.",
  "REUTERS/Jim Young (UNITED STATES) US PRESIDENTIAL ELECTION CAMPAIGN 2008 (USA) Democratic presidential nominee U.S.",
  "Senator Barack Obama (D-IL) embraces his wife Michelle after giving his acceptance speech at the 2008 Democratic National Convention in Denver, Colorado August 28, 2008.",
  "REUTERS/Jim Young (UNITED STATES) US PRESIDENTIAL ELECTION CAMPAIGN 2008 (USA) U.S. President Barack Obama shakes hands with well-wishers at Hradcanske Square in central Prague April 5, 2009.",
  "As long as a potential nuclear threat persists from Iran, the United States will continue pushing plans for missile defense, U.S. President Barak Obama said on Sunday.",
  "REUTERS/Leonhard Foeger (CZECH REPUBLIC POLITICS) British Prime Minister Tony Blair (C) meets U.S.",
  "Senators Richard G. Luger of Indiana (R) and Barrack Obama of Ilinois (L) for talks at the Prime Minister's official residence in Downing Street in London, September 1, 2005.",
  "REUTERS/ Alessandro Abbonizo/ Pool TM/JV U.S. President Barack Obama signs the Don't Ask, Don't Tell Repeal Act of 2010 into law at the U.S. Department of Interior in Washington, December 22, 2010.",
  "From L-R are (standing): Vice President Joseph Biden, Chairman of the Joint Chiefs Mike Mullen, former U.S. Navy Commander Zoe Dunning, former USMC StaffSgt.",
  "Eric Alva, Deputy Secretary of Defense William Lynn, Speaker of the House Nancy Pelosi, Rep. Patrick Murphy (D-Pa), Rep. Susan Davis (D-Ca), and Senate Majority Leader Harry Reid.",
  "REUTERS/Larry Downing (UNITED STATES - Tags: POLITICS MILITARY SOCIETY IMAGES OF THE DAY) U.S. President Barack Obama (L) enjoys a beer with Dakota Meyer on the patio outside of the White House Oval Office, in this handout photograph taken on September 14, 2011 and released on September 15.",
  "The president on Thursday will present Meyer with the Medal of Honor for courageous actions taken while serving as a then U.S. Marine Corps Corporal, part of a Marine embedded training team in Afghanistan on September 8, 2009, the White House statement said.",
  "REUTERS/Pete Souza/Handout (UNITED STATES - Tags: POLITICS MILITARY SOCIETY TPX IMAGES OF THE DAY) FOR EDITORIAL USE ONLY.",
  "NOT FOR SALE FOR MARKETING OR ADVERTISING CAMPAIGNS.",
  "THIS IMAGE HAS BEEN SUPPLIED BY A THIRD PARTY.",
  "IT IS DISTRIBUTED, EXACTLY AS RECEIVED BY REUTERS, AS A SERVICE TO CLIENTS U.S. President Barack Obama and first lady Michelle Obama dance while the band Earth, Wind and Fire performs at the Governors Ball in the State Dining Room of the White House, in this handout photograph taken on February 22, 2009 and later released by the White House.",
  "REUTERS/Pete Souza/The White House/Handout (UNITED STATES POLITICS) FOR EDITORIAL USE ONLY.",
  "NOT FOR SALE FOR MARKETING OR ADVERTISING CAMPAIGNS U.S. President Barack Obama, along with Cabinet Secretaries and Members of Congress, watch a shot during a basketball game on the White House court in this handout photo taken in Washington on October 8, 2009 and later released by the White House.",
  "REUTERS/Pete Souza/The White House/Handout U.S. President Barack Obama eats a nectarine following a town hall meeting at Kroger's Supermarket in this handout photo taken in Bristol, Virginia.",
  "on July 29, 2009 and later released by the White House.",
  "REUTERS/Pete Souza/The White House/Handout U.S. President Barack Obama listens during a briefing on the BP oil spill in the Gulf of Mexico, while aboard Air Force One en route to New Orleans, Louisiana, in this White House handout photo taken on May 2, 2010 and released on June 7, 2010.",
  "Picture taken May 2, 2010.",
  "REUTERS/Pete Souza/The White House (UNITED STATES - Tags: POLITICS ENVIRONMENT ENERGY DISASTER) FOR EDITORIAL USE ONLY.",
  "NOT FOR SALE FOR MARKETING OR ADVERTISING CAMPAIGNS U.S. President Barack Obama and his daughter Sasha swim at Alligator Point in Panama City Beach, Florida, August 14, 2010.",
  "Declaring Gulf Coast beaches \"open for business,\" Obama visited Florida on Saturday and pledged to restore the economy and the environment of the region damaged by the BP Plc oil spill.",
  "Obama, on his fifth visit to the region since BP's deep-sea well in the Gulf of Mexico ruptured on April 20, held talks with local business owners to hear their concerns about the impact of the world's worst offshore oil spill.",
  "REUTERS/Pete Souza-The White House/Handout (UNITED STATES - Tags: POLITICS ENERGY ENVIRONMENT DISASTER IMAGES OF THE DAY) FOR EDITORIAL USE ONLY.",
  "NOT FOR SALE FOR MARKETING OR ADVERTISING CAMPAIGNS U.S. President Barack Obama (2nd L) and Vice President Joe Biden (L), along with members of the national security team, receive an update on the mission against Osama bin Laden in the Situation Room of the White House, May 1, 2011.",
  "Also pictured are Secretary of State Hillary Clinton (2nd R) and Defense Secretary Robert Gates (R).",
  "In the decade since the Sept. 11 2001 attacks, U.S. Special Operations Command personnel numbers have doubled, its budget tripled and deployments quadrupled.",
  "The Bin Laden takedown is simply the tip of an iceberg of fast-growing, largely hidden action by the United States and its allies.",
  "Those with knowledge of such operations say this changing state of warfare could spark a range of unintended consequences, from jeopardizing diplomatic relationships to unwanted, wider wars.",
  "Please note: A classified document seen in this photograph has been obscured at source.",
  "Picture taken May 1, 2011.",
  "To match Analysis CONFLICT/COVERTOPS REUTERS/White House/Pete Souza/Handout/Files (UNITED STATES - Tags: POLITICS CIVIL UNREST MILITARY) FOR EDITORIAL USE ONLY.",
  "NOT FOR SALE FOR MARKETING OR ADVERTISING CAMPAIGNS.",
  "THIS IMAGE HAS BEEN SUPPLIED BY A THIRD PARTY.",
  "IT IS DISTRIBUTED, EXACTLY AS RECEIVED BY REUTERS, AS A SERVICE TO CLIENTS U.S. President Barack Obama shoots clay targets with a shotgun on the range at Camp David, Maryland, in this White House handout photo taken August 4, 2012.",
  "REUTERS/White House/Pete Souza/Handout (UNITED STATES - Tags: POLITICS SOCIETY TPX IMAGES OF THE DAY) FOR EDITORIAL USE ONLY.",
  "NOT FOR SALE FOR MARKETING OR ADVERTISING CAMPAIGNS.",
  "THIS IMAGE HAS BEEN SUPPLIED BY A THIRD PARTY.",
  "IT IS DISTRIBUTED, EXACTLY AS RECEIVED BY REUTERS, AS A SERVICE TO CLIENTS Britain's Prime Minister David Cameron (L to R) , U.S. President Barack Obama, and Germany's Chancellor Angela Merkel watch the overtime shootout of the Chelsea vs. Bayern Munich Champions League final in the Laurel Cabin conference room during the G8 Summit at Camp David, Maryland, May 19, 2012.",
  "REUTERS/White House/ Pete Souza/POOL (UNITED STATES - Tags: POLITICS SPORT SOCCER) WASHINGTON - MARCH 23: U.S. President Barack Obama signs the Affordable Health Care for America Act during a ceremony with fellow Democrats in the East Room of the White House March 23, 2010 in Washington, DC.",
  "The historic bill was passed by the House of Representatives Sunday after a 14-month-long political battle that left the legislation without a single Republican vote.",
  "(Photo by Win McNamee/Getty Images) U.S. President Barack Obama and his daughters Malia (L) and Sasha, watch on television as first lady Michelle Obama takes the stage to deliver her speech at the Democratic National Convention, in the Treaty Room of the White House in Washington September 4, 2012.",
  "REUTERS/White House/Pete Souza/Handout (UNITED STATES - Tags: POLITICS ELECTIONS TPX IMAGES OF THE DAY) FOR EDITORIAL USE ONLY.",
  "NOT FOR SALE FOR MARKETING OR ADVERTISING CAMPAIGNS U.S. President Barack Obama walks onstage with daughter Sasha (2R), First lady Michelle Obama (2L) and daughter Malia (L) before giving his election night victory speech in Chicago, November 7, 2012.",
  "REUTERS/Kevin Lamarque (UNITED STATES - Tags: POLITICS ELECTIONS USA PRESIDENTIAL ELECTION) U.S. President Barack Obama talks to the media as he signs into law S. 337: FOIA Improvement Act of 2016 and S. 2328: Puerto Rico Oversight, Management and Economic Stability Act at the Oval Office of the White House in Washington, U.S., June 30, 2016.",
  "REUTERS/Carlos Barria Up Next See Gallery Discover More Like This HIDE CAPTION SHOW CAPTION of SEE ALL BACK TO SLIDE\n\nA month later, the U.S. used the latest incarnation of an old Cold War communications system — the so-called \"Red Phone\" that connects Moscow to Washington — to reinforce Obama's September warning that the U.S. would consider any interference on Election Day a grave matter.",
  "This time Obama used the phrase \"armed conflict.\"",
  "\"International law, including the law for armed conflict, applies to actions in cyberspace,\" said part of a message sent over the Red Phone on Oct. 31, according to a senior U.S. official.",
  "\"We will hold Russia to those standards.\"",
  "The so-called \"Red Phone\" system is used to communicate in moments of crisis, such as the September 11, 2001 terror attacks or the U.S. invasion of Iraq.",
  "Formally known as the Nuclear Risk Reduction Center line, it is no longer a literal phone, and instead sends email messages and attachments.",
  "The Obama administration had never used the system before, officials said.",
  "Several intelligence officials told NBC News the use of the Red Phone communicated just how serious the situation had become.",
  "\"It's a dramatic step to pick that phone up and use it,\" said Ret.",
  "Adm. James Stavridis, the former head of NATO.",
  "Did the Red Phone message work?",
  "\"Look at the results,\" said an Obama administration official.",
  "\"There was nothing done on Election Day, so it must have worked.\"",
  "He meant that the nightmare scenario officials feared didn't occur: An attempt by Russia to manipulate the voting results or throw them into question.",
  "Having lost a close election, however, senior Democrats don't see the White House pushback against Putin as a success.",
  "The Russians had already stolen reams of emails and used them to embarrass Hillary Clinton and the Democrats.",
  "Whether those revelations swung the election can never be known, but Democrats say they played a major role in an election decided by fewer than 80,000 votes spread across three states.",
  "Donna Brazile, a Democratic party official, has said publicly that attempted cyber intrusions of Democratic Party systems continued through Election Day — and that Democrats felt abandoned by the government.",
  "SEE ALSO: Very strong signs' killer was follower of exiled cleric\n\nA senior intelligence official told NBC News the message ultimately sent to the Russians was \"muddled\" — with no bright line laid down and no clear warning given about the consequences.",
  "The Russian response, said the official, was non-committal.",
  "\"The Ultimate Red Line\"\n\n\n\nIn a statement, a senior White House official confirmed that the Red Phone was used on Oct. 31 to send a message to Moscow.",
  "\"This action was part of our ongoing, rigorous efforts to press the Russian government to halt the actions of those responsible for these cyber attacks.\"",
  "The official declined to provide details of the message, however.",
  "Obama claimed success for his message to Putin at a news conference last Friday.",
  "\"I felt that the most effective way to ensure that that didn't happen was to talk to him directly and tell him to cut it out and there were going to be serious consequence if he didn't,\" said Obama.",
  "\"In fact, we didn't see further tampering of the election process.\"",
  "Stavridis, whom Hillary Clinton considered as a potential running mate, said he believed the U.S. response to the Russian hacks \"was insufficient to achieve the objective of ensuring that we do not receive further attacks.",
  "In other words, when someone tries to bully you, you have to push back or you invite further response.\"",
  "But he also said the word \"war\" has to be deployed \"extremely carefully.\"",
  "\"I think declaring something an act of war, let's face it, is the ultimate red line.\"",
  "RELATED: Obama and Putin's meetings through the years:\n\n\n\n4 PHOTOS Obama and Putin's awkward meetings through the years See Gallery Obama and Putin's awkward meetings through the years BEIJING, CHINA - NOVEMBER 10: U.S. President Barack Obama (L) and Russian President Vladimir Putin (R) attend a family photo ceremony during the APEC Leaders meeting November 10, 2014 in Beijing, China.",
  "The APEC Summit hosted 1500 economic leaders in Beijing to deliberate key issues facing the Asia-Pacific economy.",
  "(Photo by Sasha Mordovets/Getty Images) SAINT PETERSBURG - SEPTEMBER 05: U.S. President Barack Obama (R) greets Russian President Vladimir Putin at the G20 summit on September 5, 2013 in St. Petersburg, Russia.",
  "The G20 summit is expected to be dominated by the issue of military action in Syria while issues surrounding the global economy, including tax avoidance by multinationals, will also be discussed during the two-day summit.",
  "(Photo by Sasha Mordovets/Getty Images) Russias President Vladimir Putin (L) walks past US President Barack Obama as he arrives to pose for the family photo during the G20 summit on September 6, 2013 in Saint Petersburg.",
  "World leaders at the G20 summit on Friday failed to bridge their bitter divisions over US plans for military action against the Syrian regime, with Washington signalling that it has given up on securing Russia's support at the UN on the crisis.",
  "AFP PHOTO / JEWEL SAMAD (Photo credit should read JEWEL SAMAD/AFP/Getty Images) ENNISKILLEN, NORTHERN IRELAND - JUNE 18: Leaders (L-R) Russia's President Vladimir Putin, Britain's Prime Minister David Cameron, US President Barack Obama stand for the 'family' group photograph at the G8 venue of Lough Erne on June 18, 2013 in Enniskillen, Northern Ireland.",
  "The two day G8 summit, hosted by UK Prime Minister David Cameron, is being held in Northern Ireland for the first time.",
  "Leaders from the G8 nations have gathered to discuss numerous topics with the situation in Syria expected to dominate the talks.",
  "(Photo by Matt Cardy/Getty Images) Up Next See Gallery Discover More Like This HIDE CAPTION SHOW CAPTION of SEE ALL BACK TO SLIDE\n\nMore from :\n\nObama avoids criticizing Trump on Russia, but spreads elsewhere\n\nKremlin calls report Putin directed election hack 'laughable nonsense'\n\nU.S. will 'take action' on Russian hacking, Obama promises"
]