[
  "Some of the Trump campaign’s most prominent names and supporters, including Trump’s campaign manager, digital director, and son, pushed tweets from professional trolls paid by the Russian government in the heat of the 2016 election campaign.",
  "The Twitter account @Ten_GOP, which called itself the “Unofficial Twitter account of Tennessee Republicans,” was operated from the Kremlin-backed “Russian troll farm,” or Internet Research Agency, a source familiar with the account confirmed with The Daily Beast.",
  "The account’s origins in the Internet Research Agency were originally reported by the independent Russian news outlet RBC.",
  "@Ten_GOP was created on Nov. 19, 2015, and accumulated over 100 thousand followers before Twitter shut it down.",
  "The Daily Beast independently confirmed the reasons for @Ten_GOP’s account termination.",
  "The discovery of the now-unavailable tweets presents the first evidence that several members of the Trump campaign pushed covert Russian propaganda on social media in the run-up to the 2016 election.",
  "A Twitter spokesperson declined to comment, “for privacy and security reasons.”\n\nTwo days before election day, Trump campaign manager Kellyanne Conway tweeted a post by @Ten_GOP regarding Hillary Clinton’s email.",
  "“Mother of jailed sailor: ‘Hold Hillary to same standards as my son on Classified info’ #hillarysemail #WeinerGate” the tweet reads.",
  "Three weeks before the election, Brad Parscale, the Trump campaign’s digital director, retweeted a separate post from @Ten_GOP.",
  "“Thousands of deplorables chanting to the media: ‘Tell The Truth!’ RT if you are also done w/ biased Media!” the tweet read.",
  "President Trump’s son Donald Trump Jr. followed the account until its closure on Aug. 23 of this year.",
  "Trump Jr. retweeted the account three times, including an allegation of voter fraud in Florida one week before the election.",
  "“BREAKING: #VoterFraud by counting tens of thousands of ineligible mail in Hillary votes being reported in Broward County, Florida Please, RT,” the tweet read.",
  "Trump Jr. also retweeted the account on Election Day.",
  "“This vet passed away last month before he could vote for Trump..",
  "Here he is in his #MAGA hat.. #voted #ElectionDay,” the account wrote.",
  "Former Trump national security adviser Michael Flynn retweeted the Russian-backed troll account at least once.",
  "His son, Michael Flynn Jr., retweeted the account 34 times before it was removed from Twitter in August for its ties to Russian propaganda.",
  "The account notably pushed for Flynn’s reappointment as Trump’s national security adviser, a job Flynn lost after press revelations that he’d lied about his telephone discussions with the Russian ambassador after the election hacks.",
  "It also repeatedly pushed Breitbart-backed talking points, including a fake news story about a gang rape in Twin Falls, Idaho, that merited dozens of articles from Breitbart News.",
  "Flynn Jr. will likely receive a Senate subpoena after he refused to be interviewed for the Senate Intelligence Committee’s Russia investigation, ABC News reported on Tuesday.",
  "Former Trump campaign advisor and longtime confidante of the president Roger Stone retweeted the account three times in 2017, twice to rail against commentators on CNN.",
  "On the same day as the account’s permanent ban, @Ten_GOP was caught passing a photo of the 2016 Cleveland Cavaliers NBA Championship parade in Cleveland as a picture of the crowd gathered outside a Trump rally in Phoenix.",
  "Last March the account was one of the most active in promoting WikiLeaks’ first big release of CIA documents, using the occasion to float the false claim that the so-called Vault 7 documents acquitted Russia in the hack of the Democratic National Committee.",
  "“BREAKING: Obama’s CIA posed as RUSSIAN HACKERS to disguise their dirty work,” read one of the tweets.",
  "“The ‘Russian hacking’ was a false flag by the CIA.",
  "It was done to give Obama a reason to spy on Trump!” read another.",
  "Overt Russian propaganda outlets Sputnik and RT frequently used @Ten_GOP’s tweets in their news stories, including a story titled “Russia has no compromising info on Trump or Clinton, report is ‘total bluff’—Kremlin.”\n\nFar right news sites The Gateway Pundit and InfoWars quoted the account in articles several times.",
  "Fox News cited @Ten_GOP as its sole example of a “Trump fan” in an article titled “Trump fans call for Kellogg’s boycott after brand pulls Breitbart ads” last December.",
  "Former FBI counterterrorism agent Clint Watts, who testified to the Senate Intelligence Committee on Russian cyberattacks, told The Daily Beast that this is “exactly what I was talking about” in his testimony in March.",
  "“If what you said is true, I’d say, ‘My job is done,’” said Watts.",
  "“If this account is definitely an (Internet Research Agency) account, it proved Russian Active Measures (like the 2016 propaganda campaign) works, because Americans will use it against other Americans.”\n\nWatts said the content of these pages is “made to look organic” so that “Americans will use it against their political enemies.”\n\n“If you take rumors, false information, plants, and just repeat them, you’re doing the job of a foreign country.",
  "They are seeding out information or narratives they know candidates or partisans will use.",
  "They were so effective, they had the very top people in the campaign using it,” said Watts.",
  "“Basically, Russia loaded the gun.",
  "The Trump team fired.”\n\nMike Hasson, chief strategist of the Republican data analytics firm Red Metrics, said he remembered seeing the account as far back as the primaries, but became skeptical of the account due to a “couple odd things that stood out.”\n\n“I remember seeing it in late primary season, showing up in my timeline, retweeted by ordinary grassroots people.",
  "Some of the stuff was conspiracy theorist and inflammatory, but other times the content was intended to be inspiring and heartwarming,” said Hasson.",
  "Hasson said he became more confident of Ten_GOP’s origins after the account stopped tweeting about Tennessee and started tweeting about nationalist French presidential candidate Marine Le Pen, then tweeted several links from Russian propaganda network RT.",
  "“For it to jump from Tennessee-related stuff and national stuff to Le Pen, that was probably the trigger point—like, ‘OK, maybe there is something here that’s a lot worse,’” said Hasson.",
  "“At that point, it was much more than just suspicion.",
  "That was more of a confirmation,” he said, of Russia Today’s frequent citation of the account.",
  "“By that point, it had accumulated enough red flags that I felt pretty sure that this was one of the bad guys.”\n\nThe account was retweeted 15 times by far-right agitator Ann Coulter, who also posted one of its tweets to her Twitter account.",
  "Last month, after the account’s closure, someone launched a petition on the White House’s “We The People” site complaining about “a war on conservatives on Twitter.” The petition demanded the reinstatement of several alt-right Twitter accounts that had been suspended from the service, adding “My own account, @Tennessee_GOP, was banned on August the 23th.”\n\nThe petition misstates the name of the @Ten_GOP account, but came at around the same time as two more White House petitions protesting Facebook’s deletion of fake African American and progressive political accounts linked to the Russian active measures campaign.",
  "None of the petitions received enough signatures to qualify for a White House response.",
  "Others in Trump’s inner circle, including former deputy national security advisor Sebastian Gorka, also retweeted Russian-tied Twitter accounts.",
  "Despite posing as Tennessee Republicans, the account never hesitated to push the Kremlin’s talking points on issues like Syria and the French election.",
  "In May, the anonymous operator of a Twitter account called AltCyberCommand used Twitter’s password reset process to try and prove Russia’s involvement.",
  "A video of the hack appeared to show that TEN_GOP’s Twitter account was set up with a phone number in country code 7, indicating the Russian Federation, not Tennessee."
]