[
  "It is fair to say that most Americans don’t know exactly what to make of our ally Turkey these days, as it endures a prolonged political crisis that challenges its long-term stability.",
  "The U.S. media is doing a bang-up job of reporting the Erdogan government’s crackdown on dissidents, but it’s not putting it into perspective.",
  "ADVERTISEMENT\n\nWe must begin with understanding that Turkey is vital to U.S. interests.",
  "Turkey is really our strongest ally against the Islamic State in Iraq and Syria (ISIS), as well as a source of stability in the region.",
  "It provides badly needed cooperation with U.S. military operations.",
  "But the Obama administration is keeping Erdogan’s government at arm’s length — an unwise policy that threatens our long-standing alliance.",
  "The primary bone of contention between the U.S. and Turkey is Fethullah Gülen, a shady Islamic mullah residing in Pennsylvania whom former President Clinton once called his “friend” in a well circulated video.",
  "Gülen portrays himself as a moderate, but he is in fact a radical Islamist.",
  "He has publicly boasted about his “soldiers” waiting for his orders to do whatever he directs them to do.",
  "If he were in reality a moderate, he would not be in exile, nor would he excite the animus of Recep Tayyip Erdogan and his government.",
  "For those of us who have closely studied the careers of Seyed Qutb and Hasan al Bana, the founders and followers of the Muslim Brotherhood, Gülen’s words and activities are very familiar.",
  "The late Seyed Qutb in particular was very much in the Gülen mold.",
  "The author of 24 books on education and the arts, he assembled an inner circle of intellectuals and influential politicians.",
  "But contrary to this well-masked façade, Qutb’s writings provided the inspiration for terrorist groups like Al-Qaeda.",
  "Qutb was hanged in 1966 in Egypt for instigating rebellion.",
  "Likewise, Hasan al Bana, an Egyptian who died in 1949, defined the first phase of pre-emptive jihad as a long and quiet process that can take as long as a quarter of a century, to prepare the forces for a decisive strike.",
  "Al Bana famously declared that the only acceptable form of law is Sharia.",
  "To professionals in the intelligence community, the stamp of terror is all over Mullah Gülen’s statements in the tradition of Qutb and al Bana.",
  "Gülen’s vast global network has all the right markings to fit the description of a dangerous sleeper terror network.",
  "From Turkey’s point of view, Washington is harboring Turkey’s Osama bin Laden.",
  "Washington’s silence on this explosive topic speaks volumes when we hear the incredulous claim that the democratically elected president of Turkey staged a military coup, bombed his own parliament and undermined the confidence in Turkey’s strong economy, just so that he could purge his political opponents.",
  "This baseless claim is a dark reminder of the vicious rumors spread by our enemies that 9/11 was an inside job by the American intelligence apparatus as an excuse to invade Muslim lands to grab their oil!",
  "To add insult to injury, American taxpayers are helping finance Gülen’s 160 charter schools in the United States.",
  "These schools have been granted more H1-B visas than Google.",
  "It is inconceivable that our visa officers have approved thousands of visas for English teachers whose English is incomprehensible.",
  "A CBS “60 Minutes” program documented a conversation with one such imported English teacher from Turkey.",
  "Several lawsuits, including some in Ohio and Texas, point to irregularities in the operation of these schools.",
  "However, funding seems to be no problem for Gülen’s network.",
  "Hired attorneys work to keep the lucrative government source of income for Gülen and his network going.",
  "Influential charities such as Cosmos Foundation continue their support for Gulen’s charter schools.",
  "Incidentally, Cosmos Foundation is a major donor to Clinton Foundation.",
  "No wonder Bill Clinton William (Bill) Jefferson ClintonHillary Clinton draws contrast between sexual misconduct accusations against Trump, Bill Clinton Kavanaugh lesson: Resist the 'resistance' or lose O'Rourke not 'interested' in Obama endorsement MORE calls Mullah Gülen “his friend.” It is now no secret that Huma Abedin, Hillary Clinton Hillary Diane Rodham ClintonTrump touts Kavanaugh confirmation at raucous Iowa rally Trump rally crowd erupts with chants of 'lock her up' about Feinstein Election Countdown: Big fundraising numbers in fight for Senate | Haley resigns in surprise move | Says she will back Trump in 2020 | Sanders hitting midterm trail | Collins becomes top Dem target | Takeaways from Indiana Senate debate MORE’s close aide and confidante, worked for 12 years as the associate editor for a journal published by the London-based Institute of Minority Muslim Affairs.",
  "This institute has promoted the thoughts of radical Muslim thinkers such as Qutb, al Bana and others.",
  "The American public is being lulled into believing that Gülen is a Sufi scholar who promotes the teachings of Rumi, the Persian poet, works to expand interfaith dialogue and does a great job of providing American youth high-quality education in math and science as well as English.",
  "Voices of concern about this shady character are quickly muffled by his vast network of public relations and legal professionals.",
  "He has established a false façade that he is a moderate at odds with Turkey’s autocratic leader.",
  "This image is a stark reminder of a great American mistake from another era — one that has raised the cost of international security forever.",
  "We all remember another quiet, bearded, elder cleric who sat under an apple tree in Neauphle-le-Château in the suburbs of Paris in 1978.",
  "He claimed to be a man of God who wanted to topple a dictator and return the power to the people.",
  "Washington believed him.",
  "Sadly, shortly after his rise to power through the Iranian revolution, we watched in horror as our diplomats were taken hostage for 444 days in what was once one of our strongest allies in the Middle East.",
  "The world has never been the same since that irreversible mistake.",
  "Ayatollah Khomeini, the quiet man of God under the apple tree, created the world’s top sponsor of terror.",
  "His revolutionary guards created Hezbollah, the famous Lebanon-based terror organization.",
  "The Ayatollah’s terrorists have killed American servicemen and slaughtered Iraqi Sunnis by the thousands, and his brutal Quds Force killed innocent Sunni civilians in Syria.",
  "Ultimately, ISIS became the radical Sunni’s response to the mayhem caused by our friendly mullah under the apple tree.",
  "History repeats itself when people repeat the mistakes of the past.",
  "It is time we take a fresh look at the importance of Turkey and place our priorities in proper perspective.",
  "It is unconscionable to militate against Turkey, our NATO ally, as Washington is hoodwinked by this masked source of terror and instability nestled comfortably in our own backyard in Pennsylvania.",
  "We need to adjust our foreign policy to recognize Turkey as a priority.",
  "We need to see the world from Turkey’s perspective.",
  "What would we have done if right after 9/11 we heard the news that Osama bin Laden lives in a nice villa at a Turkish resort while running 160 charter schools funded by the Turkish taxpayers?",
  "The forces of radical Islam derive their ideology from radical clerics like Gülen, who is running a scam.",
  "We should not provide him safe haven.",
  "In this crisis, it is imperative that we remember who our real friends are.",
  "Lt. Gen. Michael T. Flynn (ret.)",
  "is the former director of Defense Intelligence Agency and the author of New York Times Bestseller “The Field of Fight.”\n\nEditor’s Note: On March 8, 2017, four months after this article was published, General Flynn filed documents with the Federal government indicating that he earned $530,000 last fall for consulting work that might have aided the government of Turkey.",
  "In the filings, Flynn disclosed that he had received payments from Inovo BV, a Dutch company owned by a Turkish businessman with ties to Turkey's president and that Inovo reviewed the draft before it was submitted to The Hill.",
  "Neither General Flynn nor his representatives disclosed this information when the essay was submitted.",
  "The views expressed by contributors are their own and not the views of The Hill."
]