[
  "(CNN) President-elect Donald Trump announced he will tap Army Lt. Gen. Michael Flynn for the role of national security advisor, the transition announced Friday.",
  "The announcement Friday said that Flynn was among three high profile national security positions -- including Mike Pompeo for CIA director and Jeff Sessions for attorney general -- that had been offered and accepted.",
  "Flynn, 57, was a top adviser and high-profile surrogate to Trump during his campaign, introducing the President-elect at rallies and serving as a top cheerleader on his hyper-active Twitter feed.",
  "\"General Flynn is one of the country's foremost experts on military and intelligence matters and he will be an invaluable asset to me and my administration,\" Trump said in a statement.",
  "His appointment won't require Senate confirmation, which is potentially helpful for Trump, as Flynn has a long history of controversial remarks and was fired as President Barack Obama's director of the Defense Intelligence Agency in 2014.",
  "Flynn wrote in his 2016 book, \"The Field of Fight,\" that he was booted from Obama's administration by \"censors\" who were unhappy he'd told a congressional committee \"that we were not as safe as we had been a few years back.\"",
  "However, US officials said Flynn was pushed out because of his contentious management style.",
  "Flynn's Twitter feed -- regularly updated with pro-Trump comments -- is another source of potential scrutiny.",
  "Flynn apologized in July after retweeting a message that bashed Jewish people.",
  "The retweet came after Hillary Clinton campaign manager Robby Mook said on CNN that Russia was to blame for hacks of the Democratic National Committee.",
  "\"The corrupt Democratic machine will do and say anything to get #NeverHillary into power.",
  "This is a new low,\" Flynn tweeted.",
  "With it, he shared a link to a tweet by a user who had written, \">Cnn implicated.",
  "'The USSR is to blame!'",
  "... Not anymore, Jews.",
  "Not anymore.\"",
  "Flynn later apologized, saying he'd only meant to retweet Mook's remarks.",
  "A critical role\n\nJUST WATCHED Analyst: Flynn must be smartest guy in room Replay More Videos ... MUST WATCH Analyst: Flynn must be smartest guy in room 00:52\n\nFirst created in the early days of the Cold War, the job of national security advisor is seen as critical to implementing a president's worldview on the various departments and agencies involved in national security.",
  "Famous national security advisers who made a major impact on American foreign policy have included Henry Kissinger, Zbigniew Brzezinski and Brent Scowcroft.",
  "Susan Rice is the current national security advisor.",
  "Flynn enjoys tremendous access and credibility with Trump, especially because he's had several tours of duty on the battlefield.",
  "\"What makes Gen. Flynn different from so many others that we've heard about on Donald Trump's transition team is he is the one with the real experience fighting on the ground in Afghanistan and Iraq,\" said Peter Bergen, CNN's national security analyst.",
  "\"Certainly, he would be a very plausible candidate for national security advisor, which is arguably the most important national security position in the government,\" Bergen added.",
  "But the question may be whether his management style rubs people the wrong way.",
  "Photos: Donald Trump's rise President-elect Donald Trump has been in the spotlight for years.",
  "From developing real estate and producing and starring in TV shows, he became a celebrity long before winning the White House.",
  "Hide Caption 1 of 37 Photos: Donald Trump's rise Trump at age 4.",
  "He was born in 1946 to Fred and Mary Trump in New York City.",
  "His father was a real estate developer.",
  "Hide Caption 2 of 37 Photos: Donald Trump's rise Trump, left, in a family photo.",
  "He was the second-youngest of five children.",
  "Hide Caption 3 of 37 Photos: Donald Trump's rise Trump, center, stands at attention during his senior year at the New York Military Academy in 1964.",
  "Hide Caption 4 of 37 Photos: Donald Trump's rise Trump, center, wears a baseball uniform at the New York Military Academy in 1964.",
  "After he graduated from the boarding school, he went to college.",
  "He started at Fordham University before transferring and later graduating from the Wharton School, the University of Pennsylvania's business school.",
  "Hide Caption 5 of 37 Photos: Donald Trump's rise Trump stands with Alfred Eisenpreis, New York's economic development administrator, in 1976 while they look at a sketch of a new 1,400-room renovation project of the Commodore Hotel.",
  "After graduating college in 1968, Trump worked with his father on developments in Queens and Brooklyn before purchasing or building multiple properties in New York and Atlantic City, New Jersey.",
  "Those properties included Trump Tower in New York and Trump Plaza and multiple casinos in Atlantic City.",
  "Hide Caption 6 of 37 Photos: Donald Trump's rise Trump attends an event to mark the start of construction of the New York Convention Center in 1979.",
  "Hide Caption 7 of 37 Photos: Donald Trump's rise Trump wears a hard hat at the Trump Tower construction site in New York in 1980.",
  "Hide Caption 8 of 37 Photos: Donald Trump's rise Trump was married to Ivana Zelnicek Trump from 1977 to 1990, when they divorced.",
  "They had three children together: Donald Jr., Ivanka and Eric.",
  "Hide Caption 9 of 37 Photos: Donald Trump's rise The Trump family, circa 1986.",
  "Hide Caption 10 of 37 Photos: Donald Trump's rise Trump uses his personal helicopter to get around New York in 1987.",
  "Hide Caption 11 of 37 Photos: Donald Trump's rise Trump stands in the atrium of the Trump Tower.",
  "Hide Caption 12 of 37 Photos: Donald Trump's rise Trump attends the opening of his new Atlantic City casino, the Taj Mahal, in 1989.",
  "Hide Caption 13 of 37 Photos: Donald Trump's rise Trump signs his second book, \"Trump: Surviving at the Top,\" in 1990.",
  "Trump has published at least 16 other books, including \"The Art of the Deal\" and \"The America We Deserve.\"",
  "Hide Caption 14 of 37 Photos: Donald Trump's rise Trump and singer Michael Jackson pose for a photo before traveling to visit Ryan White, a young child with AIDS, in 1990.",
  "Hide Caption 15 of 37 Photos: Donald Trump's rise Trump dips his second wife, Marla Maples, after the couple married in a private ceremony in New York in December 1993.",
  "The couple divorced in 1999 and had one daughter together, Tiffany.",
  "Hide Caption 16 of 37 Photos: Donald Trump's rise Trump putts a golf ball in his New York office in 1998.",
  "Hide Caption 17 of 37 Photos: Donald Trump's rise An advertisement for the television show \"The Apprentice\" hangs at Trump Tower in 2004.",
  "The show launched in January of that year.",
  "In January 2008, the show returned as \"Celebrity Apprentice.\"",
  "Hide Caption 18 of 37 Photos: Donald Trump's rise A 12-inch talking Trump doll is on display at a toy store in New York in September 2004.",
  "Hide Caption 19 of 37 Photos: Donald Trump's rise Trump attends a news conference in 2005 that announced the establishment of Trump University.",
  "From 2005 until it closed in 2010, Trump University had about 10,000 people sign up for a program that promised success in real estate.",
  "Three separate lawsuits -- two class-action suits filed in California and one filed by New York's attorney general -- argued that the program was mired in fraud and deception.",
  "Trump's camp rejected the suits' claims as \"baseless.\"",
  "And Trump has charged that the New York case against him is politically motivated.",
  "Hide Caption 20 of 37 Photos: Donald Trump's rise Trump attends the U.S. Open tennis tournament with his third wife, Melania Knauss-Trump, and their son, Barron, in 2006.",
  "Trump and Knauss married in 2005.",
  "Hide Caption 21 of 37 Photos: Donald Trump's rise Trump wrestles with \"Stone Cold\" Steve Austin at WrestleMania in 2007.",
  "Trump has close ties with the WWE and its CEO, Vince McMahon.",
  "Hide Caption 22 of 37 Photos: Donald Trump's rise For \"The Apprentice,\" Trump was honored with a star on the Hollywood Walk of Fame in January 2007.",
  "Hide Caption 23 of 37 Photos: Donald Trump's rise Trump appears on the set of \"The Celebrity Apprentice\" with two of his children -- Donald Jr. and Ivanka -- in 2009.",
  "Hide Caption 24 of 37 Photos: Donald Trump's rise Trump poses with Miss Universe contestants in 2011.",
  "Trump had been executive producer of the Miss Universe, Miss USA and Miss Teen USA pageants since 1996.",
  "Hide Caption 25 of 37 Photos: Donald Trump's rise In 2012, Trump announces his endorsement of Republican presidential candidate Mitt Romney.",
  "Hide Caption 26 of 37 Photos: Donald Trump's rise Trump speaks in Sarasota, Florida, after accepting the Statesman of the Year Award at the Sarasota GOP dinner in August 2012.",
  "It was shortly before the Republican National Convention in nearby Tampa.",
  "Hide Caption 27 of 37 Photos: Donald Trump's rise Trump appears on stage with singer Nick Jonas and television personality Giuliana Rancic during the 2013 Miss USA pageant.",
  "Hide Caption 28 of 37 Photos: Donald Trump's rise In June 2015, during a speech from Trump Tower, Trump announced that he was running for President.",
  "He said he would give up \"The Apprentice\" to run.",
  "Hide Caption 29 of 37 Photos: Donald Trump's rise Trump -- flanked by U.S. Sens.",
  "Marco Rubio, left, and Ted Cruz -- speaks during a CNN debate in Miami on March 10.",
  "Trump dominated the GOP primaries and emerged as the presumptive nominee in May.",
  "Hide Caption 30 of 37 Photos: Donald Trump's rise The Trump family poses for a photo in New York in April.",
  "Hide Caption 31 of 37 Photos: Donald Trump's rise Trump speaks during a campaign event in Evansville, Indiana, on April 28.",
  "After Trump won the Indiana primary, his last two competitors dropped out of the GOP race.",
  "Hide Caption 32 of 37 Photos: Donald Trump's rise Trump delivers a speech at the Republican National Convention in July, accepting the party's nomination for President.",
  "\"I have had a truly great life in business,\" he said.",
  "\"But now, my sole and exclusive mission is to go to work for our country -- to go to work for you.",
  "It's time to deliver a victory for the American people.\"",
  "Hide Caption 33 of 37 Photos: Donald Trump's rise Trump faces Democratic nominee Hillary Clinton in the first presidential debate, which took place in Hempstead, New York, in September.",
  "Hide Caption 34 of 37 Photos: Donald Trump's rise Trump apologizes in a video, posted to his Twitter account in October, for vulgar and sexually aggressive remarks he made a decade ago regarding women.",
  "\"I said it, I was wrong and I apologize,\" Trump said, referring to lewd comments he made during a previously unaired taping of \"Access Hollywood.\"",
  "Multiple Republican leaders rescinded their endorsements of Trump after the footage was released.",
  "Hide Caption 35 of 37 Photos: Donald Trump's rise Trump walks on stage with his family after he was declared the election winner on November 9.",
  "\"Ours was not a campaign, but rather, an incredible and great movement,\" he told his supporters in New York.",
  "Hide Caption 36 of 37 Photos: Donald Trump's rise Trump is joined by his family as he is sworn in as President on January 20.",
  "Hide Caption 37 of 37\n\nGiven Trump's reputation for loyalty, it is no surprise that Flynn would find himself in a key role in the Trump administration.",
  "But Flynn, having only retired from the Army in 2014, is actually limited in the positions he could fill.",
  "By law, military officers must be out of uniform for at least seven years before they are eligible to become secretary of defense, though it is possible that Congress could grant a waiver that would allow Flynn to be named to that post.",
  "Even before it was announced, the idea of Flynn becoming national security advisor was met with opposition from some Democrats.",
  "Rep. Adam Schiff, the ranking member on the House Select Committee on Intelligence, told CNN's Wolf Blitzer Wednesday, \"I'd be worried about an impulsive president with an impulsive national security advisor.\"",
  "Handling of classified information\n\nAt the Republican National Convention, amid shouts of \"lock her up\" from the audience, Flynn delivered a fiery speech condemning Clinton's handling of emails on her private server.",
  "\"I have called on Hillary Clinton to drop out of the race because she put our nation's security at extremely high risk with her careless use of a private email server,\" Flynn said.",
  "But Flynn's own record with classified information has been called into question during his military career.",
  "On at least two occasions, his handling of classified information came under scrutiny by the US military.",
  "JUST WATCHED Can Trump be trusted with nuclear weapons?",
  "Replay More Videos ... MUST WATCH Can Trump be trusted with nuclear weapons?",
  "02:40\n\nTwo former government officials with direct knowledge of the issue tell CNN that while Flynn oversaw intelligence in Afghanistan, he shared classified information with Pakistan on terror networks responsible for killing American troops.",
  "The intelligence, the sources say, came from another agency.",
  "Flynn wasn't supposed to share it.",
  "They say he was trying to convince Pakistan to stop sheltering terrorists.",
  "Asked by email about the allegation, Flynn told CNN, \"It is not true ... not even close.\"",
  "Flynn declined to comment further.",
  "In separate incident, the two officials with whom CNN spoke said Flynn did not follow established security procedures when he shared classified intelligence with allies.",
  "In an August interview with The Washington Post, Flynn has acknowledged the incident.",
  "\"The investigation on me was for sharing intelligence with the Brits and Australians in combat, and I'm proud of that one,\" he told the paper.",
  "\"That was substantiated because I actually did it.\"",
  "Flynn says he had permission to share the classified information.",
  "In both cases, sources say the retired general was informally reprimanded but never charged with wrongdoing.",
  "And in 2010, while still a serving senior officer, he published an article criticizing the state of US intelligence operations in Afghanistan.",
  "CNN has learned the CIA was so furious at Flynn for publicly disclosing shortfalls that the agency complained to the Pentagon, which had signed off on the article."
]