[
  "CLOSE President-elect Donald Trump has offered Republican Senator Jeff Sessions the job of U.S. Attorney General, CBS News and Bloomberg reported on Friday.",
  "USA TODAY\n\nDonald Trump stands next to Sen. Jeff Sessions, R-Ala., as Sessions speaks during a rally on Feb. 28, 2016, in Madison, Ala. (Photo: John Bazemore, AP)\n\nPresident-elect Donald Trump has picked Sen. Jeff Sessions for attorney general and Rep. Mike Pompeo as director of the CIA, presidential transition officials told USA TODAY.",
  "The sources, who weren't authorized to speak publicly, also confirmed retired Army lieutenant general Mike Flynn has been offered the position of Trump's national security advisor.",
  "The president-elect offered Sessions, the Alabama Republican, the job of the nation's top law enforcement officer after the pair met on Thursday in New York.",
  "Sessions, 69, has been in the Senate since 1997.",
  "He is a former U.S. Attorney in Mobile, Ala., and former Alabama Attorney General.",
  "He was the first senator to endorse Trump during the Republican primary early this year and has been a close adviser to Trump ever since.",
  "Pompeo, a Republican and a Tea Party member, has represented Kansas' 4th Congressional district since 2011.",
  "He was a particularly outspoken critic of former Secretary of State Hillary Clinton's role in Benghazi.",
  "As a member of the House Intelligence Committee, the former Army officer gained a high profile for his role in the congressional investigation of the 2012 attack on the American diplomatic compound there.",
  "Sessions and Trump initially bonded over their shared views on immigration and trade policy.",
  "But Sessions’ background as a prosecutor and his longtime seat on the Senate Judiciary Committee have been at the center of his Senate career.",
  "He's a fierce partisan who is known for opposing efforts to provide legal status to immigrants who entered the country illegally, whether the idea came from Republican or Democratic administrations.",
  "If the Sessions pick is officially confirmed by the president-elect, his confirmation process will likely rehash one of his darkest professional moments.",
  "The Senate Judiciary Committee 30 years ago rejected Sessions' nomination for a federal judgeship after hearing testimony about racially insensitive remarks he made to colleagues in the U.S. Attorney's office in south Alabama.",
  "There were allegations that Sessions called a black attorney in his office ''boy''; that he said the Ku Klux Klan was acceptable until he found out some of its members smoked pot; and that he described some prominent civil rights organizations as ''un-American.''",
  "''I deny as strongly as I can express it that I am insensitive to the concerns of blacks,\" Sessions said at the end of four days of testimony, but it was not enough and his nomination was rejected.",
  "Sessions would go on to win several statewide elections in Alabama and eventually a seat on the very committee that had rejected him.",
  "He was also the ranking Republican on the judiciary committee when President Obama's Supreme Court nominees, Elena Kagan and Sonia Sotomayor, were confirmed.",
  "He opposed both.",
  "Stephen Boyd, a former communications director for Sessions who is now chief of staff to a House member from Alabama, said he expected former Sessions' staffers to step forward and defend his record on race.",
  "\"Jeff Sessions is a man of high integrity and moral character,\" Boyd said.",
  "\"I spent many hours working by his side and know him to be the same man behind closed doors that he is in the public's eye.",
  "I'm confident that the people who have worked the closest with Sessions over the years will be eager to come forward and talk about the honest and fair man they know.\"",
  "The emerging defense for Sessions indicates that Trump's team is bracing for opposition from Democrats and civil rights groups concerned about a Justice Department that might seek to roll back certain legal protections for minorities or place less emphasis on issues like voting rights.",
  "Although Sessions voted to extend the Voting Rights Act when it was last reauthorized by Congress, he also agreed with the Supreme Court ruling that eliminated a key part of the landmark civil rights law.",
  "Kristen Clarke, president of the Lawyers Committee for Civil Rights Under Law, said Thursday night that a Sessions nomination could be polarizing.",
  "“That role should be occupied by someone who has a commitment to ensuring equal justice under the law for all,” she said.",
  "“If he is indeed the nominee, I believe it would be viewed with great skepticism by many in the civil rights community.”\n\nWilliam Smith said Thursday that Sessions hired him as the first African-American Republican chief counsel on the Senate Judiciary Committee.",
  "\"Jeff Sessions is a man of high character and great integrity,\" Smith said.",
  "\"Although I pushed the envelope a number of times, not once did Senator Sessions ever say anything to offend me.",
  "Instead, time after time, he stood by me and the conservative causes I was out to support.\"",
  "Read or Share this story: http://usat.ly/2g3mYEj"
]