[
  "Paul Manafort, Donald Trump’s former campaign chairman, denied allegations of shady deals and illegal payments with the disbanded Party of Regions.",
  "Manafort claimed that the documents about illegal payments from the Party of Regions, which contain his name, were “falsified.”\n\nThe source and trustfulness of Manafort’s statements remain unclear, as the government’s agency in charge of investigating his case wouldn’t immediately comment on the matter.",
  "Manafort, who was the one-time adviser to fugitive ex-Ukrainian President Viktor Yanukovych, said in the interview to the American CBS news channel on Dec. 9 that the charges against him “were proven to be false.” Yanukovych fled power in 2014 during the EuroMaidan Revolution.",
  "On Aug. 18, the National Anti-Corruption Bureau of Ukraine published copies of 19 pages from so-called black ledger – an alleged record of illicit cash payments done by Yanukovych’s Party of Regions officials – that contained Manafort’s name.",
  "According to the handwritten entries on the ledger, a total sum of over $12.7 million was allocated to Manafort in November 2007- October 2012.",
  "According to Manafort, the government of Ukraine said that the ledger was a falsified document.",
  "Manafort, however, but didn’t specify his source of information.",
  "He also added that he is not currently under investigation by a federal agency or Ukrainian authorities.",
  "This seems to contradict Dec. 9 statements made by the Bureau’s head Artem Sytnyk in an interview with Ukraine’s Mirror Weekly, where he mentioned “certain legal proceeding’s” regarding Manafort’s case that he wouldn’t disclose.",
  "Svitlana Olefira, the bureau’s spokeswoman, told the Kyiv Post on Dec. 10 that her agency will look into Manafort’s statements on Dec. 12 due to the weekend.",
  "Manafort was forced to resign from his post amid an international scandal in August, after his name in Party of Regions’s black ledger – a list of alleged illegal cash payments made by Yanukovych’s political party.",
  "The document is currently investigated the Anti-Corruption Bureau.",
  "The Associated Press reported on Aug. 17, citing sources with knowledge of the matter, that Manafort and Trump aide Rick Gates had helped to channel $2.2 million from the European Center for a Modern Ukraine, a non-profit linked to Yanukovych’s regime, to U.S. lobbying firms Podesta Group and Mercury.",
  "According to the AP, those firms had to advocate positions of Yanukovych’s government.",
  "Manafort confirmed to CBS that he had to resign because of media scrutiny, but said that allegations weren’t true.",
  "“I became a block to his ability to communicate his message,” Manafort said.",
  "“I didn’t think it was fair, the allegations were not true, but the reality is I became a block, and my goal was to get Donald Trump elected,” he said.",
  "“The bureau there that was dealing with corruption said they were never investigating me, and they never will, they said,” Manafort said.",
  "Earlier in November, Nazar Kholodnytsky, the chief of the Ukraine’s special anti-corruption prosecutor’s office, said that no evidence was found to press charges against Manafort.",
  "He said that only Manafort’s last name appeared in the black ledger and investigators were unable to prove the authenticity of the signature."
]