[
  "CLOSE Senate Majority Leader Mitch McConnell condemns Russian hacking of U.S. political organizations, as President-elect Donald Trump continues to downplay the CIA’s confidential assessment that Russia hacked into the DNC.",
  "(Dec. 12) AP\n\nSenate Majority Leader Mitch McConnell, R-Ky., speaks to reporters during a news conference at the Capitol on Dec. 12, 2016.",
  "(Photo: Mark Wilson, Getty Images)\n\nWASHINGTON — Republican congressional leaders said Monday that key committees will investigate CIA allegations that Russia deployed hackers to disrupt the American presidential election to help President-elect Donald Trump and hurt Democrat Hillary Clinton.",
  "Senate Majority Leader Mitch McConnell, R-Ky., said the Senate Intelligence Committee and the Senate Armed Services Committee will conduct bipartisan reviews.",
  "A spokesman for the Senate Foreign Relations Committee, Micah Johnson, said that panel also \"plans to systematically look at this issue and will begin with both a classified briefing and an open hearing in early January when the Senate returns.\"",
  "\"Obviously, any foreign breach of our cybersecurity measures is disturbing and I strongly condemn any such efforts,\" McConnell said in a statement that he read to reporters at a news conference at the U.S. Capitol.",
  "He said he agrees with incoming Senate Minority Leader Chuck Schumer, D-N.Y., Armed Services Chairman John McCain, R-Ariz., and Intelligence Chairman Richard Burr, R-N.C., that possible Russian interference in the U.S. election \"cannot be a partisan issue.\"",
  "On the House side, there appeared to be less appetite for any new investigations.",
  "Speaker Paul Ryan, R-Wis., said the House Intelligence Committee will continue to look into cyber threats posed by foreign governments.",
  "He did not announce any new investigations and cautioned that recent reports from the CIA should not be used to \"cast doubt\" on the legitimacy of Trump's \"clear and decisive\" victory.",
  "\"We must condemn and push back forcefully against any state-sponsored cyber attacks on our democratic process,\" Ryan said in a statement.",
  "\"Throughout this Congress, Chairman (Devin) Nunes and the Intelligence Committee have been working diligently on the cyber threats posed by foreign governments and terrorist organizations to the security and institutions of the United States.",
  "This important work will continue and has my support.\"",
  "Ryan said \"any intervention by Russia is especially problematic because, under President Putin, Russia has been an aggressor that consistently undermines American interests.\"",
  "Nunes said Monday that he does not see the need for his committee to open a new inquiry into Russian hacking.",
  "He also sent a letter to Director of National Intelligence James Clapper on Monday asking him to brief the House Intelligence Committee by no later than Friday on the latest assessment of the Intelligence Community on the Russian cyber attacks connected to the election.",
  "\"Seeing as cyber attacks, including Russian attacks, have been one of the committee’s top priorities for many years, we’ve held extensive briefings and hearings on the topic,\" Nunes, R-Calif., said in a statement.",
  "\"As the FBI, CIA, and other elements of the Intelligence Community continue their investigations into these attacks, the House Intelligence Committee will remain a vigilant monitor of their efforts...At this time I do not see any benefit in opening further investigations, which would duplicate current committee oversight efforts and Intelligence Community inquiries.\"",
  "However, Rep. Adam Schiff of California, the senior Democrat on the House Intelligence Committee, called Monday for a joint investigation by the House and Senate intelligence panels.",
  "\"The seriousness of the Russian meddling ... during our presidential election merits a bicameral and bipartisan congressional investigation,\" Schiff said.",
  "\"This investigation would serve the purpose of informing the public, developing a concerted response, deterring the Russians from further malignant cyber action and inoculating the public against such manipulation in the future.\"",
  "McConnell said the investigation should remain in existing committees.",
  "\"Let me remind all of you that the Senate Intelligence Committee — on which I and the chairman of the Armed Services Committee sit as ex officio members — is more than capable of conducting a complete review of this matter,\" McConnell said.",
  "\"And Senator Schumer will soon join us on that committee and he can review this matter through the regular order.\"",
  "Trump spokesman Jason Miller, speaking to reporters by phone Monday, continued to reject the CIA's analysis of Russian interference in the election.",
  "\"Going back to this overall narrative that's in the news right now, I think really clearly what this is is an attempt to try to de-legitimize President-Elect Trump's win,\" Miller said.",
  "\"That really seems to be ... what's going on here.\"",
  "Trump on Sunday dismissed the CIA's conclusion that Russia tried to help his campaign as \"ridiculous.\"",
  "McConnell emphasized that he has faith in the CIA and the entire U.S. intelligence community.",
  "\"The CIA is filled with selfless patriots, many of whom anonymously risk their lives for the American people,\" McConnell said.",
  "McConnell’s emphasis on having the Senate Intelligence Committee handle the probe could limit public access to the investigation.",
  "A group of high-ranking Senate Democrats said Monday they hope to complement congressional investigations with an independent, nonpartisan commission to publicly investigate Russian interference with the election and recommend a response.",
  "House Minority Leader Nancy Pelosi, D-Calif., also said Monday that she supports calls for such a panel by Democrats on the House Oversight and Government Reform Committee.",
  "\"The American people deserve a nonpartisan, transparent public investigation into this insidious attack on our democratic institutions,” said Sen. Ben Cardin of Maryland, the top-ranking Democrat on the Foreign Relations Committee.",
  "“As a nation, it’s time to get to the bottom of it and learn what we can do to prevent it from ever happening again.\"",
  "Sens.",
  "Dianne Feinstein of California, who will be the top-ranking Democrat on the Judiciary Committee in the next Congress, and Patrick Leahy of Vermont, who will be the senior Democrat on the Appropriations Committee, want a commission to conduct hearings and report their findings to Congress within 18 months.",
  "No members of Congress would serve on the panel, which would be appointed by a bipartisan group of congressional leaders.",
  "However, McConnell said he has \"every confidence\" in the Senate Intelligence Committee to \"review this matter in a responsible manner.\"",
  "\"The Obama administration is also now launching a review, and when the Office of the Director of National Intelligence completes its review, there will be additional information released to the public in a responsible manner,\" he said.",
  "McCain said on CBS This Morning that he can’t yet say whether the Russians intended to help elect Trump.",
  "That’s why the Armed Services Committee that he leads will work with the Intelligence Committee and the Foreign Relations Committee to “uncover this whole situation,\" McCain said.",
  "\"There’s no doubt that Russians and others have hacked,\" McCain said.",
  "\"Now the question is the intention.",
  "But the larger issue that the Armed Services Committee and others are looking into is the whole issue of cyber... That’s the only form of possible conflict where our adversaries have an advantage over us.\"",
  "Schumer said on Twitter that he welcomes McConnell's support for a \"thorough bipartisan investigation.\"",
  "Schumer also said that Congress \"must find out how (the hacks) happened and stop future attacks.\"",
  "We welcome @SenateMajLdr's support for a thorough bipartisan investigation into reports that Russia interfered with the 2016 election.",
  "— Chuck Schumer (@SenSchumer) December 12, 2016\n\nContributing: David Jackson\n\nRead or Share this story: http://usat.ly/2hg4ZwW"
]