[
  "Vladimir Putin sent Donald Trump a letter expressing hope for cooperation between Russia and the U.S. and wishing him a happy holidays.",
  "| Getty Trump releases letter from Putin asking to 'restore' U.S.-Russia relationship Trump, in releasing the letter from nearly two weeks ago, said the Russian president’s sentiments are 'so correct.'",
  "President-elect Donald Trump on Friday released a holiday letter he received from Russian President Vladimir Putin, saying he hopes the U.S. and Russia will be able to “live up to” the overtures expressed by Putin and that “we do not have to travel an alternate path.”\n\nPutin’s letter, dated Dec. 15, expresses desire for greater cooperation between the two countries, which have experienced strained relations, especially after Russia’s incursion into Ukraine and allegations of Russian hacking on Democratic Party targets.",
  "Story Continued Below\n\n“Serious global and regional challenges, which our countries have to face in recent years, show that the relations between Russia and the U.S. remain an important factor in ensuring stability and security of the modern world,” Putin wrote.",
  "“I hope that after you assume the position of President of the United States of America we will be able – by acting in a constructive and pragmatic manner – to take real steps to restore the framework of bilateral cooperation in different areas as well as bring our level of collaboration on the international scene to a qualitatively new level.”\n\nPutin signed the letter “V.Putin.” He also included a holiday message and asked Trump, “Please accept my sincere wishes to you and your family of sound health, happiness, wellbeing, success and all the best.”\n\nTrump, in releasing the letter from nearly two weeks ago, said the Russian president’s sentiments are “so correct.”\n\n\"A very nice letter from Vladimir Putin; his thoughts are so correct.",
  "I hope both sides are able to live up to these thoughts, and we do not have to travel an alternate path,” Trump said.",
  "Trump’s move to release the holiday letter on Friday is sure to raise even more questions about his relationship with Putin, an autocratic leader whom many lawmakers view as a major adversary hostile to American interests but Trump repeatedly praised throughout his campaign.",
  "Compounding the criticism Trump faces for those statements, he continues to refuse to accept the intelligence community’s consensus that the Russian government attempted to disrupt the presidential election through hacking Democratic Party officials.",
  "The CIA has gone even further, assessing that the Kremlin was explicitly trying to tip the election in Trump’s favor.",
  "Trump denies both conclusions, despite offering no alternative evidence, a position that has drawn the concern of cybersecurity experts and lawmakers.",
  "The release of the letter also comes as Trump is embroiled in controversy over his pledge to “greatly strengthen and expand” the United States’ nuclear capability.",
  "He also appeared to be cavalier in his comments that fly in the face of longstanding U.S. nonproliferation policy, saying on Friday morning, “Let it be an arms race.”\n\nThose statements, which have unnerved nuclear policy experts, seem to be a response to Russia.",
  "Putin this week also called on his country to “strengthen” its nuclear forces.",
  "“We need to strengthen the military potential of strategic nuclear forces, especially with missile complexes that can reliably penetrate any existing and prospective missile defense systems,” he said earlier this week, according to multiple news reports.",
  "But Putin at an annual news conference on Friday said Russia has no interest in a nuclear arms race and seemed to normalize Trump’s statements, calling his tweet unsurprising.",
  "“Of course the U.S. has more missiles, submarines and aircraft carriers, but what we say is that we are stronger than any aggressor, and this is the case,” Putin said, adding, “As for Donald Trump, there is nothing new about it, during his elections campaign he said the U.S. needs to bolster its nuclear capabilities and its armed forces in general.”\n\nAt the news conference, Putin also said he hoped to have a productive relationship with Trump.",
  "“Nobody believed he would win except for us,” he said.",
  "And he cast Democrats in the U.S. as sore losers.",
  "\"They are losing on all fronts and looking elsewhere for things to blame.",
  "In my view this, how shall I say it, degrades their own dignity,” Putin said.",
  "“You have to know how to lose with dignity.\"",
  "Madeline Conway contributed to this story."
]