[
  "\n\n\n\nReturn to Transcripts main page\n\nCNN NEWSROOM\n\nFlynn Phoned Russia before Sanctions; Claims of Russian Information on Trump; Calls for Comey to Resign; House Takes First Steps to Repeal Obamacare; Paul Ryan talks Deportation.",
  "Aired 2-2:30p ET\n\nAired January 13, 2017 - 14:00 ET\n\nTHIS IS A RUSH TRANSCRIPT.",
  "THIS COPY MAY NOT BE IN ITS FINAL FORM AND MAY BE UPDATED.",
  "[14:00:00] JIM SCIUTTO, CNN ANCHOR: Right now.",
  "BROOKE BALDWIN, CNN ANCHOR: Jim Sciutto, thank you so much.",
  "Hi, everyone.",
  "I'm Brooke Baldwin.",
  "Good to be with you on this Friday.",
  "This is CNN.",
  "Let's start with the spy novel atmosphere that is continuing to descend upon Capitol Hill because we now know the president-elect's choice for national security adviser contacted the Russian ambassador to the United States multiple times late last month.",
  "Apparently it happened, actually, just right before the Obama administration announced that it was imposing new sanctions against the Kremlin for its election interference.",
  "Let me step back.",
  "The backdrop of this news, you have Vice President Joe Biden now confirming CNN's reporting that the intelligence community briefed both President-elect Trump and President Obama on those unsubstantiated claims that Russia may have compromising information on Mr. Trump, which is exactly what CNN has reported all along.",
  "(BEGIN VIDEO CLIP)\n\n\n\nJOE BIDEN (D), VICE PRESIDENT OF THE UNITED STATES: Their argument was that this is something that the press already had, not just here in the United States but other places, that it would be -- they would be - they didn't use the word derelict, but it was their obligation to inform not only us but the president-elect that this was out there.",
  "(END VIDEO CLIP)\n\n\n\nBALDWIN: This as CNN learns from multiple U.S. officials that FBI Director James Comey had in fact briefed the president-elect himself on this two-page synopsis of the claims levelled against him.",
  "So there's a lot to parse through.",
  "Let's begin with Jim Acosta.",
  "Jim, I want you to tell me exactly what you're hearing about whatever the communications were, you know, between Flynn and the Russians.",
  "JIM ACOSTA, CNN CORRESPONDENT: Right, Brooke, let's run through it.",
  "The Trump transition team confirms, as you said, the incoming national\n\n\n\nsecurity adviser, Michael Flynn, did speak by phone with the Russian ambassador, Sergey Kislyak, late last month.",
  "The transition says that conversation, which was first reported by \"The Washington Post\" we should point out, happened on December 28th, just one day before the Obama administration announced those new sanctions against Russia for its hacking operation in the 2016 election.",
  "Now, incoming White House Press Secretary Sean Spicer said the conversation came after the two men texted back and forth, wishing each other a merry Christmas.",
  "Here's what Spicer told reporters this morning on the call.",
  "(BEGIN VIDEO CLIP)\n\n\n\nSEAN SPICER, INCOMING WHITE HOUSE PRESS SECRETARY (via telephone): With respect to General Flynn, just to give everyone a tick tock on this.",
  "On Christmas Day, General Flynn reached out to the ambassador, sent him a text, and it said, you know, I want to wish you a merry Christmas and a happy new year.",
  "I look forward to touching base with you and working with you.",
  "And I wish you all the best.",
  "The ambassador texted him back wishing him a merry Christmas as well.",
  "(END VIDEO CLIP)\n\n\n\nACOSTA: Now, Spicer went on to say that Flynn and Kislyak, and this really important, Brooke, only spoke about - and I - on December 28th.",
  "They later had this phone conversation after those texts went back and forth on Christmas.",
  "They only spoke about setting up a phone conversation between Donald Trump and Russian President Vladimir Putin that would take place after Inauguration Day, of course, next week, next Friday.",
  "That is important because any conversation about the sanctions between Flynn and the Russian ambassador could bring about accusations that Flynn was in violation of the Logan Act, which is a law that bars American citizens from negotiating with a foreign government that's in a dispute with the United States, which certainly was going on at the time.",
  "Now, the current White House press secretary, Josh Earnest, Brooke, was just asked about this and Earnest told reporters he has, quote, \"zero insight\" into the conversation.",
  "But, of course, all of this is very important because one of the key questions coming out of this campaign was, did Donald Trump or any of his associates working for him or his organization, the campaign, have any contacts with Russian officials during the course of that campaign, in the context of that campaign.",
  "That is the question that I tried to ask at that news conference earlier this week -\n\n\n\nBALDWIN: Yes, you did.",
  "ACOSTA: That is - that is also a question that somebody from ABC tried to ask during that news conference.",
  "He did not answer the question from that podium.",
  "But as he was walking away towards the elevators, as we all recall, he did end up saying, no, flatly no.",
  "But, of course, any time, you know, there's a report like this that talks about contacts between Trump, his people, and the Russians, it is going to generate a lot of attention here in Washington and, of course, all over the world, Brooke.",
  "BALDWIN: I wish you had gotten your question answered.",
  "We, the press, need to stick together and I would have loved to have your question answered, bottom line.",
  "Jim Acosta, thank you so much.",
  "ACOSTA: All right, thanks.",
  "BALDWIN: Keep asking those questions.",
  "ACOSTA: Thanks.",
  "BALDWIN: Meantime, on that and much more, let me bring in Gloria Borger, CNN chief political analyst, and Pamela Brown, CNN justice correspondent.",
  "So, Gloria, just first to you.",
  "You know, hearing the Sean Spicer sound, saying it was just about, you know, texting over merry Christmas and setting up this phone call between, you know, Trump and Putin post-election.",
  "But, again, it's the timing, right, that some are calling into question.",
  "Then you have the sitting president just like a day later imposing the new sanctions against the Kremlin, which would be taboo with the - with the violation of the one president at a time rule.",
  "What questions do you have?",
  "How much suspicion should really be stirred among Trump critics on this?",
  "[14:05:15] GLORIA BORGER, CNN CHIEF POLITICAL ANALYST: Look, I think the questions that are being asked are the same ones that were asked before this, before these texts.",
  "They've been asking them in the confirmation hearings, which is, what really should the relationship be between the United States and Russia?",
  "Does the incoming Trump administration have any kind of special relationship with Russia that is not currently known about?",
  "And was Flynn in that - in those texts, signaling anything that he shouldn't have been signaling?",
  "I mean we don't know.",
  "We hear Sean Spicer's explanation.",
  "We have to take it at face value.",
  "But it's clear that there is a strong personal relationship between the two men.",
  "We'll just - you know, we're going to - we're going to have to sort of unspool this.",
  "But all of these questions come in the middle of the hacking storm -\n\n\n\nBALDWIN: Yes.",
  "Yes.",
  "BORGER: That we're currently in the middle of.",
  "So any piece of information is either going to be over interpreted or, you know, questions are going to be raised about it.",
  "Legitimate questions.",
  "And we just don't know the answers, Brooke.",
  "BALDWIN: In the unspooling, you put it perfectly, we know that Vice President Joe Biden confirms that he and the president were briefed, Pamela, on the claims that the Russians had information, maybe some dirt, maybe, on Mr. Trump.",
  "What are CNN sources saying about the information that Trump himself did receive after that intel briefing last Friday?",
  "PAMELA BROWN, CNN JUSTICE CORRESPONDENT: Well, our sources tell us, Brooke, that after that meeting with the intel chiefs last Friday, that James Comey, the director of the FBI, pulled Trump aside to brief him on the two-page synopsis of the allegations that were included in that 35-page memo about Trump and Russia, unsubstantiated allegations, I should say.",
  "We're told that it was decided among the leaders that James Comey would be the best person to do this pull aside and have this sensitive discussion because the FBI was investigating - is investigating those allegations.",
  "And so it was decided that James Comey would be the best person to do this.",
  "Our sources tell us that that discussion was cordial and that the leaders felt it was important to brief the president-elect because essentially they didn't want it to come as a surprise to him if this memo were to surface later on when he was in the White House, Brooke.",
  "BALDWIN: So he was the one to do that with Mr. Trump.",
  "We also know that Jim Comey, Gloria, you know, is facing this review, we talked about this 24 hours ago, over his handling of the investigation into Hillary Clinton's use of the private e-mail server.",
  "So while that's happening, he is now facing intense pressure from both sides to resign.",
  "Let me play just a little bit from the briefing, the appropriate question, I think, he received from Senator Angus King.",
  "(BEGIN VIDEO CLIP)\n\n\n\nSEN. ANGUS KING (I), MAINE: Mr. Comey, did you answer Senator Wyden's question, that there is an investigation underway as to connections between either the political campaigns and the Russian -- Russians?",
  "JAMES COMEY, FBI DIRECTOR: I didn't say one way or another.",
  "KING: You didn't say that there -\n\n\n\nCOMEY: That was my intention at least.",
  "KING: You didn't say one way or another whether even there's an investigation underway?",
  "COMEY: Correct.",
  "I don't - especially in a public forum, we never confirm or deny a pending investigation.",
  "KING: The irony of -\n\n\n\nCOMEY: I'm - I'm not saying -\n\n\n\nKING: The irony of your making that statement here, I cannot avoid, but I'll move on.",
  "(END VIDEO CLIP)\n\n\n\nBALDWIN: Of course, we all know the involvement, right, with Jim Comey from the summer and into the - right before the election.",
  "Let me also just read a quick quote from this \"Wall Street Journal\" opinion piece today.",
  "Quote, \"if Mr. Comey declines, Donald Trump can and should fire him in the best interests of the nation's most important law enforcement agency.\"",
  "Gloria, should he resign?",
  "BORGER: Well, now you've got, you know, a notably Republican editorial board and Democrats agreeing on - agreeing on this.",
  "And I think, look, I'm sure Mr. Comey is taking a good look at his position right now.",
  "And he's got a department that is desperately struggling to get its reputation back.",
  "It is being attacked by both Republicans and Democrats.",
  "And that doesn't mean that that means it's straight down the middle.",
  "What it means is that they each have legitimate gripes about him.",
  "And I think that any time you have an FBI director who finds himself in the middle of this storm, he has to sort of say, what - what should I do that's the best thing for the agency that I head.",
  "BALDWIN: He has a lot of support within, right, from within the FBI?",
  "BORGER: He does.",
  "He does, but - well, (INAUDIBLE).",
  "BROWN: And -\n\n\n\nBALDWIN: Right, Pamela?",
  "BROWN: Go ahead.",
  "Yes, no, he - I think, of course, there are people in - within the FBI who disagree with his decision to not prosecute Hillary Clinton.",
  "There was disagreement over how that was handled.",
  "But in terms of respect, the rank and file that I've spoken to, they still have respect for James Comey.",
  "And people I've spoken to that are close to him say that he - this - and this was about a month ago at that time, he had no plans to resign.",
  "That he felt like he made the right decision.",
  "He was faced with an impossible situation.",
  "And, in his view, he has no regrets about the decisions that he had to make.",
  "And he realized how difficult it was.",
  "[14:10:26] But, of course, there is a new administration, and if he doesn't resign, he still has another boss, and that would be the next attorney general.",
  "And Donald Trump, who hasn't said one way or the other what he's going do, frankly.",
  "And let me just make this point too.",
  "Democrats have come out and criticized James Comey.",
  "You heard Maxine Waters say that today and calling for his resignation.",
  "But, at the same time, I don't think - and Gloria can weigh in on this - I don't think that they would want to leave the option up to Donald Trump to appoint another FBI director.",
  "BORGER: Right.",
  "BALDWIN: Quickly, Gloria, go ahead.",
  "BORGER: And, you know, it's - exactly, it's be careful what you wish for because you might get it.",
  "And if you - what would - what would they - what would they get next?",
  "And I think that that's a big question mark if Jeff Sessions is the next attorney general.",
  "And so, you know, Democrats are kind of shrugging about this.",
  "He's not popular with Democrats, but, you know, they worry - they worry about the Justice Department generally under Jeff Sessions.",
  "BALDWIN: Speaking of partisan politics, I need to move on and talk\n\n\n\nabout Obamacare.",
  "But, ladies, for now, thank you, Gloria and Pamela.",
  "You know, to this Obamacare showdown and really just the very first step here on Capitol Hill, live pictures.",
  "As you know, the Republican controlled House is - will be voting today on this resolution that will begin the process, OK, very beginning stages, beginning the process to repeal President Obama's signature piece of legislation.",
  "It will advance a measure that has already passed in the Senate.",
  "But the big question, how will Republicans then, if they repeal, how to replace the plan since you have 20 million Americans who currently depend on this.",
  "CNN's senior political reporter Manu Raju is live at the Capitol.",
  "And we've talked about this.",
  "And even when it comes to this first procedural vote, you know, there are still hesitations, Manu, among House Republicans over how they feel about this.",
  "MANU RAJU, CNN SENIOR POLITICAL REPORTER: Yes, absolutely, Brooke, because the party is not yet behind one single idea -\n\n\n\nBALDWIN: Right.",
  "RAJU: Or a number of ideas in order to replace the law.",
  "The - when you look at how this is going to happen, first they are going to move through this budget process to try to repeal most of the law.",
  "The process allows them to do that on a party line vote.",
  "That means they don't need Democratic support in order to repeal most of the law.",
  "But to replace it, they have to move through the regular order of Congress, and that means they do need Democratic support.",
  "And that's why initially Republican leaders wanted to take their time to replace the law.",
  "But Donald Trump said that that needs to happen right away, at the same time.",
  "And other Republicans are also calling for a replacement plan to happen at the same time.",
  "Paul Ryan told our Jake Tapper yesterday that it would happen simultaneously, and that is prompting some concerns on Capitol Hill from Republicans who want to be more deliberative.",
  "Take a listen.",
  "(BEGIN VIDEO CLIP)\n\n\n\nREP. THOMAS MASSIE (R), KENTUCKY: Why don't we do replace and repeal?",
  "You know, we could do those things.",
  "We could be putting those things on the floor this week.",
  "RAJU: Do you have concerns at all about the timetable then?",
  "REP. MIKE COFFMAN (R), COLORADO: Well, I think it's going to be a very - I think this is going to be a very long process.",
  "RAJU: You don't think it's going to happen right away?",
  "COFFMAN: No.",
  "REP. CHARLIE DENT (R), PENNSYLVANIA: I think the repeal plan needs to be fully developed and better articulated prior to moving forward.",
  "I have some reservations about moving as quickly as we are.",
  "(END VIDEO CLIP)\n\n\n\nRAJU: So that was just a cross section of voices -\n\n\n\nBALDWIN: Wow.",
  "RAJU: Of conservatives, moderates, debating exactly the strategy and we're not even talking about the policy yet.",
  "And once we get into the policy details, that is bound to divide the party even further.",
  "So this vote today will essentially instruct the committees of Congress to start developing the policy proposals.",
  "And at that point, expect a big fight internally, as well as with Democrats, not just on repealing the law, but replacing it.",
  "Paul Ryan wants to add some provisions to replace the law in that repeal legislation, but there's only so much they can do under the rules of the Senate.",
  "So a lot of questions going forward about exactly what they do to fulfill this key campaign promise, Brooke.",
  "BALDWIN: We have the vote, as you well know, next hour.",
  "We'll talk again, Manu Raju, and see how it goes.",
  "Thank you, sir, on The Hill for me.",
  "Coming up, a powerful exchange from CNN's town hall.",
  "You have this undocumented immigrant who stands in the audience and asks the speaker of the House here, Paul Ryan, do you want to deport me?",
  "His answer and what he says about Mr. Trump's campaign proposal involving a deportation force coming up.",
  "Also, the fight for public opinion.",
  "In a candid exit interview, President Obama talks about why he lost some of the biggest political battles of his administration.",
  "[14:14:58] And just this remarkable story unfolding today out of Florida.",
  "Have you heard about this?",
  "This newborn baby kidnapped from a hospital, 18 years ago, has now been found alive.",
  "Stay tuned.",
  "(COMMERCIAL BREAK)\n\n\n\nBALDWIN: Welcome back on this Friday afternoon.",
  "I'm Brooke Baldwin.",
  "There are still all kinds of questions surrounding President-elect Donald Trump's immigration policy.",
  "But the most powerful Republican on The Hill, House Speaker Paul Ryan, is ruling out Trump's initial campaign suggestion of a deportation force.",
  "There was a powerful exchange during CNN's town hall last night where this one woman, who is undocumented, stood there, her daughter by her side, and asked Speaker Ryan point-blank if he felt she should be deported.",
  "(BEGIN VIDEO CLIP)\n\n\n\nANGELICA VILLAIOBOS, UNDOCUMENTED IMMIGRANT PROTECTED BY DACA: I am undocumented.",
  "I've been, like he mentioned, I've been - I live in the state of Oklahoma.",
  "I'm here with one of my daughters, Destiny.",
  "I've been in the United States for 21 years.",
  "I am protected from deportation because of the DACA program.",
  "To be protected, I applied, went through a background check, and I pay almost nearly $1,000 in fees.",
  "It's clear that if DACA get repealed, my daughter will lose her mother -\n\n\n\nREP. PAUL RYAN (R), HOUSE SPEAKER: Right.",
  "VILLAIOBOS: And - I'm sorry.",
  "She will lose her mother and I want you to know that DACA has helped me.",
  "What do you - do you think that I should be deported and many families in my situation?",
  "[14:20:16] RYAN: No.",
  "VILLAIOBOS: Should -\n\n\n\nRYAN: No.",
  "No, Angelica, first of all, I can see that you love your daughter and you are a nice person who has a great future ahead of you.",
  "And I hope your future is here.",
  "I'll even repeat the sentiment that our incoming president says.",
  "That's the problem he wants to focus on.",
  "This is not the focus.",
  "And so what we have to do is find a way to make sure that you can get right with the law, and we've got to do this in a good way so that the rug doesn't get pulled out from under you and your family gets separated.",
  "That's the way we feel and that is exactly what our new incoming president has stated he wants to do.",
  "Look, I got married in Oklahoma City.",
  "It's a great community.",
  "It's where - my wife's from that area.",
  "And I'm - I'm sure you're a great contributor to that community.",
  "And we don't want to see you get separated from your family.",
  "So we have to figure out how to fix this.",
  "But to do that, people need to have confidence that our laws are being followed and that we actually know who's coming and going and that we actually have a secure border.",
  "So I think what's really important for this issue, writ large to get fixed, and Jake mentioned that, you know, I have a background in this.",
  "We've got to make sure that these laws are being enforced, that we are controlling our borders so violent criminals, repeat offenders, don't come in and do these kinds of horrific things.",
  "We've got a drug problem.",
  "We've got a lot of problems.",
  "We want to be able to secure our border.",
  "When people get confidence in this country, that our border is secured, that our laws are being enforced, then I really believe the country, all people in the country, will be in a much better position to fix these thornier, bigger problems.",
  "But if you're worried about, you know, some deportation, you know, force coming on - knocking on your door this year, don't worry about that.",
  "(END VIDEO CLIP)\n\n\n\nBALDWIN: Let's go straight to Ana Navarro, CNN political commentator.",
  "And, Ana, I know this issue of immigration, it is near and dear to you.",
  "You told me people stop you on the street multiple times a week and say, am I safe?",
  "You saw the exchange.",
  "What do you make of it?",
  "ANA NAVARRO, CNN POLITICAL COMMENTATOR: Look, as corny as it may\n\n\n\nsound, it made me emotional.",
  "As you said, these DACA young people stop me all the time.",
  "And it's not just me.",
  "They - you know, they're telling their stories to so many people, sharing the fear, the uncertainty.",
  "They're terrified right now.",
  "And if you had been hearing the campaign rhetoric that has happened on the Republican side for the last 18 months, if you'd been hearing Donald Trump on his promises and (INAUDIBLE) -\n\n\n\nBALDWIN: Deportation force.",
  "NAVARRO: Of deportation, you'd be terrified too.",
  "They are covered under an executive order.",
  "That executive order can be revoked by the new president any moment he wants.",
  "He can do it on day one if he so chooses.",
  "And they don't know what's going to happen to them.",
  "They are living in absolute fear.",
  "And she asked the question, and it was so succinct, do you want me deported?",
  "You know, I saw the empathy in Paul Ryan's eyes.",
  "I know Paul Ryan.",
  "He is a unifier.",
  "He is very humane.",
  "He cares about immigration.",
  "He's a Jack Kemp Republican.",
  "I don't know what's going to happen on any other issue, but when it came down to this immigration issue, his words gave me so much comfort that the speaker of the House is not going to allow the rug to be pulled from under the feet of all of these young people, 750,000 of them, who have sought this protection, who have applied for this law, who are now playing by the rules, who are working and living and studying, legally, contributing to this country.",
  "BALDWIN: Yes.",
  "NAVARRO: And I see that Paul Ryan understands that.",
  "I know his wife.",
  "His wife from Oklahoma.",
  "These folks are family people at the core.",
  "And I believe Paul Ryan on this one.",
  "And I intend to hold his feet to the fire.",
  "BALDWIN: Yes.",
  "So you feel comforted.",
  "You have, you know, Speaker Ryan on immigration and just broadening out we've been watching these, you know, Senate confirmation hearings this week, right, these cabinet nominees this week on Iran and Russia and the border wall and their words stand in such stark contrast to the rhetoric we heard from Trump on the trail.",
  "And if you think about it, if you have Trump and Steve Bannon and Jared Kushner there in the West Wing, you know, how much does it matter that these cabinet picks - what they're saying?",
  "Who will be setting policy?",
  "NAVARRO: Look, I think we don't know yet, but I think that what you - what you've heard in a lot of these confirmation hearings is that the cabinet secretaries don't agree with the things that Donald Trump has been saying on the trail.",
  "So what it leads you to believe -\n\n\n\nBALDWIN: Where does the buck stop?",
  "NAVARRO: We don't know.",
  "I think - I think we're going to get a little bit of Dr. Jekyll some days and a little bit of Mr. Hyde some days in the White House.",
  "We don't know when it will be a carrot.",
  "We don't know when it will be a stick.",
  "We do know that Donald Trump is a pragmatic deal maker.",
  "How that translates into actual policy, we don't know.",
  "But what I heard from people like General Mattis, like General John Kelly, who said in that hearing that it's not a wall we need but a multilayered approach, that's been like the bastion of Donald Trump's entire campaign, build the wall, Mexico will pay for it.",
  "And you've got his nominee for homeland security saying, look, what's going to work is a multilayered approach.",
  "We need surveillance, we need drones, we need forces, we need, you know, in some places fencing, yes.",
  "BALDWIN: Right.",
  "[14:25:24] NAVARRO: I thought it was - was like there's this major disconnect between the Donald Trump we saw on the trail and the people he has appointed to actually make and implement his policies.",
  "BALDWIN: That's what we've been - that's what we've been highlighting this week.",
  "And, Ana Navarro, you called Donald Trump a pragmatic deal maker.",
  "Let's remember - let's just remind our viewers, if I may, a mash-up of Ana Navarro leading up to Election Day.",
  "(BEGIN VIDEO CLIP)\n\n\n\nNAVARRO: There are so many instances throughout this election where Donald Trump has offended me, outraged me, very personally.",
  "He does not represent my values.",
  "He does not represent Republican values.",
  "No, he's not going to work in cooperation with Congress.",
  "No, he's not going to try to unify this country.",
  "No, he's not going to represent everybody.",
  "Every single Republican is going to have to answer the question, what did you do the day you saw the tape of this man boasting about grabbing a woman's (EXPLETIVE DELETED)?",
  "UNIDENTIFIED MALE: Exactly.",
  "NAVARRO: Period.",
  "DON LEMON, CNN ANCHOR: OK. All right.",
  "We'll be -\n\n\n\nUNIDENTIFIED FEMALE: Will you please stop saying that word.",
  "My daughter is listening and we're not on a delay.",
  "Please stop staying it.",
  "He said it.",
  "But at least (INAUDIBLE) bleep it out.",
  "Please stop staying it.",
  "NAVARRO: Well, you know what, Scottie - you know what, Scottie, don't tell me you're offended when I say (EXPLETIVE DELETED) but you're not offended when Donald Trump says it.",
  "I think we should now start calling it the tele-trumpter.",
  "Do you have a match somewhere so that I can set my hair on fire?",
  "(END VIDEO CLIP)\n\n\n\nBALDWIN: I mean it's worth going back to remembering you talk about his cabinet picks, you maybe feel comforted, they're rather swampy, your word.",
  "Do you think you might change your tune on a President Trump?",
  "NAVARRO: I think they're two different - I hope - I hope they're two different things.",
  "Here's where I stand on Donald Trump.",
  "I know, and I've made my judgment on Donald Trump, the man, on Donald Trump the candidate.",
  "I think he was a racist.",
  "I think he brought out division, hostility.",
  "I think he was a misogynist.",
  "I think he brought out the worst in America.",
  "And I think he lacked the character to be president.",
  "That's why I did not support him.",
  "That's why I do not - I did not vote for him.",
  "Now, that being said, he's now President Trump.",
  "Puts me in a very uncomfortable position because though I have no respect for the man, I have enormous respect for the office of the presidency.",
  "And whether I like it or not, and I don't, the reality check is, he is going to be the president for the next four years.",
  "So my only hope is that he is better as president than he has been as a human being, than he has been as a candidate.",
  "That he is a different type of president who rises to the occasion and who can actually improve unemployment, who can actually improve the economy, who can actually exert some leadership on foreign policy.",
  "If he does those things, I will judge him as a president on how he does as a president.",
  "As a man, I find him as despicable today as I did before November 9th.",
  "BALDWIN: Ana Navarro, thank you.",
  "NAVARRO: Thank you.",
  "BALDWIN: Coming up next, the Justice Department issued a report today on the Chicago Police Department, saying there was a pattern of excessive force and called the violence deeply troubling.",
  "What changes they want the city to make.",
  "That's coming up.",
  "Also ahead, former President George W. Bush's daughters, both Jenna and Barbara, giving some heartfelt advice to the Obama girls on life after the White House.",
  "What exactly did they share?",
  "We'll be right back.",
  "(COMMERCIAL BREAK)"
]