[
  "The sanctions on the intelligence agencies and officials are largely symbolic—and it’s not immediately clear if these steps will have any real impact.",
  "Relations between Washington and Moscow have been frosty despite attempts to reset them.",
  "Their one common diplomatic achievement was the Iranian nuclear deal, but Russia’s invasion of Crimea in 2014 and the Syrian civil war, in which Russia is supporting President Bashar al-Assad, have complicated ties.",
  "Indeed, in response to the expulsion of the 35 diplomats, the Russian Embassy in London tweeted:\n\nPresident Obama expels 35 ????",
  "diplomats in Cold War deja vu.",
  "As everybody, incl ????",
  "people, will be glad to see the last of this hapless Adm. pic.twitter.com/mleqA16H8D — Russian Embassy, UK (@RussianEmbassy) December 29, 2016\n\nA Kremlin spokesman called the sanctions a “manifestation of an unpredictable and even aggressive foreign policy” and vowed an “adequate, reciprocal” response.",
  "Russia has denied involvement in the hacks.",
  "Such expulsions of intelligence officials aren’t uncommon—and they are often followed by retaliatory expulsions of U.S. diplomats from Moscow.",
  "The closure of the compound in Maryland, though, represents the end of a more than four-decade Russian presence in the area.",
  "The former Soviet Union purchased the 45-acre property in Centreville, Maryland, in 1972 as a resort for Soviets living in the U.S.",
  "The compound in New York hasn’t been identified publicly, but the Russians have such a compound in Riverdale in the Bronx, which opened as a diplomatic residence in 1974.",
  "Obama said both compounds were being used for intelligence-related purposes.",
  "Also Thursday, the Department of Homeland Security and the FBI released declassified technical information on Russian civilian and military intelligence cyber activity, which in keeping with the ursine puns the agencies use for Russia, they dubbed Grizzly Steppe.",
  "The report by the two agencies provides details on how Russia’s civilian and military intelligence services compromised and exploited networks associated with the U.S. election, as well as steps to take in response to such actions.",
  "“This activity by [Russian intelligence services] is part of an ongoing campaign of cyber-enabled operations directed at the U.S. government and its citizens,” the the agencies said.",
  "“These cyber operations have included spearphishing campaigns targeting government organizations, critical infrastructure entities, think tanks, universities, political organizations, and corporations leading to the theft of information.”\n\nObama, in his statement, also said his administration will provide a report to Congress in the coming days about Russia’s alleged efforts to interfere in the U.S. election.",
  "Lawmakers from both parties have expressed outrage about Russia’s alleged actions and have promised extensive congressional inquiries into what Russian intelligence agencies did, to whom, and to what extent.",
  "Indeed, Speaker Paul Ryan called the sanctions “overdue,” but took the opportunity to criticize the Obama administration’s foreign policy.",
  "Senators John McCain and Lindsey Graham, in a joint statement, said the measures “are a small price for Russia to pay for its brazen attack on American democracy.",
  "We intend to lead the effort in the new Congress to impose stronger sanctions on Russia.” It’s not clear what effect any of this will have, however.",
  "President-elect Donald Trump, who has expressed skepticism about Russia’s actions in the elections, could simply waive any new congressional sanctions imposed on Russia—and he could also move to lift those sanctions already in place against Moscow for its invasion of Crimea.",
  "Trump is skeptical on whether the sanctions on Russia work—doubts shared by Rex Tillerson, the Exxon CEO who is his choice to be the next U.S. secretary of state."
]