[
  "Jared Kushner is President Donald Trump's son-in-law but he's also one of his key confidants.",
  "Here's a closer look at the president's senior advisor.",
  "(Deirdra O'Regan/The Washington Post)\n\nJared Kushner, the son-in-law of President-elect Donald Trump and one of his closest confidants, will join the White House as a senior adviser to the president, Trump announced Monday, while a lawyer assisting the family said that Kushner's wife, Ivanka Trump, will not immediately take on a formal role.",
  "Kushner, who will not take a salary, is expected to have a broad portfolio that includes government operations, trade deals and Middle East policy, according to a member of Trump's transition team.",
  "In a statement, the transition office said Kushner would work closely with White House Chief of Staff Reince Priebus and chief strategist Stephen K. Bannon to execute Trump’s agenda.",
  "Trump relied heavily on Kushner's advice during the campaign, and his move to the White House was expected.",
  "But ethics experts have raised questions about whether Kushner's role in the new administration will run up against a federal anti-nepotism law and about how he will separate himself from his real estate business to avoid conflicts of interest.",
  "Kushner’s attorney, WilmerHale partner Jamie Gorelick, said in an interview Monday that Kushner is prepared to resign from his business and divest substantial assets, including foreign investments, before taking a White House position.",
  "But Gorelick, who served as deputy attorney general under President Bill Clinton, said she is confident that the anti-nepotism statute does not cover Trump's appointment of Kushner, though she acknowledged that some lawyers take the opposite view.",
  "Ivanka Trump plans to resign from the Trump Organization and step away from her clothing company but will focus — at least in the short term — on settling the family into its new home in Washington, a lawyer working with the family said.",
  "Kushner, 35, has run his family’s multibillion-dollar business over the past decade, after his father pleaded guilty to corruption-related charges.",
  "As Donald Trump campaigned for president, Kushner played a key role, acting as an adviser and gatekeeper.",
  "Kushner, whose family has donated to causes in Israel, including West Bank settlements that have been branded illegal by the United Nations, also played a role as a Middle East policy adviser.",
  "\"Jared has been a tremendous asset and trusted adviser throughout the campaign and transition and I am proud to have him in a key leadership role in my administration,\" Trump said in a statement.",
  "[Trump’s son-in-law poised to resign as CEO of real estate company]\n\nSome ethics experts question whether a Kushner's appointment would violate the 1967 federal anti-nepotism statute, which came about after President John F. Kennedy named his brother as attorney general.",
  "It forbids public officials from hiring family members in agencies or offices they oversee, and explicitly lists sons-in-law as prohibited employees.",
  "Richard Painter and Norman Eisen, who served as chief White House ethics lawyers under Presidents George W. Bush and Obama, respectively, say they counseled senior White House officials to avoid appointing relatives to West Wing jobs.",
  "But Gorelick said she is confident that the 1967 law does not apply to the White House, which she said is not an agency.",
  "“This is not a close question,” Gorelick said, also citing subsequent law, passed in 1978, that she said allows the president to hire White House staffers “without regard” to federal personnel laws, including the anti-nepotism statute.",
  "“The Justice Department has described this authority as ‘unfettered’ and ‘sweeping,’ ” Gorelick added.",
  "Eisen said in an interview that “reasonable people may come to different views on this” but that he believes Trump's appointment of Kushner could prompt “some interesting litigation about whether [the 1967 law] applies or not.”\n\nSomeone who thinks they are negatively impacted by a Kushner decision could bring suit, Eisen said.",
  "On the other hand, “people may not want to knock one of the more reasonable voices out of the White House,” he said, referring to Kushner.",
  "The nepotism issue was examined but not fully resolved in a court case in the early 1990s involving Hillary Clinton’s leadership of a health-care panel.",
  "Walter Dellinger, who served as acting solicitor general under President Bill Clinton, said he thinks the law is on Trump's side, particularly given the 1978 law loosening restrictions on White House appointments.",
  "\"It makes good sense, because one should not assume Congress wants to interfere with whom the president wants as his closest advisers in the White House,\" Dellinger said.",
  "Kushner has a web of business interests, focused heavily on real estate development.",
  "Though Kushner’s company is focused primarily on development in New York and New Jersey, it has often relied on foreign investment, and its earnings could be influenced by the Trump administration's trade and foreign-relations policies.",
  "Gorelick said that Kushner would resign as chief executive of the Kushner Cos. and as publisher of the New York Observer, divest all of his common stock and any foreign investments and shed many other assets.",
  "Many of Kushner's assets will be sold to his brother and a trust overseen by his mother, Gorelick said.",
  "Kushner will also recuse himself from matters that will have a direct impact on his remaining financial interests and abide by other federal ethics rules, according to Gorelick.",
  "Karen DeYoung contributed to this report."
]