[
  "The director of the FBI – whose high-profile interventions in the 2016 election are widely seen to have helped tip the balance of against Hillary Clinton – has refused to say if the bureau is investigating possible connections between associates of President-elect Donald Trump and Russia.",
  "Testifying before the Senate intelligence committee on Tuesday, James Comey said he could not comment in public on a possible investigation into allegations of links between Russia and the Trump campaign.",
  "“I would never comment on investigations – whether we have one or not – in an open forum like this, so I really can’t answer one way or another,” said Comey, at a hearing into the US intelligence agencies’ conclusion that Russia intervened in the election to benefit Trump.",
  "James Comey: Hillary Clinton email inquiry is FBI chief's latest controversy Read more\n\nComey’s reticence stunned several senators who pointed to his repeated public discussions of FBI inquiries into Clinton during the campaign.",
  "It was his first public appearance since an election that saw his reputation for integrity seriously tarnished, after his repeated public statements on the bureau’s inquiry into Clinton’s private email server.",
  "Clinton reportedly blames Comey for her unexpected loss to Trump.",
  "Asked by the Oregon Democrat Ron Wyden if he would provide an unclassified answer about any FBI inquiry into Trump-Russia connections before Trump’s inauguration on 20 January, Comey said: “I will answer any question you ask but the answer will likely be the same as I just gave you.",
  "I can’t talk about it.”\n\nWyden said he was troubled by Comey’s silence.",
  "“I think the American people have a right to know this,” he said.",
  "Other senators went further.",
  "Democrat Kamala Harris of California suggested that a “new standard” for discussing FBI investigations publicly had been created in the months before the election.",
  "Angus King, a Maine independent, told Comey: “The irony of your making that statement here – I cannot avoid.”\n\n\n\nResponding to King, Comey suggested “sometimes we think differently about [discussing] closed investigations”.",
  "But the FBI had not technically closed its inquiry into the email server when Comey wrote to Congress on 28 October – just 11 days before the general election – to say that the agency was reviewing newly discovered electronic communications for potential relevance to the Clinton case.",
  "Those materials arose from another active FBI investigation, into disgraced former Democratic congressman Anthony Weiner.",
  "Comey eventually announced that the new material was ultimately irrelevant to Clinton, on the day before the election.",
  "Comey’s intervention into the presidential election contravened justice department protocols and earned rebuke from the former attorney general Eric Holder.",
  "James Comey has been abusing his power for years | Trevor Timm Read more\n\nTrump has not publicly committed to retaining Comey, whose term extends to 2023, and Comey has receded from public view following the election.",
  "At one point in the hearing he attempted to joke: “I hope I’ve demonstrated by now I’m tone deaf when it comes to politics and that’s the way it should be.”\n\nThe hearing was the intelligence committee’s first since the FBI, National Security Agency and Central Intelligence Agency released a declassified assessment finding that Russia orchestrated a wide-ranging influence operation during the US election, to include digitally breaking into Democratic National Committee servers and Clinton aide John Podesta’s email and providing the materials to outlets that published the information online.",
  "James Clapper, the outgoing director of national intelligence, placed Russian interference in the US election in the context of Moscow’s attempted subversion of elections in what he estimated was “a couple dozen” foreign countries.",
  "Facebook Twitter Pinterest FBI director James Comey (left), and National Intelligence Director James Clapper, testify before the Senate hearing on Russian intelligence activities.",
  "Photograph: Cliff Owen/AP\n\nClapper reiterated that he had no evidence that Russia had manipulated the voting process itself.",
  "But he said there was evidence of Russian “reconnoitering, intrusion on certain voter rolls” in unnamed American states.",
  "Comey also said that there was evidence that Russia had penetrated an outdated Republican National Committee data hoard and harvested “old stuff” but not that it had accessed any current RNC material or the national Trump campaign.",
  "“There was evidence that there was hacking directed at state-level organizations, state-level campaigns, and the RNC, but old domains of the RNC, that is, email domains they were no longer using,” Comey said.",
  "The FBI director added that it was “potentially” possible that a hacker could access and manipulate voter information contained in county databases, possibly without election officials knowing about the manipulation.",
  "Richard Burr, the North Carolina Republican who chairs the committee, pledged a thorough and bipartisan staff review into the finding, which Trump has yet to publicly accept and which has led him to denigrate the intelligence agencies he is set to inherit.",
  "Burr said he had “no reason to doubt the findings” and promised to “follow the intel wherever it leads”.",
  "His Democratic counterpart, Virginia’s Mark Warner, said he believed the committee inquiry ought to include a focus on “contact between the Russian government and its agents, and associates of any campaign and candidate”.",
  "Democrat Martin Heinrich of New Mexico added: “Russia didn’t do this to help the Republican candidate.",
  "Russia did this to help Russia and to weaken America and therein lies the heart of why this is so important.",
  "In the next election the shoe could easily be on the other foot, and a foreign power could easily decide it wants the Democrat to win this time.”"
]