[
  "“It’s all fake news.",
  "Its phony stuff.",
  "It didn’t happen,” Mr. Trump said.",
  "“It was gotten by opponents of ours.",
  "It was a group of opponents that got together.",
  "Sick people and they got together and put that crap together.”\n\nAsked what Mr. Trump would say to Mr. Putin about the election hacking, he responded, “He shouldn’t have done it.",
  "I don’t believe he will be doing it more.”\n\nMr. Trump disputed the allegations that he was involved in salacious behavior in a Russian hotel room, saying that he is always highly aware that there are “cameras in the strangest places” in hotel rooms when he travels around the world.",
  "“You can’t see them and you won’t know,” he said.",
  "“You better be careful or you will be watching yourself on nightly televisions.”\n\nVideo\n\nTrump’s evocation of Nazism provokes blowback\n\nPresident-elect Trump should have known that comparing himself to a victim of Nazi persecution would not go over well — and it didn’t.",
  "On Wednesday morning, amid a furor over the publishing of an unsubstantiated, explosive dossier, Mr. Trump posted on Twitter:\n\nIn 140 characters, he compared American intelligence agencies to Nazis, called himself a target, and asked whether his travails were comparable to those of the victims of Adolf Hitler.",
  "The response was swift from organizations that combat anti-Semitism and guard the memories of Nazi victims.",
  "Advertisement Continue reading the main story\n\n“It is a despicable insult to Holocaust survivors around the world, and to the nation he is about to lead, that Donald Trump compares America to Nazi Germany.",
  "The president-elect has denigrated our nation and its commitment to freedom on the eve of his inauguration.",
  "He must retract his tweet and apologize to survivors and to our entire nation,” said Steven Goldstein, executive director of The Anne Frank Center for Mutual Respect, the American wing of an international organization that fights discrimination in Anne Frank’s name.",
  "The Anti-Defamation League also joined the denunciations.",
  "The blowback was a reminder to Mr. Trump of what is known as Godwin’s Law: “As an online discussion grows longer, the probability of a comparison involving Hitler approaches.” And once it happens, the conversation generally stops.",
  "It wasn’t particularly presidential but it was surprising\n\nVideo\n\nPresident-elect Trump angrily accused CNN of being “fake news” as he repeatedly refused to take a question from Jim Acosta, the network’s reporter at his news conference.",
  "In a testy exchange between the two men, Mr. Acosta repeatedly asked for a question in order to respond to the president-elect’s accusations against the network.",
  "Mr. Trump angrily said, “I am not going to give you a question.",
  "You are fake news.”\n\nMr. Trump also lashed out at Buzzfeed News, which published a document of allegations Tuesday night, calling the news organization a “failing pile of garbage” and saying that “I think they are going to suffer the consequences.”\n\nNo, Mr. Trump, it isn’t only reporters who are interested in your tax returns\n\nDuring his news conference, the president-elect was pressed to release his tax returns to prove that his businesses have no relationships with Russian oligarchs.",
  "Mr. Trump refused, once again, and then made a novel claim: “You know, the only one that cares about my tax returns are the reporters, O.K.",
  "?”\n\nFact check: False.",
  "Source: Representative Mark Sanford, Republican of South Carolina.",
  "When he was that state’s governor, Mr. Sanford famously disappeared to Argentina to pursue an extramarital affair under the guise of hiking the Appalachian Trail.",
  "“I think it’s a grave mistake for President-elect Trump to assume that no one - except reporters - cares about whether or not he releases his tax returns.",
  "“I care - or more aptly said, I still care.",
  "I cared five months ago when I wrote an op-ed published in The New York Times on this very issue.",
  "And I care now because the consequences of not doing so will echo into future campaigns.",
  "“This is not about invading his privacy or looking for avenues into opposition research.",
  "This is about upholding precedent and encouraging transparency.",
  "Refusing to release his tax returns now will likely lead to much the same from future presidential candidates, and I predict that a trickle-down effect will occur where down-ballot candidates won’t feel pressured to do so either.”\n\nWhen Mr. Sanford gets to lecture on ethics, well, that’s notable.",
  "Yes, Emirates really did offer Trump a $2 billion deal\n\nThe Trump Organization may not be looking for new foreign deals, but that doesn’t mean big businesses overseas aren’t looking to hook up with the president-elect’s family business.",
  "Advertisement Continue reading the main story\n\nAt his news conference on Wednesday, Mr. Trump said that Damac, a large developer in the United Arab Emirates, had recently tried to reach a $2 billion deal with the Trump Organization, which declined the offer.",
  "Niall McLoughlin, a senior vice president at Damac, confirmed Mr. Trump’s account, saying in an email that “the discussions took place as stated in the media briefing.”\n\n“But the proposals were declined.",
  "These proposals were for a variety of different properties deals,” he added, without elaborating.",
  "Damac is a major developer in the Persian Gulf region.",
  "It is building the Trump International Golf Club Dubai and an adjacent luxury housing development, which does not bear the Trump name.",
  "The project has been in the works since 2013, with the Trump Organization managing the golf club after it opens, scheduled for February.",
  "Damac has some ties to the Emirati government — any big business in the Emirates does — but its founder, Hussain Sajwani, is not part of the social and political elite.",
  "His father owned a small shop in Dubai’s market that sold midrange watches and pens, and the family was solidly middle class, and even today Mr. Sajwani remains an outsider among the tightly knit old families that control the Emirates.",
  "In many ways, Mr. Sajwani is a lot like Mr. Trump.",
  "He has a flair for showmanship — he once tried to attract buyers for a new development by offering a free Bentley with every apartment — and his best customers tend to be rich outsiders who are trying to buy their way into the elite, like moneyed Iranians and well-off Indians.",
  "This time, Big Pharma gets to panic\n\nAdmittedly, the president-elect was a little vague, but for the nation’s pharmaceutical giants, he was clear enough: The drug industry, Mr. Trump said, is “getting away with murder.”\n\n“Pharma has a lot of lobbies and a lot of lobbyists and a lot of power, and there’s very little bidding on drugs.",
  "We’re the largest buyer of drugs in the world and yet we don’t bid properly and we’re going to start bidding and we’re going to save billions of dollars over a period of time,” he said.",
  "Advertisement Continue reading the main story\n\nDuring the early months of the campaign, before less substantive issues swamped the debate, Mr. Trump broke with his party and said the federal government should be using its purchasing power to negotiate drug prices for Medicare and Medicaid.",
  "Democrats have been pressing that for years — it was in an early version of the Affordable Care Act.",
  "But Republicans, backed by the drug industry, have adamantly opposed, and thwarted, every effort to give the Centers for Medicare and Medicaid Services that authority.",
  "But the Republican Party of Mr. Trump has found a way to change sides on a lot of issues.",
  "Trump nominates Veterans Affairs secretary\n\nPhoto\n\nDavid J. Shulkin, the current undersecretary at the Department of Veterans Affairs and the head of its sprawling hospital system, will become the secretary of the beleaguered agency, President-elect Trump said Wednesday.",
  "Mr. Trump made the comments during his first full news conference since being elected president two months ago and just nine days before moving into the White House.",
  "He answered questions from some of the more than 250 reporters crammed into the lobby of Trump Tower in Manhattan.",
  "Even as Mr. Trump took questions in New York, his nominee for secretary of state was being grilled on Capitol Hill by lawmakers about his connections to Russia.",
  "And news continued to swirl regarding allegations about Mr. Trump presented by intelligence officials to the president-elect.",
  "A defense on Twitter\n\nFrom the moment the unsubstantiated but explosive intelligence report hit the internet, the questions arose: When and what would Mr. Trump post on Twitter?",
  "The initial volley came shortly after 8:15 p.m. on Tuesday.",
  "Then on Wednesday morning, the president-elect decided to press his war with the intelligence agencies he will soon oversee — and rely on for pressing matters of state.",
  "He also seconded reports from Moscow that Russian government officials deny having any compromising material on Mr. Trump.",
  "It is true that the Kremlin denied holding any material that it could use to blackmail the incoming president.",
  "Dmitri S. Peskov, a spokesman for President Vladimir V. Putin, told reporters: “The Kremlin has no compromising dossier on Trump.",
  "Such information isn’t consistent with reality and is nothing but an absolute fantasy.”\n\nAdvertisement Continue reading the main story\n\nNeedless to say, Russian officials would not tell the world they had such information if it was meant for blackmail.",
  "Also needless to say, an election won with nearly three million votes fewer than your opponent was not won easily.",
  "A Quinnipiac University poll on Tuesday put Mr. Trump’s approval rating at 37 percent.",
  "It should be an interesting news conference at Trump Tower on Wednesday morning.",
  "A problem for Trump: You can’t unsee something\n\nQuestions continue to swirl about the validity of the dossier saying that Russian intelligence has deeply compromising material on the man who is about to be commander in chief.",
  "But its wide circulation has already had an impact.",
  "On Tuesday night, Representative Brad Sherman, Democrat of California, asked President Obama for a classified briefing on “the compromising information Russia has obtained regarding President-elect Donald Trump.”\n\nNewsletter Sign Up Continue reading the main story Get the Morning Briefing by Email What you need to know to start your day, delivered to your inbox Monday through Friday.",
  "Please verify you're not a robot by clicking the box.",
  "Invalid email address.",
  "Please re-enter.",
  "You must select a newsletter to subscribe to.",
  "Sign Up You will receive emails containing news content , updates and promotions from The New York Times.",
  "You may opt-out at any time.",
  "You agree to receive occasional updates and special offers for The New York Times's products and services.",
  "Thank you for subscribing.",
  "An error has occurred.",
  "Please try again later.",
  "View all New York Times newsletters.",
  "On Wednesday, the Democratic National Committee’s interim chairwoman, Donna Brazile, pressed for a bipartisan, independent investigation.",
  "“Senate Majority Leader Mitch McConnell must allow the establishment of an independent bipartisan commission to immediately investigate the full range of foreign interference in the 2016 election and determine what we need to do to keep our democracy safe from foreign interference.",
  "As part of that investigation, the commission must investigate President-elect Trump’s personal and financial ties to Russia, ties between his aides and Russia, and the existence of allegedly compromising material that has allegedly been obtained by Russia in order to blackmail him.”\n\nSenator Richard Durbin of Illinois, the No.",
  "2 Democrat, said he too wants a special investigation into the dossier."
]