[
  "JOHN DICKERSON, CBS NEWS: Today on FACE THE NATION: With just five days until the inauguration of Donald Trump, a new era dawns in Washington.",
  "After a contentious press conference, his first in 168 days.",
  "(BEGIN VIDEO CLIP)\n\nDONALD TRUMP (R), PRESIDENT-ELECT: I think it was disgraceful, disgraceful that the intelligence agencies allowed any information that turned out to be so false and fake out.",
  "I think it is a disgrace.",
  "And that is something that Nazi Germany would have done and did do.",
  "(END VIDEO CLIP)\n\nDICKERSON: President-elect Donald Trump prepares to take the oath of office.",
  "We will ask vice president-elect Mike Pence about the latest investigation into Russian meddling, Donald Trump`s relationship with the intelligence community and the press.",
  "(BEGIN VIDEO CLIP)\n\nTRUMP: No, I am not going to give you a question.",
  "You are fake news.",
  "(END VIDEO CLIP)\n\nDICKERSON: Then we will turn to West Virginia Democrat Joe Manchin and the Senate`s investigation into Russia`s cyber-espionage.",
  "Plus, more insight into America`s 45th president from a top Trump transition adviser, Newt Gingrich.",
  "A deep dive into the ties between the new Trump staff and the Russians.",
  "And our weekly political panel.",
  "It`s all ahead on FACE THE NATION.",
  "JOHN DICKERSON: Good morning.",
  "And welcome to Face the Nation.",
  "I’m John Dickerson.",
  "Vice-president-elect Mike Pence starts off our broadcast this morning.",
  "Welcome, Mr. Vice-president-elect--\n\nMIKE PENCE: Thank you, John.",
  "JOHN DICKERSON: Five days from now, you will be the vice-president.",
  "Let’s start with some news.",
  "The Republican chairman of the Senate Intelligence Committee has decided to investigate Russian meddling in the election.",
  "That includes any possible contact between the Russians trying to meddle and the Trump campaign.",
  "What’s your reaction to that?",
  "MIKE PENCE: Well, I think the president-elect and I both welcome the Congress doing its oversight work in this and any other area.",
  "And we look forward to the results of their inquiry.",
  "But make no mistake about it.",
  "I think they’ll find what the publicly released intelligence report showed before, is that there’s no evidence of any impact on voting machines.",
  "Donald Trump won this election fair and square.",
  "30 out of 50 states.",
  "More counties than any Republican candidate since Ronald Reagan.",
  "And so while we certainly respect the right of the Congress to provide oversight, to make inquiries where they deem them appropriate, this-- the American people spoke in this election.",
  "And the peaceful transition of power that’ll take place this coming Friday on a platform where our president-elect will take the oath of office surrounded by four of the five living presidents is a testament to our democracy.",
  "And I’m incredibly humble to be a part of it, John.",
  "JOHN DICKERSON: Last week before that intelligence briefing, the president-elect said he felt like all these questions were part of a witch hunt.",
  "He’s now had some new information.",
  "There’s now the Senate Intelligence Committee.",
  "So does-- he no longer thinks this is a witch hunt, this investigation into Russian meddling.",
  "Is that fair to say?",
  "MIKE PENCE: Well, I think that there frankly has just been an effort by many in the national media, present company excepted, since this election to essentially demean and question the legitimacy of this incoming administration.",
  "And talk of that, sources within the intelligence community that have been attributed with sharing that information, public officials.",
  "I think it’s a real disservice to our democracy.",
  "As I’ve said, Donald Trump won a landslide American.",
  "The American people spoke decisively.",
  "They wanted change.",
  "And I promise them come noon this coming Friday, change really begins.",
  "And we’re going to make America great again.",
  "JOHN DICKERSON: But there’s a distinction between that feeling about the press and legitimate inquiry, as you say, that the Senate Intelligence Committee is doing.",
  "Just to button up one question, did any advisor or anybody in the Trump campaign have any contact with the Russians who were trying to meddle in the election?",
  "MIKE PENCE: Of course not.",
  "And I think to suggest that is to give credence to some of these bizarre rumors that have swirled around the candidacy.",
  "And the fact that a few news organizations, not this one, actually trafficked in a memo that was produced as opposition research and associated that with intelligence efforts I think could only be attributed to media bias.",
  "And as I said this week at a press conference, John, the American people are tired of it.",
  "We’re coming into this week with a great sense of optimism.",
  "The American people know that we can have government in Washington, D.C. as good as our people.",
  "We can get this economy moving again.",
  "We can rebuild our military.",
  "JOHN DICKERSON: Let me move on--\n\nMIKE PENCE: We can be standing tall in the world again.",
  "And those are the reasons why Donald Trump’s going to take that oath of office--\n\nJOHN DICKERSON: Let’s--\n\nMIKE PENCE: --on Friday.",
  "JOHN DICKERSON: Let’s move to the world.",
  "What does Donald Trump feel about Vladimir Putin and Russia?",
  "MIKE PENCE: Well, I think in the president-elect you have someone who is willing to approach this terrible relationship the United States has with Russia today with fresh eyes and to at least be open to a better relationship with Vladimir Putin and with Russia.",
  "Look, we have some common interests that would be well served if we were able to improve our relationship with Russia.",
  "Most notably the battle to defeat radical Islamic terrorism and to defeat I.S.I.S.",
  "at its source.",
  "But I think the president-elect also made it clear this week, John, that while a better relationship with Russia would be a good thing, I think he’s realistic about the possibility of that.",
  "And I think when you see the cabinet that he’s assembled--\n\nJOHN DICKERSON: I want to ask you about that.",
  "MIKE PENCE: --General Mattis, and Senator Coats, and Mike Pompeo, we’re coming at this--\n\nJOHN DICKERSON: But--\n\nMIKE PENCE: --with realistic expectations.",
  "JOHN DICKERSON: Well, I mean--\n\nMIKE PENCE: But the president-elect is determined to re-engage the world, put America first, and see if we can make progress for the security and peace of the world.",
  "JOHN DICKERSON: Let me ask you about that.",
  "Because the picture that Donald Trump put forward about his view of Russia seems quite different than the gentlemen you mentioned.",
  "Incoming Secretary of Defense Mattis and then also Secretary of State Tillerson.",
  "Mr. Tillerson said Russia poses a danger.",
  "He called Russia an adversary.",
  "He said there are a number of areas where America is going to have to confront Russia.",
  "That’s not an opinion.",
  "That’s confrontational.",
  "Mr. Mattis said the most important thing to recognize is that Putin is trying to break the North Atlantic Alliance.",
  "My question is: If the American people are listening to Mr. Trump and listening to those men and, more importantly, countries overseas are listening, who’s driving the bus?",
  "Mr. Trump or those two men?",
  "MIKE PENCE: Well, the great thing about being around Donald Trump is you never have any confusion about who’s driving the bus, and where the buck stops, and who will make the final decision.",
  "I think as you hear the testimony of Rex Tillerson, of General Mattis, and Mike Pompeo, I think the American people will be greatly encouraged by the fact that the president-elect is assembling around him people of extraordinary background and capability who will bring their own experience and their own perspective to inform the president’s decisions.",
  "And ultimately-- (OVERTALK)\n\nMIKE PENCE:--the president will make the best decision in the best interests of the American people.",
  "But I can-- (OVERTALK)\n\nJOHN DICKERSON:--have Mattis and Tillerson saying, “Confront Russia.” Donald Trump doesn’t sound like a guy who wants to confront Russia.",
  "MIKE PENCE: Well, you know, if you listen carefully to that press conference this week, and I was standing just alongside of him at the time, that he said it’d be good if we had a better relationship with Russia--\n\nJOHN DICKERSON: But does-- (OVERTALK)\n\nMIKE PENCE: --I hope it’s get better.",
  "But he said, “Maybe not.”\n\nJOHN DICKERSON: But, does Donald Trump demand that Russia get out of eastern Ukraine?",
  "That would be a confrontation that people-- certainly Mattis and Tillerson would-- in the context of what they said, it sounds like that’s what they want.",
  "Does Donald Trump want Russians out of eastern Ukraine?",
  "MIKE PENCE: Well, let’s be very clear that whether it be eastern Ukraine or Crimea, that the action by the Russians has demonstrated the absence of American leadership over the last eight years--\n\nJOHN DICKERSON: We have new leadership.",
  "What does the new leadership want to do?",
  "MIKE PENCE: Well, I think-- I think America is going to be more respected in the world the very moment that Donald Trump takes the oath of office as the 45th president of the United States.",
  "And he’ll work through these issues, John.",
  "I think what the country--\n\nJOHN DICKERSON: Let me--\n\nMIKE PENCE: --should be encouraged by is whether it be Rex Tillerson as our secretary of state, Nikki Haley going to the United Nations, General Mattis, is that he is surrounding himself with a group of men and women that are going to bring the broadest range of experience, inform his decisions.",
  "And he’ll take the kind of actions and make the kind of decisions that’ll put America first.",
  "JOHN DICKERSON: Mr. Tillerson said he hadn’t had a conversation about Russia with Donald Trump.",
  "How can that be?",
  "MIKE PENCE: Well, I think in the context of these confirmation hearings, the president-elect has made a point to talk to each of the various candidates for these positions.",
  "And the nature of those conversations is usually wide ranging.",
  "And so I-- (OVERTALK)\n\nJOHN DICKERSON: But not wide ranging to get Russia in there.",
  "MIKE PENCE: Well--\n\nJOHN DICKERSON: I guess the point is if Donald Trump’s driving the bus, shouldn’t his secretary of state know where the bus is going?",
  "MIKE PENCE: I think Rex Tillerson will have and has no confusion about who will be making the decisions in the Trump administration.",
  "And that’s true of all of us.",
  "I mean, what-- (OVERTALK) --what’s so encouraging to be around Donald Trump and to literally be sitting side by side with him during the course of this transition.",
  "He’s done hundreds of interviews and made decisions, attracted men and women of extraordinary caliber to this cabinet, I think we may well have the entire cabinet named before the inauguration, is to see a leader who is decisive.",
  "He asks incisive questions.",
  "He gets straight to the point.",
  "He knows what he’s looking for.",
  "And when he sees it, he makes a decision.",
  "JOHN DICKERSON: Let me ask you about it was reported by David Ignatius that the incoming national security advisor Michael Flynn was in touch with the Russian ambassador on the day the United States government announced sanctions for Russian interference with the election.",
  "Did that contact help with that Russian kind of moderate response to it?",
  "That there was no counter-reaction from Russia.",
  "Did the Flynn conversation help pave the way for that sort of more temperate Russian response?",
  "MIKE PENCE: I talked to General Flynn about that conversation and actually was initiated on Christmas Day he had sent a text to the Russian ambassador to express not only Christmas wishes but sympathy for the loss of life in the airplane crash that took place.",
  "It was strictly coincidental that they had a conversation.",
  "They did not discuss anything having to do with the United States’ decision to expel diplomats or impose censure against Russia.",
  "JOHN DICKERSON: So did they ever have a conversation about sanctions ever on those days or any other day?",
  "MIKE PENCE: They did not have a discussion contemporaneous with U.S. actions on--\n\nJOHN DICKERSON: But what about after--\n\nMIKE PENCE: --my conversation with General Flynn.",
  "Well, look.",
  "General Flynn has been in touch with diplomatic leaders, security leaders in some 30 countries.",
  "That’s exactly what the incoming national security advisor--\n\nJOHN DICKERSON: Absolutely.",
  "MIKE PENCE: --should do.",
  "But what I can confirm, having spoken to him about it, is that those conversations that happened to occur around the time that the United States took action to expel diplomats had nothing whatsoever to do with those sanctions.",
  "JOHN DICKERSON: But that still leaves open the possibility that there might have been other conversations about the sanctions.",
  "MIKE PENCE: I don’t believe there were more conversations.",
  "JOHN DICKERSON: Okay.",
  "Okay.",
  "Okay.",
  "Let’s move on.",
  "Okay.",
  "Got it--\n\nMIKE PENCE: I can confirm those elements were not a part of that discussion.",
  "JOHN DICKERSON: Congressman John Lewis, who you served with, Democrat, told on Meet the Press that he did not consider Donald Trump a legitimate president.",
  "Your reaction to that?",
  "MIKE PENCE: Well, look.",
  "Donald Trump won this election fair and square.",
  "30 out of 50 states including Georgia.",
  "More counties than any Republican candidate since Ronald Reagan.",
  "And to hear John Lewis, a man that I served with, that I respect question the legitimacy of the election and to say that Donald Trump will not be a legitimate president is deeply disappointing to me.",
  "And also to hear that he was not going to attend the inauguration this Friday.",
  "I hope he reconsiders both statements.",
  "But look.",
  "This is a time when we’re facing real challenges at home and abroad.",
  "And I believe the inauguration ceremony itself and this moment in history would greatly benefit if we set aside these baseless assertions about the legitimacy of the election and we look for ways to come together, to work together.",
  "And the president-elect actually in a tweet late last night invited Congressman Lewis to work with us to bring more prosperity, better schools, more safety to our cities around the country.",
  "JOHN DICKERSON: Let me ask you about a tweet he sent before that tweet in which he defended himself.",
  "Famous counter-puncher Donald Trump said that John Lewis was all talk and no action.",
  "I got a question.",
  "He has every right to defend himself.",
  "Let me ask you about the wisdom of defending himself.",
  "For five years, Donald Trump questioned the legitimacy of Barack Obama, that he wasn’t born in America, he was really the chief advocate of this so-called birther idea.",
  "Given that history, given that he’s about to be president, why swing at this pitch?",
  "Couldn’t he have just let it go by, be the bigger man, let John Lewis do his thing, move on?",
  "He’s about to be president of the United States.",
  "As you say, all those challenges.",
  "Bringing the country together.",
  "Why swing at this pitch?",
  "MIKE PENCE: Well, as you said, Donald Trump has every right to defend himself.",
  "And to have someone--\n\nJOHN DICKERSON: But he did--\n\nJOHN DICKERSON: Well-- (OVERTALK)\n\nJOHN DICKERSON: --the legitimacy of President Obama.",
  "So why-- (OVERTALK)\n\nMIKE PENCE: Well-- (OVERTALK)\n\nMIKE PENCE: --someone like John Lewis.",
  "Look.",
  "I served with John.",
  "I disagree with him on most issues, but I had tremendous respect for him.",
  "Actually, my family and I walked across the Edmund Pettus Bridge with him on the 65th anniversary of Bloody Sunday.",
  "You know, we honor the sacrifice that he made.",
  "But part of the result of what happened on Bloody Sunday and the courage that he showed was the Voting Rights Act.",
  "And so for someone of his stature not just in the civil rights movement but in voting rights to make a comment that he did not consider Donald Trump to be a legitimate president I think is deeply disappointing.",
  "Look, I attended both of Barack Obama’s inaugurations, one as a congressman and one as a governor, because I believe inaugurations are a moment when we should come together around that individual who has been elected to be president of the United States of America.",
  "Donald Trump said it on election night, John, that he’s determined to be president of all of the people of this country.",
  "And I do hope that John Lewis will reconsider his statement but also will reconsider attending the inauguration, will join us so that we can come together to take on the intractable problems facing Americans, particularly too many families in our inner cities who are beset by unsafe streets, failing schools, and a lack of jobs and opportunities.",
  "JOHN DICKERSON: One final question.",
  "Esquire has a report that the Trump administration is thinking of moving the press out of White House.",
  "Is that a logistical move or a punitive move?",
  "MIKE PENCE: I think no decisions have been made on that yet.",
  "As you know, having been in this town a lot longer than me, the White House is actually 18 acres.",
  "And I think what the team told me is there is such a tremendous amount of interest in this incoming administration that they’re giving some consideration to finding a larger venue on the 18 acres in the White House complex to accommodate the extraordinary interest.",
  "The White House press room, which you’ve served in, John, is actually a pretty small room.",
  "And I think the interest of the team is to make sure that we accommodate the broadest number of people who are interested and media from around the country and around the world.",
  "But we’re working that out in a way that’ll reflect our commitment to transparency, to a free and independent press.",
  "And we look forward to those days.",
  "(OVERTALK)\n\nJOHN DICKERSON: And if you get rid of the press briefing room, you can create more room for the daily press guys who have to be there every day.",
  "So you got more room there for more of them.",
  "Thank you.",
  "MIKE PENCE: I’ll pass that along.",
  "JOHN DICKERSON: Thank you very much, Mr. Vice-president-elect.",
  "We really appreciate it.",
  "MIKE PENCE: Thank you, John.",
  "JOHN DICKERSON: And we’ll be back in one minute with Democratic Senator Joe Manchin.",
  "Stay with us.",
  "(COMMERCIAL BREAK)\n\nJOHN DICKERSON: Joining us now from Charleston, West Virginia, is Democratic Senator Joe Manchin, who serves on the Senate Intelligence Committee.",
  "Senator, I want to ask you about the Committee.",
  "Senator Burr, who is the chairman of the Intelligence Committee said, quote, “We don’t have anything to do with political campaign,” when asked if the Committee was going to investigate this idea of Russians trying to affect the election.",
  "But then that opinion was changed, and the Intelligence Committee is now going to look into that issue and whether there were any connections with the Russians and the Trump campaign.",
  "So what happened between when he said that, and now the decision to actually hold hearings?",
  "JOE MANCHIN: Well, Senator Warner’s our ranking member on the Committee.",
  "I’m brand new on the committee, and I’m very proud to be on this Committee, and I’m learning an awful lot.",
  "But I think that Richard Burr, Senator Burr, my dear friend, saw the interest that we all have, and basically, seeing the interest of the American people, that we want to find out the intent of the Russians, and to what extent the Russians are involved.",
  "And the American people need to know, our colleagues need to know.",
  "We believe and I believe now that the committee that we have, the Intelligence Committee, is the best Committee to do that.",
  "And we can do, John, quite a bit of open meetings there, in that Committee also, once we get to the classified status, and then we have to go into our closed meetings.",
  "So we can do better, I think, and quicker to get people informed.",
  "The Committee is professionally staffed.",
  "They know what they’re doing.",
  "And I have an awful lot of faith and confidence in them.",
  "And we’re going to get to the bottom of this very quickly.",
  "And I am glad they changed the direction.",
  "I am happy for the statements that both Senator Burr and Senator Warner have made now.",
  "We’re working together, and that’s a great committee with people who really care.",
  "And we’re going to take politics out.",
  "It’s about the security of our nation, not the politics of our nation.",
  "JOHN DICKERSON: There is a spectrum of responses to the Russian actions.",
  "On the one hand, some intelligence officials say this is an unprecedented effort to try to influence the U.S. election.",
  "On the other hand, incoming Chief of Staff Reince Priebus and the Trump team says, you know, this is a pattern.",
  "The Russians have been doing this for 50 years.",
  "Which seems to suggest this is just not a new thing.",
  "Where do you put yourself on that spectrum?",
  "JOE MANCHIN: Well, first of all, both statements are correct, John.",
  "The Soviets back in the ‘60s and ‘70s have been involved, we know they’ve been involved and they’ve been trying to be involved in many ways.",
  "Whether it be advertising or support, and trying to change those, who they thought would be harmful to the Kremlin.",
  "And now with Russia taking it to an unprecedented level, we’re seeing, and everything has been reported in an unclassified way, that they have been involved more direct than any time in the past.",
  "So it’s very troubling to find out what level and to the extent they’ve gone to, and where that’s come from.",
  "That’s what we’re going to find out.",
  "That’s what the American people want to know, and it’s what my colleagues should know, so we know basically their true intent, and we cannot let them be involved in basically altering our political process.",
  "JOHN DICKERSON: Let me ask you about the incoming Trump administration.",
  "You’ve met with the President-elect.",
  "You’ve met also with Mike Pence.",
  "What is your message to Democrats who are nervous about the incoming administration?",
  "JOE MANCHIN: Well, I mean, I would approach this as I would anything else.",
  "I’m very appreciative they’ve reached out to me.",
  "And knowing that I’m a centrist and moderate, dead in the center, if you will, where I think most Americans are.",
  "That means we have to work together.",
  "They’re willing to cross over in the aisle.",
  "They’re willing to cross over and meet me halfway.",
  "I’m definitely going to cross over and try to meet with him to find a pathway forward.",
  "That’ll be my job.",
  "With them, I would tell all my colleagues, let’s just try to do the work of the people of this great country.",
  "Let’s make sure we know we’re Americans first.",
  "The process of elections, the politics, is behind is.",
  "Or it should be.",
  "The election’s over.",
  "Donald Trump has been elected.",
  "He is our incoming president.",
  "We should all want, no matter who our president is, to be the best they can be, to be successful.",
  "Because if they do well, our country does extremely well, my state of West Virginia does extremely well.",
  "So I’m going to work and try in a most productive manner to make sure we’re moving in the right direction.",
  "And I will always do that.",
  "JOHN DICKERSON: Senator, what do you think of Congressman John Lewis’ decision to not attend the inauguration, and some other of his colleagues making that same decision?",
  "JOE MANCHIN: John, I’ve got the utmost respect for Congressman Lewis.",
  "He’s an icon, if you will.",
  "And we all have the most respect for him.",
  "I just think that was uncalled for.",
  "I just wish that rhetoric would tone down, from both back and forth.",
  "The bottom line is, if we’re concerned about the Russians and we know the Russians want to be involved, Putin wants to be involved in altering our process, then he will succeed if he sees this bickering going back and forth.",
  "That’s what we have to stop.",
  "We’re bigger than this.",
  "And we’re going to show them they’re not going to change and not going to alter how we work and function as Congress, as a government, and the United States of America.",
  "We’re not going to let that happen.",
  "So for this type of rhetoric, it’s non-productive.",
  "And I would like it if that would tone down a little bit, we’d be much better off and move on.",
  "JOHN DICKERSON: All right.",
  "Senator Manchin, we’re going to have to leave it there.",
  "Thanks so much for being with us, and we’ll be back in just a moment with former House Speaker Newt Gingrich, an advisor to the Trump transition.",
  "(COMMERCIAL BREAK)\n\nJOHN DICKERSON: We’re joined now by former House speaker and Trump transition vice-chairman Newt Gingrich.",
  "Mr. Speaker, I want to help you.",
  "I want to ask you to help us --\n\nNEWT GINGRICH: (Laughs)\n\nJOHN DICKERSON: You need no help from me.",
  "(Laughs) What I’d like to ask you is – is help us think through -- Mike Pence says Donald Trump is driving the bus.",
  "But on Russia, Donald Trump has one view.",
  "He doesn’t talk about Russia as an adversary.",
  "He doesn’t talk about confronting.",
  "But his secretaries of state and defense talk about Russia as a clear and present adversary, says America needs to confront Russia.",
  "If I’m an American citizen or a foreign country, how do I make sense of those two things?",
  "NEWT GINGRICH: Well, I think first of all you realize that Trump has selected very, very knowledgeable people.",
  "I mean, it would be hard to be better than General Mattis going into the Defense Department.",
  "I think Rex Tillerson brings an astonishing level of achievement negotiating with foreign countries.",
  "So you know that when they have councils to talk about policy, he’s going to have very sophisticated advice.",
  "What you also know is that he is his own person.",
  "I mean, this is a guy who has been-- he’s an entrepreneur.",
  "He’s not a corporate CEO.",
  "He’s not a guy who says, “I want my staff to give me three options.” What he wants is various people to give him 30 options.",
  "And then he’s going to pick what he believes in.",
  "And I suspect he fully expects Mattis and Tillerson to implement the Trump policy.",
  "JOHN DICKERSON: Okay.",
  "We’re going to have to leave it there.",
  "We’ll be right back with you.",
  "We’re going to take a quick break, and we’ll be right back with former Speaker Gingrich.",
  "Don’t go away.",
  "(COMMERCIAL BREAK)\n\nJOHN DICKERSON: And we’re back with former House speaker and Trump transition vice-chairman Newt Gingrich.",
  "I want to pick up where we left off.",
  "You talked about how Donald Trump is going to sift through all of this-- opinions from various advisors.",
  "What do they think in foreign capitals, though?",
  "When they hear two different things, or many -- if they hear 30 different things, how do they make decisions based on what they think the Trump administration’s going to do?",
  "NEWT GINGRICH: Well, I think foreign capitals are going to be a lot like the American press corps.",
  "I mean, and most like citizens -- we’re going to go through a period here of adjustment to the fact that we have the first truly entrepreneurial president we’ve seen in modern times.",
  "And I think you have to go back to Theodore Roosevelt to get the same level of daily energy, and drive, and confusion.",
  "And the confusion is caught because he’s not staffed.",
  "You know, he has people near him who try to understand him.",
  "But, he-- you know, Donald J. Trump got to be president his way.",
  "And he’s going to be president his way.",
  "And the fact is, the rest of the planet’s going to have to -- for better or worse -- learn how to cope with a president who’s very complicated.",
  "JOHN DICKERSON: In foreign capitals, that can mean, though, building a bigger military.",
  "It can mean making alliances.",
  "I mean, you--\n\nNEWT GINGRICH: Well –\n\nJOHN DICKERSON: Sometimes –\n\nNEWT GINGRICH: -- it can mean a lot of phone calls, for example, from the foreign minister to Tillerson saying, “Rex, you know, what is this guy doing?” And it means that Mattis and Tillerson have a really large assignment.",
  "And so does Nikki Haley up at the United Nations.",
  "Because they’re the explainers who have to be able to—to—do -- go both ways.",
  "And it’s walk in and say, you know, “Mr.",
  "President, what you said yesterday was interpreted the following way.” And he’ll learn from that.",
  "I mean, it’ll be a 90-day cycle of real learning.",
  "JOHN DICKERSON: Let me ask you about interpretations in the intelligence community.",
  "He-- Donald Trump takes over the intelligence community in five days.",
  "He referred to them twice and compared to the Nazis.",
  "You need trust in that relationship.",
  "If his first reaction is to think the intelligence agencies are trying to do him wrong and compares them to the Nazis, that does not suggest a relationship of trust--\n\nNEWT GINGRICH: Well, I don’t think there should be--\n\nJOHN DICKERSON: -- that would be healthy.",
  "NEWT GINGRICH: --a good relationship right now.",
  "I mean, I’ve spent a lot of my career, as you know, dealing with the intelligence community.",
  "And I want to make two points.",
  "1) The very top people who are political appointees I think absolutely betrayed and undermined the intelligence community.",
  "I think they acted in ways that were totally inappropriate.",
  "2)--\n\nJOHN DICKERSON: In this specific context?",
  "NEWT GINGRICH: In this specific context.",
  "They also did, by the way, in Benghazi.",
  "If you go back and look at how the CIA agreed to restate the facts in a way that was totally false.",
  "I mean, this is at the political appointee level, which has really been corrupted by the Obama administration.",
  "There’s a second part though, which may just be a reference to the general decay of American education.",
  "How do you get a report that apparently John McCain passed -- passed in December that says that this one person, a real human being, was in Prague and in all of that time, in 10 months, 11 months, nobody in the intelligence community picked up the phone and said, “Have you ever been to the Czech Republic?” I mean, think--think about the level of incompetence.",
  "JOHN DICKERSON: Well—so, I guess my question is how do you work, then, with this--\n\nNEWT GINGRICH: Well, I hope what he does is say to the new Director of National Intelligence, Dan Coats, “I expect you to thoroughly overhaul the entire community.”\n\nJOHN DICKERSON: Let me ask you this.",
  "You know about big change.",
  "You came in after the elections of 1994.",
  "What’s the biggest obstacle -- when you have, when you want to do a lot of things very quickly-- that Donald Trump faces?",
  "NEWT GINGRICH: Well, I think they’ve got to decide what the top three to five things are, stay focused on them every morning as long as they can until they get them done.",
  "As they check them off, they add a new one.",
  "But they can’t do more than three to five.",
  "Obamacare is clearly going to be decisive.",
  "Jobs is the centerpiece of this administration.",
  "And as he said at one point, he has three goals.",
  "Jobs, jobs, jobs.",
  "If he succeeds with that, then he will have met his contract with the American people.",
  "JOHN DICKERSON: So you said stay focused.",
  "Is that the--\n\nNEWT GINGRICH: Absolutely--\n\nJOHN DICKERSON: -- key challenge?",
  "NEWT GINGRICH: The hardest thing—\n\nJOHN DICKERSON: So the key challenge is staying focused?",
  "NEWT GINGRICH: -- for a president to do is remember why they got up in the morning and what they’re trying to accomplish.",
  "Reagan was a genius at it.",
  "He had three things he focused on for eight solid years.",
  "And he changed history.",
  "JOHN DICKERSON: Do you think that’s a particular challenge for this president?",
  "The focus--\n\nNEWT GINGRICH: Well, no.",
  "I think he built his empire by being very good at staying focused.",
  "JOHN DICKERSON: All right.",
  "Speaker Gingrich, thank you so much--\n\nNEWT GINGRICH: Good to be with you.",
  "JOHN DICKERSON: --for being with us.",
  "And we’ll be back in just a moment with a discussion on national intelligence and Russian cyberattacks.",
  "(COMMERCIAL BREAK)\n\nDICKERSON: We`re joined now by “The Washington Post`s” David Ignatius, who`s been covering Russia`s involvement in the cyber- attacks during the 2016 campaign.",
  "David, I want to start with the Senate Intelligence Committee.",
  "They`ve decided to look into the whole question, but in particular also Russia connected with the Trump campaign.",
  "What is the most important question they need to answer?",
  "DAVID IGNATIUS, “WASHINGTON POST”: Well, I think first, it`s - it`s important that Vice President-elect Pence welcome that investigation, implicitly committed to support it.",
  "I think they need to get to the bottom of the issues that were raised in this unsubstantiated, so far as we know, inaccurate dossier that was compiled about contacts between members of the Trump campaign and Russia during what is now a confirmed Russian covert action against our political system.",
  "That`s - that`s job one.",
  "I - I think it`s important when we think about the Senate investigation to remember that there`s also an FBI investigation.",
  "That it`s my understanding it`s still open into these same issues.",
  "It`s important that that investigation be allowed to be completed.",
  "That there be no intervention to shut that down.",
  "And - and I - I hope members of the incoming administration will commit to - to let that investigation run its course, issue findings and then establish basic facts.",
  "We get out of fake news into real facts.",
  "DICKERSON: What do you make of the fact that Chairman Burr at one point was saying he wasn`t going to investigate it and now is?",
  "IGNATIUS: Again, I thought - I thought Senator Manchin said something important this morning, that there - there has been a change.",
  "The Republicans who didn’t think this was necessary now do think it`s necessary.",
  "And that tells the American public there is something here worth looking at.",
  "DICKERSON: You`ve also been writing about Michael Flynn, the incoming national security advisor, and contacts with the Russians.",
  "Mike Pence said, whatever the contacts may have been, they never discussed the question of U.S. sanctions on Russia.",
  "Explain what you take away from that.",
  "IGNATIUS: I thought that the vice president-elect missed the larger point.",
  "It`s - it`s not a question of whether sanctions were discussed, but whether these meetings that were essentially contemporaneous with the announcement of sanctions undercut them.",
  "This was a significant response by the U.S. government to what it perceived as a Russian attack on our political system.",
  "Did talking with the Russian ambassador about future contacts between Trump and Putin and about we now know invitation of a representative of the new administration to a meeting in - in Kazakhstan in January, did that undercut this effort to punish Russia for bad behavior?",
  "And I think that`s really the - the issue.",
  "DICKERSON: Right.",
  "So it doesn’t matter what they talked about, it was, on one hand, American policy is saying, you’ve done something bad, on the other, conversations are suggesting the future -\n\nIGNATIUS: Sure.",
  "Even - even - even taking their own account of what they talked about, I think there`s still an issue.",
  "Did - did those subjects, did that discussion undercut the president`s policy?",
  "We have one president at a time.",
  "That`s just a fact.",
  "And - and these sanctions were a significant move by that president and were they undercut?",
  "DICKERSON: Let me ask you about the cabinet officials who were up for confirmation hearings this week in the Senate.",
  "What did you make about the disconnect between Donald - what Donald Trump has said on Russia and issues of water boarding and what we heard from his to top officials?",
  "IGNATIUS: Well, I - the vice president-elect said - said that President Trump will be driving the bus, in answer to your - your question.",
  "As I look at this, and I`ve covered foreign policy going back to the `70s, I`m embarrassed to say, I have seen this movie before, divided administrations with sharply differing viewpoints on policy have occurred often, and they`re very difficult for presidents to manage.",
  "You know, I - all this stuff about being an entrepreneur and listening - you know, you get a divided administration on an issue like Russia policy - and we now see a clear division between people close to Trump who want a much more (INAUDIBLE) with Russia and people close to Pence who - who seem to strongly resist that.",
  "That`s a - that`s a recipe for real turbulence in the - in the early weeks, months of an administration.",
  "DICKERSON: And what is that - what`s the practical result or effect of that turbulence in a way that people can -\n\nIGNATIUS: Confusing American policy, certainly among our allies.",
  "I just would note one final thing, John.",
  "It`s possible that this whole effort to hack our political system, to destabilize U.S. politics, is backfiring for Russia.",
  "It is beginning to generate real resistance.",
  "You could hear that in the testimony that General Mattis gave, that Rex Tillerson gave, that Mike Pompeo the CIA nominee gave.",
  "And they were - they were pushing back against Russian aggression.",
  "And I think that`s, if you`re sitting in the Kremlin, you were - probably, this is going great.",
  "This week, you may have begun to think, this isn`t going so great.",
  "DICKERSON: And then their hope who have to be that the man at the top has just a different view than the people who speak for him?",
  "IGNATIUS: Well, it`s going to be harder for Trump - he - just assuming Trump really thinks, you know, I can be friends with Vladimir Putin and that`s good for the world, it`s going to be harder to do that in the environment that this hacking scandal has created.",
  "DICKERSON: All right.",
  "OK, David Ignatius, thank you so much.",
  "And we`ll be right back in a moment with our political panel.",
  "(COMMERCIAL BREAK)\n\nDICKERSON: And now we turn to our politics panel.",
  "Ruth Marcus is a columnist and deputy editorial page editor at “The Washington Post,” Ben Domenech is the publisher of “The Federalist, John Heilemann is from Bloomberg Politics and Ed O`Keefe covers politics for “The Washington Post.”\n\nEd, I cut you off last time you were on the broadcast, so I`m starting with you.",
  "New president in five days.",
  "Give us your lay of the landscape.",
  "ED O`KEEFE, “THE WASHINGTON POST”: Well, you know, I think it`s important despite what the vice president-elect said about 30 - out of 50 states and a landslide to remember, if you look at polling that was out this week, only 37 percent of Americans have a favorable opinion of the president-elect.",
  "That is a - at least modern history historic low.",
  "Usually you see a bounce for someone who wins, and he didn`t really ever see one.",
  "The other thing I think that`s important in those numbers, 34 percent believe he`d be a better leader than President Obama, also a pretty poor showing on that regard.",
  "And the one that I keep coming back to, two to one, Americans believe he needs to stop tweeting.",
  "And I think given what we`ve seen this weekend, one wonders if we`ll see that.",
  "There`s certainly suggestions today from the vice president- elect that that won`t happen.",
  "But I think that really, really eats at the craw (ph) of a lot of people who concerned about him becoming president, that he`s not necessarily trying to be the leader of all, he`s trying to perhaps just be the leader of those 30 or 50 states.",
  "DICKERSON: Right.",
  "Ben, what do you make of those numbers for Donald Trump as he comes in?",
  "BEN DOMENECH, “THE FEDERALIST”: I think it really says how much more important this inaugural address is going to be compared to perhaps other ones.",
  "The tone that - that Trump takes, the tone that he really has when he comes and speaks in front of the American people is going to send a message one way or the other.",
  "Is it a unifying tone?",
  "Is it sounding a note of - of optimism about an ability to work across partisan lines, to be a nontraditional president in a way that benefits the American people?",
  "Or does he give them an address that is more, I come not to bring peace but the sword, a message of - of really anti-Washington, anti-elite sentiment that says to the American people, people who voted for him, that he is going to be their champion and return power back to them away from the Washington elite that they so despise.",
  "I think that that decision is really going to have a lot of impact in the early days of his presidency, particularly given that he`s going to be announcing one of his most controversial decisions, or what is likely to be in the first couple of weeks, and that is his Supreme Court nomination, which is likely to put everyone back in their normal trenches when it comes to Democrats and Republicans.",
  "DICKERSON: It -\n\nRUTH MARCUS, “WASHINGTON POST”: I - I -\n\nDICKERSON: Go ahead.",
  "MARCUS: I think Ben is right, a healing and welcoming tone in the inaugural address is necessary, but it`s not sufficient.",
  "On election night, Donald Trump said the right thing.",
  "He said he wanted to bind the wounds of division.",
  "Every - almost everything that he`s done since then has been not binding wounds but exposing them.",
  "And it`s not necessarily that he continues to tweet, because I think we know he`s going to do that.",
  "It`s what he tweets.",
  "And it`s not necessarily what he`ll say in the inaugural address, because I assume he will rise to the occasion, I certainly hope so, but it`s how he behaves afterwards.",
  "And he needs to start behaving like the healer in chief.",
  "DICKERSON: John, your view.",
  "JOHN HEILEMANN, BLOOMBERG POLITICS: Even - even after the contentiousness of the 2000 election, where many people thought that George W. Bush was given the presidency by the Supreme Court, Bush entered office with a 61 percent approval rating, even with all of that division then.",
  "So the approval rating matters a lot.",
  "If he`s going to be a successful president, he needs to reach out and build a broader base.",
  "He did not win the popular vote.",
  "He won very narrowly in the Electoral College.",
  "I think he`s 100 percent legitimate as a president, but there is - that is a - a political challenge he faces.",
  "He also faces another set of challenges, which is that normally the reason you get a honeymoon as president-elect and then as president is that you start with the clean slate.",
  "On the questions of Russia and this election and now these questions that David was just talking about on the show, and on the question of his business conflicts, these are large scale potential scandals or controversies that he brings with him into the office.",
  "There are ethics specialists on Democrat and Republican stripe alike who say that he`s going to be sued the moment that he takes the oath office on the basis of the fact that he is violating the emoluments clause of the Constitution because he hasn`t untangled his business empire.",
  "Those are - whatever you think of them on the merits, huge political challenges for a new president to come in with that much baggage attached to their wagon.",
  "MARCUS: And - and there`s other baggage, John, that isn`t necessarily his doing, but we were reminded of it this week, which is the feeling that many people have out there that FBI Director James Comey unfairly and inappropriately and effectively even whether - whatever his intention was, intervened in the election.",
  "Now we know we`re going to have two continuing investigations -\n\nDICKERSON: Right.",
  "MARCUS: Plus the potential ethics issues.",
  "The look that - essential look into Russia and the inspector general who is going to be looking behind the scenes.",
  "It will take months, possibly a year to look into Comey`s behavior.",
  "DICKERSON: Right.",
  "MARCUS: And what that means is, we have this very fragile and volatile state in our democracy.",
  "A lot of people who don`t have - may not have - may not question Trump`s legitimacy, but question what has gone on here.",
  "DICKERSON: Let me -\n\nMARCUS: And we`re going to keep going.",
  "DICKERSON: Let me ask you this, though, Ben.",
  "Why that`s all going on, there`s going to be a lot of, you know, (INAUDIBLE).",
  "Paul Ryan and Mitch McConnell are just - are going to be passing legislation.",
  "DOMENECH: Yes.",
  "DICKERSON: I mean that`s what I wonder is whether some of this is - well, just give me your sense of that.",
  "I mean there`s another actor in the party here too.",
  "DOMENECH: You know the thing that`s interesting about the mood on Capitol Hill among Republicans rights now is that there - there are a couple of different classes.",
  "There are people who are - who are very optimistic right now that they are going to be able to pass through legislation that they`ve been trying to advance for the past six, eight, ten years, and without success, that they`re going to pass that through Congress and that Donald Trump is going to rubber - rubber stamp it and not really play a significant role in changing it.",
  "That`s the mood certainly among a lot of Republican leaders.",
  "At the same time, there`s a camp of people who I would put in the sort of skeptical camp among the Republicans who feel like they`re going to be able to work with Donald Trump on a handful of issues, but then also have to balance against him on other accounts.",
  "And I think a good example of that is someone like Rand Paul, who has been a out there vocally supporting Donald Trump`s commitment to pass a replacement for Obamacare very soon after repeal, but that`s the kind of aggressive step that Paul and Trump can agree on.",
  "But he is also preparing, along with a lot of the other libertarian leading members of the Congress, to balance against Donald Trump when it comes to all sorts of issues related to civil liberties -\n\nDICKERSON: Right.",
  "DOMENECH: Where they feel like this administration is not going to be as aligned.",
  "DICKERSON: And, Ed, McConnell`s going to need 60 votes in the Senate.",
  "O`KEEFE: He is.",
  "DICKERSON: And - and if we have this kind of conflict that we`ve been talking about, Democrats are going to pay a price for working with Donald Trump.",
  "O`KEEFE: They`re going to pay a price for working with him.",
  "Republicans may pay a price for not getting any Democrats to play along with them.",
  "I would - you know, it`s been two weeks of the new Congress, and say that, you know, on the Senate side there are some genuine attempts at cooperation underway.",
  "I think you saw Joe Manchin earlier talking about the eagerness to do it.",
  "He needs to do it, frankly, if he expects to be reelected.",
  "Heidi Heitkamp, Joe Donnelly, Claire McCaskill, among others, have to think about it as Democrats.",
  "But, you know, I would caution, things up there are pretty - pretty hot right now.",
  "I think the comments made by John Lewis this weekend had as much to do with the presidency as it does with the tinder box nature of the House right now.",
  "If you look at what`s gone on up there kind of under the radar with all the focus on the administration in waiting, you`ve had attempts to undo an ethics office, you`ve had stiff penalties put in place on members who may try to act out on the House floor.",
  "They`re seen as sort of retribution against Democrats.",
  "Amid that you had, you know, a Republican congressman suggest that Mexican performers who were campaigning in Nevada with Democrats were just as much trying to influence the election on behalf of Mexico as the hackers did for Russia.",
  "And then - and then you have this fight over, you know, art hanging on the walls of the Capitol and whether or not some of it was appropriate.",
  "All these little things, you know, add up.",
  "And at some point if there is no check on this, or if there`s no attempt at cooperation, I - you could see some real trouble for Republicans stewardship of Congress.",
  "DICKERSON: John, what do you make of the drive the bus question I was trying to get at, which is Donald Trump has a set of views on Russia, on torture that seems at odds with the people who are going to head his cabinet?",
  "HEILEMANN: Well, I - I agree with David on - on all issues, right, that there - like, on the - not just on - on - on some specific things, I mean across the board in the sense that Donald Trump is driving the bus.",
  "Donald Trump is going to drive the bus.",
  "He drove the bus on his campaign.",
  "He is a bus driver at heart, right?",
  "But the reality is, that some rules of physics are not repealed by Donald Trump being president, and those rules go back years in our - in this city in politics, which is that if you have a secretary of defense and a national security advisor who are at war, it is a problem for your foreign policy.",
  "If you have big divisions between the agencies broadly speaking and the White House staff, it is a problem.",
  "And so especially it`s always a problem, but it`s a particularly potentially large problem for a president of the United States who has never run - has no government experience whatsoever and is dealing with - not in the (INAUDIBLE) that he`s been in the White House, the least experienced staff in this city of any presidency that we`ve ever seen.",
  "DOMENECH: But I think the real issue here is that with all of these different types of folks in this cabinet representing different viewpoints and having a lot of different backgrounds, we`re not going to really know who Donald Trump is listening to on each of these subjects until a moment of crisis.",
  "DICKERSON: Yes.",
  "O`KEEFE: Yes.",
  "HEILEMANN: Right.",
  "DOMENECH: We learned in the early days of the Bush administration that - after the interaction with the - the Chinese spy plane incident, we learned that George W. Bush was listening more to the Colin Powell, Condoleezza Rice school than we might have expected given some of his other choices going in.",
  "We`re going to find out which of these folks he`s named he actually listens to once there`s a moment of crisis.",
  "MARCUS: Or - or - or speaks to, because that was some of the astonishing testimony that we had this week about conversations that weren`t had with the president-elect and his secretary of state nominee about Russia or with the nominee to head Homeland Security about immigration policy.",
  "The bus - he is the bus driver.",
  "Has he spoken to his passengers?",
  "Has he spoken to - or the - the members of his fleet?",
  "And Newt Gingrich used the word “entrepreneurial” about his leadership style.",
  "Another question - word for that that might be less polite might be “incoherent.” We need to -\n\nHEILEMANN: Or “improvisational.”\n\nDICKERSON: Well -\n\nMARCUS: Or both.",
  "HEILEMANN: (INAUDIBLE).",
  "DICKERSON: All right.",
  "Let me - let me - let me dismount from the bus metaphors for a moment.",
  "O`KEEFE: Well -\n\nDICKERSON: Go ahead, if -\n\nO`KEEFE: Well, I want to continue with just one more moment, because we just want to caution that whether he has talked to the passengers is one thing.",
  "Who`s going to actually be on the bus remains an open question.",
  "DICKERSON: Right.",
  "O`KEEFE: We have seen Republicans doubt whether Tillerson can do the job.",
  "And if they hold out this week on him or in the coming weeks, he may not board that bus.",
  "It`s just worth pointing out that there are Republicans that are still concerned about him getting the job.",
  "DICKERSON: Whether he gets confirmed.",
  "HEILEMANN: Right.",
  "DICKERSON: Ben, give me your sense of Obamacare.",
  "Donald Trump really raised the bar this week in his press conference.",
  "He said not only will it be repealed and replaced, he said simultaneously, that was his words, but it will be much better and cost less.",
  "Really?",
  "That`s a big --\n\nDOMENECH: You know, he - he has promised an enormous number of things to the American people and he`s not going to stop apparently now that he`s actually in charge.",
  "This is one of those moments where you do have a situation where legislative realities come smack into, you know, an agenda that - that has been very ambitious really from day one.",
  "But I think that what - what is clear about this Obamacare incident is that Donald Trump is going to be demanding certain things of Republicans in Congress.",
  "He wants them to deliver on these promises.",
  "And they are going to have to work to find ways to both keep his - his sort of statements realistic and can - and with - given what they can do with the level of representation that they have, but also that recognizes the process that has to play out just according to the way that our government works, that this legislation has to be formed and moved through.",
  "HEILEMANN: Given the - given the confusion about what Republicans want as a replacement for Obamacare, if you were going to do a substantially different healthcare reform law, it cannot be done immediately.",
  "It`s not possible.",
  "DOMENECH: Well, but -\n\nHEILEMANN: If repeal and replace happened close to simultaneously, what it will be replaced with is something that is 85 percent Obamacare -\n\nDOMENECH: Well -\n\nHEILEMANN: Rebranded with a few small changes because there`s not - there`s not a full blown thing (INAUDIBLE) this -\n\nDOMENECH: But - but in -\n\nMARCUS: And I -\n\nDOMENECH: But let`s -\n\nMARCUS: I think there are two important things for the president- elect to keep in mind.",
  "He should think about a previous president, the incumbent president`s grandiose promises about, if you like your healthcare you can keep it -\n\nHEILEMANN: Yes.",
  "DOMENECH: Ys.",
  "MARCUS: We`re going to cover everybody.",
  "Nobody`s going to be worse off.",
  "Those are dangerous promises to make.",
  "Also, announcing that you`re going to have an immediate replacement when you have a 60 vote threshold in the Senate, that`s also going to be very hard.",
  "HEILEMANN: And - and doing healthcare reform only with Republican votes.",
  "DICKERSON: Right.",
  "HEILEMANN: The biggest mistake Barack Obama made was doing health care reform with only Democratic votes.",
  "If Donald Trump does it with only Republican votes, it will be the same mistakes.",
  "MARCUS: And that won`t be particularly comfortable.",
  "DICKERSON: All right - all right, unfortunately, physically possible is also us.",
  "We have limitations ourselves.",
  "And we`ll be back in a moment.",
  "(COMMERCIAL BREAK)\n\nDICKERSON: And now some local news.",
  "We hear at FACE THE NATION want to congratulate our senior producer Jill Jackson and her family on last night`s arrival of Claire Suzanne.",
  "Claire, welcome to our FACE THE NATION family.",
  "Until next week, for FACE THE NATION, I`m John Dickerson."
]