[
  "\n\nSome prominent Russians came to Washington to witness Donald Trump’s inauguration last year.",
  "Above is a section where some had ticketed seats in front of the U.S. Capitol.",
  "(Photo by CNN/Photo illustration by The Washington Post)\n\nIn the days before Donald Trump's inauguration, a wealthy Russian pharmaceutical executive named Alexey Repik arrived in Washington, expressing excitement about the new administration.",
  "He posted a photo on Facebook of a clutch of inauguration credentials arranged next to a white \"Make America Great Again\" hat, writing in Russian: \"I believe that President Donald Trump will open a new page in American history.\"",
  "Throughout his trip, Repik had prime access.",
  "He wrote on Facebook that he got close enough to the president-elect at a pre-inaugural event to \"check the handshake strength of Donald Trump.\"",
  "He and his wife, Polina Repik, witnessed Trump's swearing-in from ticketed seats in front of the U.S. Capitol.",
  "And he posed for a photo shoulder-to-shoulder with Mike Pompeo, the president's nominee to head the CIA, although Repik later said he was not aware of Pompeo's intended role at the time.",
  "The attendance of members of Russia's elite at Trump's inauguration was evidence of the high anticipation in Moscow for a thaw in U.S.-Russia relations following a campaign in which Trump stunned U.S. foreign-policy experts by repeatedly praising Russian President Vladi­mir Putin.",
  "As questions about Russia's interference in the 2016 election were beginning to percolate publicly, prominent business leaders and activists from the country attended inaugural festivities, mingling at balls and receptions — at times in proximity to key U.S. political officials.",
  "Their presence caught the attention of counterintelligence officials at the FBI, according to former U.S. officials, although it is not clear which attendees drew U.S. government interest.",
  "FBI officials were concerned at the time because some of the figures had surfaced in the agency's investigation of the Trump campaign's ties to Russia, the officials said.",
  "An FBI spokesman declined to comment on security concerns related to the inauguration.",
  "White House officials did not respond to requests for comment.",
  "The Washington Post identified at least half a dozen politically connected Russians who were in Washington on Inauguration Day — including some whose presence has not been previously reported.",
  "Among them was Viktor Vekselberg, a tycoon who is closely aligned with Putin's government.",
  "Another was Natalia Veselnitskaya , the Russian lawyer whose June 2016 meeting at Trump Tower with Donald Trump Jr. has become a focus of the Russia investigation.",
  "She attended a black-tie inaugural party hosted by the campaign committee of Rep. Dana Rohrabacher (R-Calif.), according to an associate who accompanied her.",
  "Other Russian inaugural guests included Boris Titov, a politician and business advocate who is running for president of Russia with the Kremlin's blessing.",
  "Like other VIPs in town that weekend, many flocked to the lobby of the Trump International Hotel, where some encountered fellow Russian associates with surprise.",
  "\"It was a great, amazing experience,\" Alexey Repik recalled in one of several interviews with The Post.",
  "Repik said he also was in Washington for President Barack Obama's 2013 inauguration but did not attend any events that year.",
  "Michael McFaul, who served as ambassador to Russia under Obama, said he did not recall prominent Russian visitors at Obama's 2009 events.",
  "\"It's strange,\" McFaul, the director of the Freeman Spogli Institute for International Studies at Stanford, said of the number of influential Russians in attendance last year.",
  "Some Russian guests at Trump's inauguration said they got tickets through U.S. political contacts.",
  "One venue for credentials was the Presidential Inaugural Committee, which provided a slew of perks — such as tickets to events with Cabinet appointees, congressional leaders, the vice president-elect and Trump — to donors who gave at least $25,000.",
  "Russian pharmaceutical executive Alexey Repik and his wife, Polina Repik, enjoyed high-level access during Trump’s inauguration, including ticketed seats for his swearing-in.",
  "(Photo by CNN/Photo illustration by The Washington Post)\n\nInaugural organizers said that the committee kept proper records of contributors but that it was impossible to track who ultimately used all of the tens of thousands of tickets that went to donors.",
  "In a statement, the committee said that it followed Secret Service protocol and that all attendees received required physical screening at checkpoints when they arrived at events.",
  "\"The Presidential Inaugural Committee for President Trump, administratively speaking, was conducted in similar, if not identical fashion to previous inaugurations,\" the committee said.",
  "However, Steve Kerrigan, who served as chief of staff to Obama's 2009 inaugural committee and as president of the committee in 2013, said donors then were required to submit lists of their guests for any gathering the president or vice president or their families were scheduled to attend, with the exception of large outdoor events.",
  "Secret Service spokeswoman Catherine Milhoan said the agency followed all of its normal security procedures at the 2017 inauguration.",
  "She declined to elaborate.",
  "The service often requires that the names of guests be submitted ahead of time for events at which attendees will have close access to the president.",
  "On other occasions, when the president or president-elect makes a brief stop at an event and stays largely behind a rope line — as Trump did at a pre-inaugural Library of Congress reception Repik attended — the agency instead relies on physically screening most guests, according to people familiar with the security procedures.",
  "Awaiting a 'new stage' in U.S.-Russia relations\n\nTrump's inauguration was celebrated jubilantly in Moscow, where Putin supporter Konstantin Rykov hosted an all-night party.",
  "Champagne flowed as an interpreter narrated the new U.S. president's speech.",
  "In Washington, the Russian Embassy tweeted, \"Happy #InaugurationDay2017!\"",
  "with a photo of people gathered in front of the Lincoln Memorial.",
  "The optimism was part of a larger embrace by Russia of Trump's \"America First\" outlook, which emphasizes U.S. business interests and national security over promoting freedom and democracy abroad, said Ilya Zaslavskiy, a researcher who has worked with the Hudson Institute's Kleptocracy Initiative.",
  "Amid a busy schedule in Washington, Titov — who was appointed by Putin to serve as a business ombudsman — told a Russian television station that new investment was likely to flow to Russia once U.S. sanctions were lifted.",
  "Businesses \"are waiting for this signal, and they believe it will soon come,\" he said.",
  "A year later, the sanctions are still in place, and the thrill of Trump's election has faded amid an intensifying federal investigation of possible coordination between Russia and the Trump campaign.",
  "\"We hoped that a lot of things would change, that the relations would be built on equal terms, that we would be able to start a new stage in the relations between countries,\" Titov said in an interview.",
  "\"But unfortunately, this is not happening.\"",
  "Titov, like several of the Russian elites who attended Trump's inauguration, declined to say how he obtained his tickets, only that they came \"via our friends — entrepreneurs in the Republican Party.\"",
  "While in Washington, he attended several receptions and met with U.S. lawmakers and business leaders, including a staff member at the U.S. Chamber of Commerce, Titov said.",
  "A Chamber spokeswoman said the organization \"routinely meets with individuals representing the business community from countries around the world.\"",
  "Titov said he also went to a ball, adding: \"I don't remember what it was called.",
  "People danced.",
  "Trump danced.\"",
  "Vekselberg heads of one of Russia's most powerful conglomerates, the Renova Group, which has investments in energy, telecom and mining.",
  "He attended Trump's inauguration as a guest of \"one of his closest American business partners,\" said spokesman Andrey Shtorkh, who declined to name Vekselberg's host.",
  "Shtorkh said that Vekselberg had met the past three U.S. presidents as part of his efforts to expand Russia's international economic relations but that this was the first time the magnate attended a presidential inauguration.",
  "Vekselberg regularly participates in gatherings of Russian business leaders with Putin and sometimes meets one on one with the Russian president, according to news accounts and people familiar with his role.",
  "In March, the two sat down to discuss infrastructure projects, according to Russian state news reports.",
  "Vekselberg funds several critically important Russian prestige projects, including Skolkovo, the business incubator touted as Russia's answer to Silicon Valley.",
  "Two of Vekselberg's U.S. business associates donated significant sums to the inaugural committee, federal filings show.",
  "Andrew Intrater, a New York businessman who is president of the U.S. affiliate of Vekselberg's company, gave $250,000.",
  "Intrater did not respond to requests for comment.",
  "Access Industries, a company founded by Leonard Blavatnik — a Soviet-born American British billionaire who is a longtime friend and business associate of Vekselberg — contributed $1 million to the committee.",
  "Blavatnik, through a spokesman, declined to comment.",
  "Another Russian American who has had business dealings in Russia, IMG Artists chief executive Alexander Shustorovich, also gave $1 million, records show.",
  "IMG Artists' chief operating officer, John Evans, said Shustorovich, a U.S. citizen who immigrated to the country as a child, attended the inauguration with his parents.",
  "Evans said Shustorovich was a longtime Republican supporter who also attended the presidential inaugurations of George W. Bush.",
  "Some of the Russian attendees at inaugural events already had interacted with people in Trump's orbit during the 2016 campaign.",
  "Among them: Maria Butina, a Russian gun rights activist and assistant to Alexander Torshin, a former Russian senator who had brokered ties with top National Rifle Association officials.",
  "[Guns and religion: How American conservatives grew closer to Putin’s Russia]\n\nMore than a year before Trump's victory, Butina had found her way to a microphone at a July 2015 town hall meeting to ask candidate Trump how he would approach Russia if elected.",
  "\"I know Putin, and I'll tell you what, we get along with Putin,\" Trump responded.",
  "(Trump later said that he had not met Putin before his election but told voters that he was confident they would get along.)",
  "Butina was also part of a group that unsuccessfully sought a meeting with the campaign in May 2016 to discuss the persecution of Christians around the world, according to an American involved in the effort.",
  "During Trump's inauguration, Butina made an appearance at one of the balls, according to a person familiar with her attendance.",
  "She did not respond to requests for comment.",
  "The Russian lawyer, Veselnitskaya, had met Trump's eldest son, Donald Trump Jr., his son-in-law, Jared Kushner, and his campaign chairman, Paul Manafort, during a private June 2016 meeting at Trump Tower in New York.",
  "Trump Jr. had agreed to the gathering after he was told Veselnitskaya would provide damaging information about Democratic candidate Hillary Clinton as part of a Russian effort to assist his father's campaign.",
  "Joining Veselnitskaya at the meeting was Rinat Akhmetshin, a Russian American lobbyist and Soviet army veteran.",
  "Seven months later, they were together again in Washington at an inauguration night black-tie party at the Library of Congress sponsored by the campaign committee of Rohrabacher, a GOP congressman who has long advocated that the United States have a better relationship with Putin's Russia.",
  "In a photo from the event posted by the campaign committee, Veselnitskaya and Akhmetshin pose with slight smiles, holding wine glasses.",
  "In a statement, Veselnitskaya told The Post that she attended a private event in Washington that night at Akhmetshin's invitation.",
  "She added that she did not go to the inauguration and was in the area because she was meeting the next day with an American woman frustrated by the Russian ban on adoptions by U.S. citizens.",
  "Michael Tremonte, a lawyer for Akhmetshin, said his client recalls that he was given tickets by a person involved in organizing the event and that he invited Veselnitskaya to join him because he knew she was in town.",
  "Tremonte said Akhmetshin did not attend any official inaugural events.",
  "Kenneth Grubbs, a spokesman for Rohrabacher's congressional office, said the campaign has no record of Akhmetshin's invitation to the party or of tickets purchased by him or Veselnitskaya.",
  "Russian American lobbyist Rinat Akhmetshin and Russian lawyer Natalia Veselnitskaya, who both attended a meeting with Donald Trump Jr. and other Trump aides during the presidential campaign, went to an inaugural party in Washington hosted by U.S. Rep. Dana Rohrabacher (R-Calif.).",
  "(Rohrabacher for Congress/Rohrabacher for Congress)\n\n'It was a once-in-a-lifetime experience'\n\nRepik began his weekend in Washington by posting a photo of himself wearing official credentials in front a stage bearing a sign that declared \"The Inauguration of Donald J.",
  "Trump.\"",
  "In interviews with The Post, Repik said he and his wife obtained their tickets through an American technology executive named Timothy Kasbe, who at the time was working for the Russia-based retailer Gloria Jeans.",
  "Kasbe, who now works for a company in New Zealand, donated $150,000 to Trump's inaugural committee, records show.",
  "Repik said they had met months earlier during a tour of Silicon Valley companies for Russian business executives that Kasbe helped host on behalf of a headhunting firm.",
  "The two became friendly and agreed to meet in Washington for the Trump festivities.",
  "In a statement, Kasbe confirmed that he celebrated the inauguration with Repik and his wife, whom he called \"family friends from California.\"",
  "Repik, whose family often stays in a home in a posh San Francisco neighborhood, founded the large Russian pharmaceutical company R-Pharm, which has contracts with numerous Russian hospitals, including state-owned facilities.",
  "Repik also heads an advocacy group called Business Russia, as well as another business council that encourages economic ties between Russia and Japan.",
  "In those roles, Repik said, he has met several times with Putin at public events to discuss the business climate and foreign relations.",
  "They had a one-on-one meeting publicized by the Kremlin in June 2016 and met again when Putin made an appearance at an October 2016 conference hosted by Repik's advocacy group.",
  "In 2011, the Russian business publication Vedomosti asked Repik about rumors that he had ties to the FSB, the Russian intelligence service that succeeded the KGB.",
  "Repik replied, \"It's nice to feel like a simpleton who has the FSB behind him.\"",
  "Repik told The Post that such comments were \"jokes\" and that he has \"zero\" relationship with Russia's security and intelligence services.",
  "Before Trump's inauguration, Repik established a business tie with Texas venture capitalist Darren Blanton, who served as an informal adviser to the Trump transition team.",
  "[The mystery behind a Flynn associate’s quiet work for the Trump campaign]\n\nIn the fall of 2016, a venture fund backed by Repik's R-Pharm and the Russian government negotiated to become a large investor in a California biotechnology start-up called Bonti, a deal that closed Jan. 4, 2017, according to corporate filings and people familiar with the investment.",
  "Colt Ventures, an investment company founded by Blanton, also invested in Bonti, filings show.",
  "At some point, Blanton and Repik met in San Francisco with other investors to discuss the company, Repik said.",
  "Repik said the Texas investor was also among the people he ran into at the Trump hotel in Washington, where he and his wife stayed for the inauguration.",
  "Blanton did not respond to requests for comment.",
  "Polina Repik, a former model with a sizable social media following, recorded the exclusive access she and her husband had during the inauguration, posting videos about the trip on her YouTube channel.",
  "\"I'm really far from politics,\" she said in an interview.",
  "\"It was a once-in-a-lifetime experience.\"",
  "At the inaugural parade, the couple were perched in a grandstand just next to the one reserved for Trump and his family.",
  "They danced the night away at the Liberty Ball, where Polina Repik filmed a chance encounter with Caitlyn Jenner.",
  "Polina Repik also toured The Washington Post's newsroom with Kasbe, who arranged the visit through a former colleague who is a Post executive.",
  "A video from the tour that Polina Repik posted on YouTube features footage of the newsroom.",
  "The Post public-relations manager who led the tour said that visitors are generally not allowed to film throughout the newsroom and that she did not recall seeing any filming.",
  "In an interview, Polina Repik said that she was not trying to film surreptitiously and that she was sorry if she broke any rules.",
  "Alexey Repik also documented his up-close access at inaugural events, posting photos on Facebook of the president-elect, son Eric Trump, incoming vice president Mike Pence and incoming Trump chief of staff Reince Priebus.",
  "At one event, Repik told The Post, he met incoming secretary of state Rex Tillerson and encountered Pompeo, whom he described on Facebook as \"a good neighbor at the table [who] turned out to be a very charming person.\"",
  "Repik said he was actually seated at a table nearby and was not aware at the time of Pompeo's role as the soon-to-be CIA director.",
  "Repik added that he had not met Pompeo before that event or seen him since.",
  "In a statement, a CIA spokesman said that Pompeo \"does not know this individual or recall meeting him,\" adding that \"people frequently ask public figures, like Mr. Pompeo, for photographs, and efforts to cast the photo as anything else are ridiculous.\"",
  "Repik said it wasn't politics that drew him to Washington but the prospect of fostering better business relations between Russia and the United States.",
  "\"To me, it's pretty clear that we can do better together,\" he said.",
  "\"I don't care about the political.",
  "But I'm very concerned about the business part of this.\"",
  "Elizabeth Dwoskin in San Francisco; Natalya Abbakumova and David Filipov in Moscow; and Devlin Barrett, Alice Crites, Tom Hamburger, Shane Harris, Ellen Nakashima, T.J. Ortenzi, Julie Tate and Julie Vitkovskaya in Washington contributed to this report."
]