[
  "Sally Yates, the former acting attorney general fired by President Donald Trump in January, testified in front of the Senate Judiciary Committee today, recounting a timeline of her warnings about former national security adviser Mike Flynn to the Trump administration.",
  "Interested in Trump Administration?",
  "Add Trump Administration as an interest to stay up to date on the latest Trump Administration news, video, and analysis from ABC News.",
  "Add Interest\n\nYates said she conveyed her concerns about Flynn to White House Counsel Don McGahn over the course of two in-person meetings at the White House.",
  "Here’s a timeline of Yates and McGahn’s meetings and what they discussed, according to Yates’ testimony today:\n\nJan. 24, 2017\n\nLt. Gen. Mike Flynn was interviewed at the White House by the FBI.",
  "During their first in-person meeting, Yates told McGahn, Trump’s top legal adviser, about Flynn’s interview with the FBI.",
  "Jan. 25, 2017\n\nThe Department of Justice received a detailed readout from the FBI agents who had interviewed Flynn.",
  "Yates said she felt “it was important to get this information to the White House as quickly as possible.”\n\nJan. 26, 2017\n\nYates called McGahn first thing that morning to tell him she had “a very sensitive matter\" that had to be discussed face to face.",
  "McGahn agreed to meet with Yates later that afternoon.",
  "Later that day, Yates traveled to the White House along with a senior member of the DOJ’s National Security Division, who was overseeing the matter.",
  "It was Yates’ first meeting with McGahn in his office, which also acts as a sensitive compartmented information facility (SCIF).",
  "Yates said she began their meeting by laying out the press accounts and statements made by Vice President Mike Pence and other high-ranking White House officials about Flynn’s conduct “that we knew not to be the truth.”\n\nShe told McGahn how the DOJ acquired that information and walked through Flynn’s conduct \"in a fair amount of detail.”\n\nShe explained to McGahn the reasons why the DOJ was informing the White House of this -- Flynn’s conduct was “problematic in and of itself,” they believed Pence was entitled to know the information about Flynn he was spreading “wasn’t true,” and that the American people had been misled about Flynn’s actions.",
  "Yates stressed that one of the reasons why the DOJ decided to notify McGahn was because the Russians were aware of Flynn’s conduct, including that Flynn had misled Pence and that she had not accused Pence of “knowingly providing false information to the American people.”\n\n“This was a problem because not only did we believe that the Russians knew this, but that they likely had proof of this information,” Yates said during her testimony today.",
  "“And that created a compromise situation, a situation where the national security adviser essentially could be blackmailed by the Russians.”\n\nYates and the DOJ official presented all the information to McGahn so the White House could take action that they deemed appropriate.",
  "When asked by McGahn if Flynn should be fired, Yates answered, \"that really wasn’t our call.\"",
  "Yates explained today that the DOJ felt it was matter of urgency that they inform the White House.",
  "She stated bluntly in front of the Senate Judiciary Committee: “We felt like it was critical that we get this information to the White House in part because the vice president was unknowingly making false statements to the public and because we believed that General Flynn was compromised with respect to the Russians.”\n\nShe said they had explored whether the decision to inform the White House “might impact that ongoing investigation” being conducted by the FBI, but that once Flynn had been interviewed, their concerns were mitigated.",
  "And each time that White House officials repeated misrepresentations of Flynn’s actions, Yates argued it “increased the compromise.”\n\n“To state the obvious, you don’t want your national security adviser compromised with the Russians,” Yates told the committee.",
  "Yates also said her decision to notify the White House counsel had been discussed “at great length.”\n\n“Certainly leading up to our notification on the 26th, it was a topic of a whole lot of discussion in DOJ and with other members of the intel community,” Yates said today during her testimony.",
  "According to White House press secretary Sean Spicer, McGahn briefed Trump immediately following his meeting with Yates.",
  "Yates told the committee today that McGahn never mentioned to her that he briefed the president; instead she found out through media reports.",
  "Jan. 27, 2017\n\nYates’ second in-person meeting with McGahn happened the next day.",
  "McGahn called Yates in the morning and asked if she could come back to his office, and she returned that afternoon.",
  "One of the topics discussed was whether Flynn could be prosecuted for his conduct.",
  "One of the questions McGahn asked Flynn was, “Why does it matter to DOJ if one White House official lies to another?” She explained that it “was a whole lot more than that,” and reviewed the same concerns they had outlined on Jan. 26.",
  "McGahn expressed his concern that taking action might interfere with the FBI investigation of Flynn, and Yates said it wouldn’t.",
  "“It wouldn’t really be fair of us to tell you this and then expect you to sit on your hands,” Yates had told McGahn.",
  "McGahn asked if he could look at the underlying evidence of Flynn’s conduct, and she said they would work with the FBI over the weekend and “get back with him on Monday morning.”\n\nJan. 30, 2017\n\nYates called McGahn “first thing Monday morning” to tell him he would be allowed to “come over and review the underlying evidence.”\n\nShe didn’t hear back from him until that afternoon.",
  "However, she said she doesn’t know whether McGahn or anyone from his office came to look at the material “because that was my last day with DOJ.”\n\nYates left her post with the DOJ that day because Trump fired her after she ordered the Justice Department not to defend Trump’s Jan. 27 executive order.",
  "Yates thought Trump’s executive order that temporarily banned immigration from seven countries with predominantly Muslim populations and barred refugees from entering the U.S. was unlawful.",
  "Feb. 9, 2017\n\nPence first heard that Flynn misled him about his contact with Russian Ambassador to the U.S. Sergey Kislyak, according to White House officials, two full weeks after Yates first met with McGahn.",
  "Feb. 13, 2017\n\nEighteen days after Yates raised the concern about Flynn to the White House, Flynn resigned from his post as national security adviser, pushed out by Trump.",
  "When asked whether Flynn might have been compromised during the 18-day period he remained national security advisor, Yates said she doesn’t have an answer for that, but that she was “really concerned about the compromise here.”\n\n“That was the reason why we were encouraging them to act,” Yates said.",
  "“I don’t know what steps they may have taken, if any, during that 18 days to minimize any risk.”\n\nABC News' Mike Levine contributed to this report."
]