[
  "Ukrainian lawmaker Andrey Artemenko during an interview with Reuters at his office in Kiev, Ukraine, on Tuesday.",
  "REUTERS/Valentyn Ogirenko The Ukrainian lawmaker who met with President Donald Trump's personal lawyer, Michael Cohen, and the businessman Felix Sater in New York last month to discuss a controversial peace plan for Ukraine \"got confirmation\" from Sater that his plan was delivered to the White House, he told Business Insider.",
  "Andrey Artemenko, a member of Ukraine's parliament who used to be part of the country's far-right Radical Party, said he met with Cohen and Sater at the Loews Regency New York on January 27 to discuss Artemenko's proposal for solving the Russia-Ukraine conflict.",
  "The meeting was organized by Sater, who knew Cohen through his work with the Trump Organization and was introduced to Artemenko by a mutual friend named Yan Aronov, Artemenko said.",
  "(Aronov did not respond to a request for comment.)",
  "The plan they discussed involved lifting sanctions on Russia and allowing Moscow to lease Crimea for either 50 or 100 years, he said.",
  "In return, Russia would have to withdraw its support for separatists in eastern Ukraine.",
  "Controversy erupted earlier this month after The New York Times reported that Cohen said he had \"hand-delivered\" the plan in a sealed envelope to Michael Flynn before Flynn was forced to resign as national security adviser over a separate Russia-related firestorm.",
  "Cohen's initial account largely aligned with what Artemenko and Sater said Cohen told them he would do after their meeting.",
  "But Cohen quickly walked back his initial story, telling The Washington Post hours after the Times story was published that he hadn't delivered the plan to Flynn or discussed it with anyone in the White House.",
  "The White House has said it has \"no record\" of receiving the document.",
  "Stephanie Keith/Reuters Both Artemenko and Sater have disputed Cohen's revised account, however.",
  "Artemenko told Business Insider, and Sater has told The Post and CNN, that Cohen explicitly said he would show the plan to Flynn.",
  "The Times has stood by its reporting.",
  "\"Mr. Cohen told The Times in no uncertain terms that he delivered the Ukraine proposal to Michael Flynn's office at the White House,\" The Times' deputy managing editor Matthew Purdy said.",
  "\"Mr. Sater told The Times that Mr. Cohen had told him the same thing.\"",
  "Artemenko's assertion that Cohen followed through on delivering the plan to Flynn could not be independently confirmed by Business Insider.",
  "Cohen said in a text message Sunday that Artemenko's version of events was untrue.",
  "\"Untrue.",
  "No one could confirm said delivery as it never occurred,\" Cohen said.",
  "Sater did not return multiple requests for comment.",
  "Whereas Artemenko's and Sater's stories have been largely consistent, however, Cohen appears to have altered his account at least three times since speaking with The Times and The Post.",
  "In a series of text messages to Business Insider last week, Cohen denied \"even knowing what the plan is.\"",
  "But he acknowledged in a later text that he met with Artemenko in New York for \"under 10 minutes\" to discuss a plan Artemenko said \"was acknowledged by Russian authorities that would create world peace.\"",
  "Cohen continued to deny that he delivered the plan to Flynn, but he then appeared to shift his story again in an interview with NBC News.",
  "Even if he had taken an envelope with a peace plan to the White House, he said: \"So what?",
  "What's wrong with that?\"",
  "Finally, Cohen told CNN last week that he had dinner with Artemenko but that Ukraine was not discussed.",
  "'People like my idea'\n\nArtemenko, for his part, was expelled from Ukraine's Radical Party and has been accused of treason by Ukrainian prosecutors for meeting with Cohen and Sater last month.",
  "But he insisted in an interview with Business Insider that he did nothing wrong.",
  "\"I'm a member of parliament,\" Artemenko said.",
  "\"It's my obligation and duty according to Ukrainian law\" to try to find a solution to the war.",
  "\"This is my motherland, I was born here, and I've realized that we cannot fight against Russia alone until the last Ukrainian soldier has died,\" he added.",
  "\"And they accuse me of treason!",
  "Nonsense!",
  "I have a right to have my personal opinion in a democratic and free country.\"",
  "Artemenko said he modeled his plan to lease Crimea to Russia off China's lease of Hong Kong to Britain for 99 years in 1898 and the US's contentious \"lease\" of the Panama Canal from Colombia in 1903.",
  "In court filings, however, Ukrainian prosecutors said Artemenko's proposal was an attempt to \"legitimize the temporary occupation\" of Crimea by Russia, which forcibly annexed the peninsula in 2014.",
  "Ukrainian President Petro Poroshenko at a news conference following a EU-Ukraine summit in Brussels on November 24.",
  "Reuters/Francois Lenoir\n\nThe prosecutors also accused Artemenko of conspiring with Moscow to commit \"subversive acts against Ukraine.\"",
  "But it is unclear what role, if any, Russia played in bolstering the plan.",
  "The New York Times said Artemenko told them he had \"received encouragement for his plans from top aides to Mr.",
  "Putin.\"",
  "He told Business Insider, however, that he had never spoken with any Russian officials about his ideas.",
  "Russia has also denied approving of, or even having any knowledge of, the proposal.",
  "Reached for comment, the Times' Scott Shane said \"We reported what Mr. Artemenko told us.\"",
  "\"Greed, envy, and pride — it is their main defects,\" Artemenko said, referring to the Ukrainian government.",
  "He said he thought the government felt threatened by him \"because I'm alone and I have my own foreign allies, contacts, and supporters.\"",
  "When asked if he was still trying to get his vision heard by the US, Artemenko replied \"Yes.\"",
  "\"I got thousands of phone calls and emails from people all over Ukraine supporting me!\"",
  "Artmenko said.",
  "\"People like my idea.\"",
  "But some Ukrainians have characterized Artemenko as a relatively marginal, if not virtually unknown, player, whose \"peace\" plan was probably not his own creation but that of Ukraine's pro-Russia Opposition Bloc formed after former President Viktor Yanukovych was ousted in 2014.",
  "\"None of us had heard much about [Artemenko],\" Natalia Gumenyuk, the head of the Ukrainian news outlet Hromadske.tv, told The Atlantic last week.",
  "Gumenyuk described him as \"a really obscure member of parliament from a shady political party.\"",
  "\"It's interesting that it's this kind of person who got in touch with someone\" in the US, she added.",
  "The January 27 rendezvous was not the first time Artemenko, a self-proclaimed Trump supporter, made contact with the president's allies.",
  "Artemenko met with Trump's campaign last year and offered to organize a meeting between Trump and Ukraine's ambassador to the US, Valeriy Chaly.",
  "But Chaly ultimately refused to meet with Trump's team, Artemenko said, because the Ukrainian government was backing Democratic nominee Hillary Clinton at the time.",
  "Strana.ua, a Ukrainian news site, recently reported that Artemenko told them in an interview that he began discussing his peace plan with Cohen and Sater last year, \"at the time of the primaries, when no one believed that Trump would even be nominated.\"",
  "Artemenko confirmed to Business Insider that Strana had interviewed him but denied telling it he had met with Cohen in 2016.",
  "Cohen also denied ever meeting with Artemenko before this year.",
  "Sater did not respond to requests for comment.",
  "In any case, Chaly, the Ukrainian ambassador, told The Times last week that Artemenko's proposal to lease Crimea to Russia constituted \"a gross violation of the Constitution.\"",
  "\"Such ideas can be pitched or pushed through only by those openly or covertly representing Russian interests,\" he said."
]