[
  "Sen. Lindsey Graham, R-S.C. (Photo: Evan Vucci, AP)\n\nPresident Trump may want to \"move on\" from Russia's attempted interference in last fall's presidential election, but two senators announced Thursday that they are launching a bipartisan investigation of Russia's efforts to influence the U.S. election and democratic elections in other nations.",
  "Sens.",
  "Lindsey Graham, R-S.C., and Sheldon Whitehouse, D-R.I., said the Senate Judiciary Subcommittee on Crime and Terrorism, which they lead, will hold both closed-door and public discussions as they look into Russia's meddling.",
  "\"Our goal is simple — to the fullest extent possible we want to shine a light on Russian activities to undermine democracy,\" the two senators said in a joint statement.",
  "\"Our efforts will be guided by the belief that we have an obligation to follow the facts wherever they may lead.\"",
  "The U.S. intelligence community last year concluded that Russia tried to interfere in America's election in order to help Trump and hurt Democrat Hillary Clinton.",
  "They said there was no evidence that Russia's efforts affected the actual vote count.",
  "Russian hackers stole emails from both the Democratic National Committee and Clinton's campaign during the election.",
  "Democrats were embarrassed during the election season by internal emails that were posted by WikiLeaks.",
  "When the Obama administration responded by imposing sanctions against Russia late last year, Trump declared “it’s time for our country to move on to bigger and better things.\"",
  "On Thursday, the Trump administration eased some of Obama's economic sanctions on Russia, allowing some sales of cybersecurity technology to the Russian Federal Security Service, which was at the center of charges of meddling in the U.S. electoral process.",
  "The administration described the change as a routine tweaking of a complicated sanctions regime.",
  "Graham and Whitehouse said their goals include: gaining a full understanding of Russia's role in the U.S. election; learning more about the methods Russia has used to target other democratic nations; looking at ways to prevent any future interference; and ensuring that Congress gives the FBI the tools it needs to keep its investigative work \"protected from political influence.\"",
  "Graham has been at odds with Trump over Russia, with the senator calling for greater sanctions against the Kremlin.",
  "Several other congressional committees, including both the House and Senate Intelligence committees, are also investigating Russia's attempt to influence the American election.",
  "Read more:\n\nRead or Share this story: http://usat.ly/2k5XZnp"
]