[
  "For weeks, Republicans rejected suggestions that Mr.",
  "Sessions could not be trusted on civil rights, arguing that he had been tarnished unfairly over accusations of racial insensitivity that have dogged him since the 1980s.",
  "“Everybody in this body knows Senator Sessions well, knows that he is a man of integrity, a man of principle,” Senator Dan Sullivan, Republican of Alaska, said during the debate on Wednesday afternoon.",
  "The “twisting” of Mr. Sessions’s record offended him, he said, even as Democrats continued their attacks on the nominee.",
  "As the 84th attorney general, Mr.",
  "Sessions brings a sharply conservative bent to the Justice Department and its 113,000 employees.",
  "A former prosecutor, he promises a focus aligned with Mr. Trump in pushing a “law and order” agenda that includes tougher enforcement of laws on immigration, drugs and gun trafficking.",
  "Civil rights advocates worry, however, that he will reverse steps taken by the Obama administration in the last eight years to bring more accountability to police departments, state and local governments, and employers.",
  "Advocates point to his history of votes against various civil rights measures, as well as the accusations of racial insensitivity.",
  "Senator Patty Murray, a Washington Democrat, said on Wednesday that on civil rights, immigration, abortion, criminal sentencing guidelines and a range of other issues, Mr.",
  "Sessions had been far outside the mainstream and had pushed “extreme policies” often targeting minorities.",
  "That criticism peaked with Tuesday night’s rebuke of Ms. Warren, based on an arcane Senate rule that prevents members from impugning the character of a fellow senator, as she read the letter from Mrs. King, the widow of the Rev.",
  "Dr. Martin Luther King Jr. Mrs. King wrote the letter in response to Mr. Sessions’s 1986 nomination for a federal judgeship, for which he was ultimately rejected in part because of accusations that he had been insensitive to minorities as a prosecutor.",
  "Senator Mitch McConnell of Kentucky, the Republican majority leader, led the objection against Ms. Warren.",
  "His explanation afterward — “She was warned.",
  "She was given an explanation.",
  "Nevertheless, she persisted” — instantly became a liberal rallying cry, re-establishing Ms. Warren as a leading voice of Democratic resistance to Mr. Trump."
]