[
  "Michael Flynn, President Donald Trump's former national security adviser, did not reveal payments he received from three Russia-connected entities on a financial disclosure form he filed upon joining the Trump administration.",
  "Flynn ultimately filed two financial disclosure forms, one Feb. 11 and one on Friday.",
  "On the first form, filed days before Trump asked Flynn to resign as national security adviser for misleading Vice President Mike Pence about a conversation Flynn had with the Russian ambassador to the U.S., the retired Army lieutenant general omitted payments he received for three speeches to Russian companies.",
  "One of the companies was RT, a media outlet funded by the Russian government.",
  "Documents released by a congressional committee show that Flynn was paid $45,000 for that appearance.",
  "The other two companies were the Volga-Dnepr Group, a Russian air-cargo company; and Kaspersky Government Security Solutions, a U.S. subsidiary of a leading Russian cybersecurity firm.",
  "Flynn's lawyer Robert Kelner told the Associated Press the first filing included the speaking fees in bulk.",
  "He also noted that the initial filing was a draft and was not followed by consultations with federal ethics officials because Flynn left the administration just days after turning it in.",
  "In addition to the speeches, Flynn earned more than $1.3 million for work for technology firms, political groups and government contractors as well as lobbying for a firm owned by a Turkish businessman.",
  "Flynn's recent financial history, made available Saturday by the White House, comes amid his effort to win immunity from congressional probers in exchange for his cooperation with official inquiries into contacts between Russia and Trump's campaign in 2016.",
  "The disclosures detail Flynn's business and financial activities dating back to 2014.",
  "The filing includes the activities of Flynn Intel Group Inc., a consulting firm that he and partners set up in 2015.",
  "The company filed as a foreign agent last month with the Justice Department, acknowledging that its lobbying work last year likely benefited the government of Turkey even as Flynn was advising Trump's campaign.",
  "Flynn's ties to Russia have been scrutinized by the FBI and are under investigation by the House and Senate intelligence committees.",
  "Both committees are looking into Russia's meddling in the 2016 presidential election and any ties between Trump associates and the Kremlin.",
  "Kelner said that Flynn's first filing normally would have been revised through a consultation between the White House counsel's office and the U.S. Office of Government Ethics.",
  "\"Because he resigned, that usual consultation process was suspended.",
  "When the White House contacted him this week, and asked him to complete the process, he did so,\" Kelner said, noting the second filing is the finalized version.",
  "An OGE document obtained under a Freedom of Information Act request by The Associated Press showed that there were no written communications between the agency and Flynn's lawyers about his financial disclosure and ethics agreement between the November election and March 17.",
  "The White House on Friday released scores of disclosures from Trump administration officials.",
  "Flynn declared last month in a filing with the Justice Department that his company's lobbying for a Dutch-based firm owned by a Turkish businessman \"could be construed to have principally benefited the Republic of Turkey.\"",
  "Flynn's client, Ekim Alptekin, told the AP that the decision to file as a foreign agent had come under pressure from Justice Department officials.",
  "The Daily Caller reported Friday that Justice Department officials contacted Flynn on Nov. 30.",
  "A document obtained by the media site under the Freedom of Information Act quoted Justice Department concern about a pre-election op-ed that Flynn authored stressing Turkish government aims and \"potential ties between Lt. Gen. Flynn and others who might be acting on behalf of the government of Turkey.\"",
  "Flynn reported that he served as a consultant for the FBI and received more than $5,000 in compensation from the bureau.",
  "Kelner said the FBI compensation was for a speaking event in 2015 and training Flynn provided to the bureau.",
  "Flynn reported between $750,000 and $1.5 million in mortgage debt related to his personal home and a rental property.",
  "He also had a line of credit between $15,000 and $50,000, the filing shows.",
  "In a separate filing to the Justice Department last month, Flynn and his business, Flynn Intel Group Inc., detailed $530,000 worth of lobbying work for Inovo BV, the Turkish firm owned by Alptekin.",
  "On his new disclosure, Flynn said only that he personally earned compensation in excess of $5,000 from Inovo BV.",
  "As part of his firm's lobbying, Alptekin invited Flynn last September to meet at a New York hotel with a group that included Turkey's foreign minister Mevlut Cavusoglu and energy minister Berat Albayrak, son-in-law of Turkey's President Recep Tayyip Erdogan.",
  "Another participant, former CIA director James Woolsey, said the group discussed a plan for the covert removal of a political foe of Erdogan's, a Muslim cleric based in Pennsylvania.",
  "Flynn acknowledged he attended the meeting, but a Flynn spokesman said Woolsey's claim was false and that \"no such discussion occurred.\"",
  "Flynn's new disclosure also details a $10,000 payment for a speech in New York last October paid by Ibrahim Kurtulus, a New York financial adviser who is also listed as an advisory board member for the Turkish American National Steering Committee.",
  "The group's website says it aims to \"promote and amplify a unified Turkish American voice on issues that affect the Turkish American community and Unites States.\"",
  "But Kelner said Saturday that the speech paid by Kurtulus was made to an audience of Korean-Americans.",
  "Kurtulus did not immediately reply to phone calls by the AP to several numbers associated with him in New York.",
  "The new disclosure also details several Flynn speeches for conservative groups and think tanks.",
  "Flynn was paid $15,000 for a speech to the David Horowitz Freedom Center, a Los Angeles group headed by a longtime conservative activist.",
  "Flynn was also paid $10,000 for a speech to the National Center for Policy Analysis, a nonprofit think tank promoting libertarian ideals.",
  "The Associated Press contributed to this report.",
  "Click for more from the Wall Street Journal."
]