[
  "(CNN) High-level advisers close to then-presidential nominee Donald Trump were in constant communication during the campaign with Russians known to US intelligence, multiple current and former intelligence, law enforcement and administration officials tell CNN.",
  "President-elect Trump and then-President Barack Obama were both briefed on details of the extensive communications between suspected Russian operatives and people associated with the Trump campaign and the Trump business, according to US officials familiar with the matter.",
  "Both the frequency of the communications during early summer and the proximity to Trump of those involved \"raised a red flag\" with US intelligence and law enforcement, according to these officials.",
  "The communications were intercepted during routine intelligence collection targeting Russian officials and other Russian nationals known to US intelligence.",
  "Among several senior Trump advisers regularly communicating with Russian nationals were then-campaign chairman Paul Manafort and then-adviser Michael Flynn.",
  "Officials emphasized that communications between campaign staff and representatives of foreign governments are not unusual.",
  "However, these communications stood out to investigators due to the frequency and the level of the Trump advisers involved.",
  "Investigators have not reached a judgment on the intent of those conversations.",
  "Adding to US investigators' concerns were intercepted communications between Russian officials before and after the election discussing their belief that they had special access to Trump, two law enforcement officials tell CNN.",
  "These officials cautioned the Russians could have been exaggerating their access.",
  "Trump dismissed the claims that his advisers had close ties to Russia in a tweet Wednesday.",
  "\"This Russian connection non-sense is merely an attempt to cover-up the many mistakes made in Hillary Clinton's losing campaign,\" Trump tweeted.",
  "CNN has reached out to Flynn for comment.",
  "In an interview, Manafort emphatically denied that he was in contact with Russians known to US intelligence.",
  "\"That is 100% not true, at least as far as me,\" he said.",
  "\"I cannot believe that they are including me in anything like that.",
  "I have not been involved in any of these activities.\"",
  "Manafort said he did not know where US officials got the idea that he was in contact with suspected Russian operatives during the campaign but said he never spoke with any Russian officials during that time.",
  "\"I don't remember talking to any Russian officials, ever.",
  "Certainly during the time we're talking about,\" he said, calling the allegations \"boggling.\"",
  "\"I have knowingly never talked to any intelligence official or anyone in Russia regarding anything of what's under investigation,\" he said.",
  "\"I have never had any connection to (Russian President Vladimir) Putin or the Russian government before, during or after the campaign.\"",
  "Manafort said the FBI has not contacted him about the allegations and said he was not aware of any other Trump campaign officials or people close to Trump being in touch with Russians known to US intelligence.",
  "Manafort, who has held business ties with Russian and Ukrainian individuals, also emphasized that his work for the Yanukovich government in Ukraine should not be interpreted as closeness to the Russians.",
  "He said he worked for Yanukovich during a time when Ukraine was \"moving into the European orbit.\"",
  "The extensive contacts drew concerns of US intelligence and law enforcement officials in part because it came at a time of Russian cyberactivities targeting mostly Democratic Party political organizations\n\nPost-election intelligence briefings on Russian meddling in the US elections included details of those communications, which included people involved in Trump's businesses.",
  "The communications were gathered as part of routine US intelligence collection and not because people close to Trump were being targeted.",
  "The FBI and US intelligence agencies continue to try to determine what the motive for the communications were.",
  "One concern was whether Trump associates were coordinating with Russian intelligence operatives over the release of damaging information about the Hillary Clinton campaign.",
  "\"If that were the case, then that would escalate things,\" one official briefed on the investigation said."
]