[
  "\n\nRep. Devin Nunes (R-Calif.), the chairman of the House Intelligence Committee, speaks to reporters on Feb. 14.",
  "(Pete Marovich for The Washington Post)\n\nHouse Intelligence Committee Chairman Devin Nunes (R-Calif.) faced some very tough questions from reporters Monday.",
  "Nunes was holding a news conference amid reports that the White House had enlisted him — the man in charge of investigating alleged contacts between the Trump administration and Russia — to talk to a reporter about the matter.",
  "So Nunes was already under fire for making it look as though he isn't entirely neutral in all of this.",
  "But there was one particular answer Nunes gave Monday that strained credulity and made it appear as if he were bending over backward to see the best in the White House.",
  "It had to do with former national security adviser Michael T. Flynn's contact with Russia's ambassador to the United States in late December, about which Flynn misled the White House and was asked to resign.",
  "The big issue with Flynn's phone calls was that he discussed sanctions with Russia's ambassador on the same day the Obama administration was beginning new sanctions.",
  "That conversation was possibly in violation of the law (Flynn hasn't been charged).",
  "The prevailing theory is that perhaps the Trump White House, which has professed a desire for friendly relations with Russia, telegraphed that it would simply undo President Barack Obama's sanctions after Trump was inaugurated.",
  "And from there the question is whether Flynn was acting on his own or was instructed to send that message, perhaps by Trump.",
  "Trump has denied it.",
  "And Nunes said he doubted Trump told Flynn what to say.",
  "But Nunes's reasoning leaves something to be desired.",
  "Here's the exchange:\n\nQUESTION: Do you have any — have you heard any evidence at all, seen anything about anyone in the White House directing Mr. Flynn to discuss the issue — any issues with the Russian ambassador?",
  "Did anyone in the White House tell him to do that?",
  "NUNES: No, look, I think this whole issue with General Flynn — General Flynn is an American war hero, one of the — put together one of the greatest military machines in our history providing the intelligence to basically eliminate al-Qaeda from Iraq.",
  "And he was the national security adviser designee, he was taking multiple calls a day from ambassadors, from foreign leaders and look, I know this because the foreign leaders were contacting me trying to get in touch with the transition team and folks that wanted to meet with President Trump or — President-elect Trump and Vice President-elect Pence.",
  "QUESTION: But did President-elect Trump at the time of the transition team tell Flynn to talk to the Russian ambassador?",
  "NUNES: Look, I find that — I would find that hard to believe because they were so busy, and I think these conversations were all very short.",
  "So Nunes is basically saying that Trump was probably too busy to have asked Flynn to talk sanctions with the Russian ambassador.",
  "This is a president who, of course, spends plenty of time watching cable news and tweeting.",
  "He's also a president who found time to go on what was billed as a thank-you tour in December.",
  "It's also not as if instructing Flynn to assure the Russians on sanctions would have taken very long.",
  "It doesn't really seem like it would take more than a minute, really.",
  "Jack Langer, a spokesman for Nunes, declined to expand upon Nunes's reasoning, saying: “There’s no further elaboration.",
  "He doubts Trump directed Flynn to talk sanctions.”\n\nNone of this is to say there is any evidence that Trump directed Flynn to talk sanctions.",
  "There isn't yet — at least not publicly.",
  "But the idea that Trump was simply too busy to have done so and that they didn't communicate for long enough periods of time doesn't really make sense."
]