[
  "Chairman Nunes and Ranking Member Schiff have approved the Scope of Investigation for the inquiry by the House Permanent Select Committee on Intelligence into the Russian active measures campaign targeting the 2016 U.S. election.",
  "While the detailed, six-page scoping document remains classified, the investigation will seek to answer the following questions:\n\nWhat Russian cyber activity and other active measures were directed against the United States and its allies?",
  "Did the Russian active measures include links between Russia and individuals associated with political campaigns or any other U.S.",
  "Persons?",
  "What was the U.S. Government’s response to these Russian active measures and what do we need to do to protect ourselves and our allies in the future?",
  "What possible leaks of classified information took place related to the Intelligence Community Assessment of these matters?",
  "To answer these questions, the Committee will seek access to and custody of all relevant information, including law enforcement and counterintelligence information, consistent with the Committee’s oversight jurisdiction and investigative responsibilities.",
  "The Committee’s inquiry will not, however, impede any ongoing investigation.",
  "The Committee will also conduct interviews, take witness testimony, and review all reporting underlying the Intelligence Community Assessment (ICA) “Russian Activities and Intentions in Recent US Elections.” The inquiry will seek to ensure that the ICA comported with all relevant Intelligence Community analytic standards, and that allegations of Russian collusion with any U.S.",
  "Persons and the leaks of classified information are fully investigated.",
  "While the Committee has access to the reporting underlying the ICA, the Scope of Investigation reiterates the need to expand access to those documents and to ensure they are delivered to and stored at the Committee.",
  "It also sets forth the expectation that the Intelligence Community provide any other relevant intelligence to the Committee.",
  "Chairman Nunes said, “The Intelligence Committee has been investigating Russia for years and warning about the Putin regime’s hostile international actions, its aggression in cyber space, and its influential international propaganda campaigns.",
  "The committee is determined to continue and expand its inquiries into these areas, including Russian activities related to the 2016 U.S. elections.",
  "On a bipartisan basis, we will fully investigate all the evidence we collect and follow that evidence wherever it leads.”\n\n\n\nRanking Member Schiff stated, “The House Intelligence Committee must conduct a bipartisan investigation into Russia’s interference in our election.",
  "We must follow the facts wherever they may lead, leaving no stone unturned, and that must also include both the Russian hacking and dumping of documents as well as any potential collusion between Russia and U.S. citizens.",
  "This investigation is a national security necessity and anything less than a full accounting of all the facts will be insufficient to protect the country and meet the expectations of the American people.”"
]