[
  "Donald Trump calls revelations about attorney general’s contact with Russian ambassador ‘total witch hunt’ as Democrats continue to demand he step down\n\nAttorney general Jeff Sessions will recuse himself from investigations into Russian interference in the 2016 election, after revelations that he held two undisclosed meetings with the Russian ambassador last year.",
  "Sessions took the decision despite support from Donald Trump, who described the controversy as “a total witch hunt”.",
  "Amid mounting calls for his resignation, Sessions told a press conference on Thursday that he decided not to participate in any investigations “related in any way to the campaign for president of the United States” after meeting with senior department officials.",
  "Jeff Sessions and the Russia connection: what happened and why does it matter?",
  "Read more\n\nSessions insisted that he had not misled senators during his confirmation hearing and claimed it was “totally false” to suggest he had met with “Russian operatives” to discuss Trump’s election campaign.",
  "“I have now decided to recuse myself,” he said, adding: “I should not be involved in investigating a campaign I had a role in.”\n\nSessions has faced growing pressure from both Republicans and Democrats amid claims that he “lied under oath” after about twice speaking with Sergey Kislyak, the Russian ambassador to the United States, during the presidential campaign, in apparent contradiction to his testimony to Congress.",
  "The conversations occurred as Russia was allegedly meddling in the US election to undermine faith in the American electoral process and help elect Trump.",
  "Sessions was the first senator to endorse Trump and a vocal surrogate for the president when he was a candidate.",
  "Earlier on Thursday, Trump, while touring the aircraft carrier USS Gerald R Ford in Newport News, Virginia, said that he had “total” confidence in Sessions and that his attorney general should not recuse himself.",
  "In a statement released in the evening, followed by a series of tweets with a nearly identical statement, the president called Sessions “an honest man”, adding: “He did not say anything wrong.",
  "He could have stated his response more accurately, but it was clearly not intentional.",
  "“The Democrats are overplaying their hand.",
  "They lost the election and now they have lost their grip on reality.",
  "The real story is all of the illegal leaks of classified and other information.",
  "It is a total witch hunt!”\n\nDemocrats have continued to demand Sessions’s resignation.",
  "“Recusal is not good enough,” said Tom Perez, chair of the Democratic National Committee.",
  "“Attorney General Jeff Sessions must resign now, and a special prosecutor must be appointed immediately.”\n\nNancy Pelosi, the Democratic House minority leader, also demanded Sessions leave his post, saying his “narrow recusal and his sorry attempt to explain away his perjury are totally inadequate.",
  "He is clearly trying to maintain his ability to control the larger investigation into the sprawling personal, political and financial grip Russia has on the Trump administration.”\n\nSome Republicans were also beginning to break ranks.",
  "“Great decision by Attorney General Jeff Sessions to recuse himself from any potential investigation involving 2016 campaign,” Senator Lindsey Graham, a Republican, said on Twitter after the press conference.",
  "“It’s the best decision for the country and DOJ.",
  "I have full confidence in Jeff Sessions serving as Attorney General.”\n\nEarlier on Thursday, the House speaker, Paul Ryan, had resisted calls from within his own Republican party and said he did not see “any purpose or reason” for Sessions to recuse himself from an investigation unless the attorney general became the subject of the inquiry.",
  "Russia’s top diplomat described the uproar as a replay of McCarthyism.",
  "Contacts with officials and politicians are part of any ambassador’s duties, foreign minister Sergei Lavrov said.",
  "The pressure on Sessions, he added, “strongly resembles a witch hunt or the times of McCarthyism, which we thought were long over in the United States as a civilised country”.",
  "Sessions has now confirmed he met with the Russian ambassador on two occasions.",
  "The first time was at the Republican national convention in July, when Trump formally accepted the party’s nomination.",
  "There Sessions delivered a speech at an event for ambassadors sponsored by the Heritage Foundation.",
  "The second occasion was in the senator’s office on 8 September, exactly two months before the presidential election and amid accusations of a Russian cyber-attack.",
  "Sessions said Kislyak had requested the meeting and the senator’s staff made the arrangements.",
  "Sessions said they discussed his first trip to Russia in 1993, their religious convictions, terrorism and Ukraine, but said he did not recall “any specific political discussions”.",
  "At Sessions’s judiciary committee hearing on 10 January, he was asked by the Minnesota Democratic senator Al Franken what he would do if it were discovered that an official associated with the Trump campaign had communicated with the Russian government in the course of the 2016 election cycle.",
  "“I’m not aware of any of those activities,” Sessions replied.",
  "“I have been called a surrogate at a time or two in that campaign and I did not have communications with the Russians.”\n\nTrump associates' links with Russia: what we know so far Read more\n\nOn Thursday, Franken called that remark “at best, extremely misleading” and said Sessions should clarify his remarks under oath to the judiciary committee.",
  "During the press conference, Sessions said he was “taken aback” by Franken’s line of questioning.",
  "“In retrospect, I should have slowed down and said, but I did meet one Russian official a couple of times, that would be the Russian ambassador.”\n\nThe FBI is conducting an investigation into Russia’s interference in the US election, and any alleged links between associates of Trump and the Russian government.",
  "The House and Senate intelligence committees are each conducting separate inquiries into the matter.",
  "Recusals for attorney generals over conflicts of interest with FBI investigations have long precedents.",
  "In 2013, Barack Obama’s attorney general, Eric Holder, recused himself from an FBI investigation into leaks, after he himself was interviewed for it the previous year.",
  "George W Bush’s attorney general, Michael Mukasey, recused himself from a 2008 investigation into crooked financier Bernie Madoff because his son represented a Madoff associate.",
  "The House intelligence committee chairman, Devin Nunes, a Republican from California, said there was no reason yet for Sessions to step aside as attorney general.",
  "But speaking alongside Nunes, Representative Adam Schiff, the top Democrat on the committee, said the FBI had not divulged crucial pieces of information about its inquiry.",
  "If Trump’s goal is friendship with Russia, it’s a prize worth lying for | Simon Jenkins Read more\n\n“I would say at this point we know less than a fraction of what the FBI knows,” Schiff told reporters after a committee briefing with the FBI director, James Comey.",
  "“I appreciate [that] we had had a long briefing and testimony from the director today, but in order for us to do our investigation in a thorough and credible way, we’re going to need the FBI to fully cooperate, to be willing to tell us the length and breadth of any counterintelligence investigations they are conducting,” he continued.",
  "“At this point, the director was not willing to do that.”\n\n\n\nActivists protested outside the justice department on Thursday afternoon, chanting “lock him up”, a twist on the chants that rang out at Trump rallies across the country during the campaign about his opponent, Hillary Clinton."
]