[
  "President Donald Trump has stuck to a false claim that former President Barack Obama wiretapped him.",
  "Here’s a timeline of Trump’s statement, the White House’s evolving responses and the evidence against it.",
  "March 4, 2017\n\nIn the early morning hours, Trump posts a series of tweets where he accuses his predecessor, former President Barack Obama, of wiretapping him during the 2016 elections.",
  "Trump writes that he \"just found out that Obama had my ‘wires tapped’ in Trump Tower just before the victory.",
  "Nothing found.",
  "This is McCarthyism!\"",
  "He doesn’t provide evidence.",
  "Terrible!",
  "Just found out that Obama had my \"wires tapped\" in Trump Tower just before the victory.",
  "Nothing found.",
  "This is McCarthyism!",
  "— Donald J. Trump (@realDonaldTrump) 4.",
  "März 2017\n\nTrump then compares Obama’s alleged wiretapping with President Richard Nixon and the Watergate controversy that led to Nixon’s resignation.",
  "How low has President Obama gone to tapp my phones during the very sacred election process.",
  "This is Nixon/Watergate.",
  "Bad (or sick) guy!",
  "— Donald J. Trump (@realDonaldTrump) March 4, 2017\n\nThe accusations induce fake news websites to pick up the story.",
  "One claims that a warrant has been issued for Obama’s arrest; that claim rates Pants on Fire.",
  "The White House staff keeps quiet that day, a Saturday.",
  "Obama, however, immediately reacts to the accusations in a statement, asserting through his spokesperson Kevin Lewis that \"neither Barack Obama nor any White House official under Obama ever ordered surveillance of any U.S.",
  "citizen.\"",
  "Lewis said the Obama administration’s \"cardinal rule\" was that no White House official ever interfered with any independent investigation led by the Department of Justice.",
  "March 5, 2017\n\nOn Sunday, White House spokesman Sean Spicer issues a statement saying that \"neither the White House nor the president will comment any further\" until congressional intelligence committees exercise their oversight to determine whether Obama abused executive powers.",
  "Even though the White House does not comment, many others do.",
  "The New York Times, citing unnamed sources, reports that FBI Director James Comey asked the Justice Department to publicly deny Trump’s accusations.",
  "Former Director of National Intelligence James Clapper appears on NBC’s Meet the Press and says no wiretap activity was mounted against Trump while Clapper oversaw the national security apparatus.",
  "White House spokeswoman Sarah Huckabee Sanders on ABC’s This Week says she thought Trump based his allegations on sources \"that have led him to believe there was potential.\"",
  "\"Everybody acts like President Trump is the one that came up with this idea,\" Huckabee Sanders says.",
  "\"There are multiple news outlets that have reported this.\"",
  "PolitiFact rated that False, as no credible news reports had said that Obama wiretapped Trump.",
  "Share the Facts Politifact 4 6 Politifact Rating: False Politifact Rating: \"Everybody acts like President Trump is the one that came up with this idea.",
  "...",
  "There are multiple news outlets that have reported\" former President Barack Obama ordered wiretapping on Trump.",
  "Sarah Huckabee Sanders Trump press secretary in a segment on ABC's \"This Week\" Sunday, March 5, 2017 03/05/2017 Read More info\n\nMarch 6, 2017\n\nIn a press briefing on Monday, Spicer said, \"there is no question something happened.",
  "The question is, is it surveillance, is it a wiretap, or whatever.\"",
  "He adds, \"Neither the White House nor the president will comment further until such oversight is continued.\"",
  "March 7, 2017\n\nIn a press briefing on Tuesday, Spicer is asked by reporters whether he has seen any evidence himself.",
  "\"That’s probably above my pay grade,\" he says.",
  "\"The president believes that the appropriate place for this to be adjudicated is for the House and Senate Intelligence Committees.\"",
  "March 10, 2017\n\nA reporter asks Spicer if Trump will apologize if there turns out to be no evidence for his charge.",
  "\"Let’s not get ahead of ourselves,\" says Spicer.",
  "\"I’m not getting into a series of hypotheticals, prejudging the outcome of a report or an investigation that hasn’t occurred yet.",
  "I think once it’s done, we’ll respond appropriately.\"",
  "March 13, 2017\n\nSpicer suggests that Trump didn’t mean that Obama literally wiretapped him.",
  "\"If you look at the president’s tweet, he said very clearly quote -- ‘wiretapping’ -- end quote,\" Spicer says Monday, explaining that Trump didn’t necessarily mean there was a physical tap on his phones.",
  "\"The president used the word wiretap in quotes to mean broadly surveillance and other activities during that,\" Spicer says, adding, \"there is no question that the Obama administration, that there were actions about surveillance and other activities that occurred in the 2016 elections.\"",
  "March 15, 2017\n\nOn Wednesday, Trump appears on Fox’s Tucker Carlson Tonight.",
  "Carlson talks to him about the wiretap controversy and asks how he found out about it.",
  "\"Well, I’ve been reading about things,\" Trump says.",
  "\"I think it was Jan. 20, a New York Times article where they were talking about wiretapping.\"",
  "PolitiFact rates Trump’s statement False, because the article does not say Obama ordered a wiretap on Trump.",
  "Instead, the article addresses intelligence investigations into some of Trump’s associates.",
  "Share the Facts Politifact 5 7 Politifact Rating: False Politifact Rating: Says \"the New York Times wrote about\" Barack Obama wiretapping Donald Trump during the election.",
  "Donald Trump President in an interview with Fox's Tucker Carlson Wednesday, March 15, 2017 03/15/2017 Read More info\n\nTrump adds, \"I think you’re going to find some very interesting items coming to the forefront over the next two weeks.\"",
  "March 16, 2017\n\nOn Thursday, Spicer suggests Obama didn’t use American intelligence services, but instead the British intelligence agency GCHQ through which \"he was able to get it and there’s no American fingerprints on this.\"",
  "Spicer quotes Fox News’ Judge Andrew Napolitano, a judicial analyst, who made the allegations the night before, citing unnamed sources.",
  "Fox News distanced themselves from Napolitano’s claims the next day.",
  "\"Fox News knows of no evidence of any kind that the now president of the United States was surveilled at any time, in any way.",
  "Full stop,\" Fox News anchor Shepard Smith said on air.",
  "March 17, 2017\n\nThe GCHQ calls Spicer’s comment \"utterly ridiculous\" and \"nonsense.\"",
  "A spokesman of British Prime Minister Theresa May says that the British government received assurance from the White House that these allegations would not be repeated.",
  "The same day, German Chancellor Angela Merkel visits Washington.",
  "In a joint press conference, Trump continues to stick to his allegations.",
  "In an attempt to joke he adds, \"as far as wiretapping, I guess, by this past administration, at least we have something in common.\"",
  "The Telegraph, a newspaper in the UK, reported that the White House apologized to the United Kingdom, citing anonymous sources.",
  "However, in a press gaggle after the joint press conference, Trump’s spokesman Spicer says they \"don’t regret anything\" and that he had just been citing media reports.",
  "March 20, 2017\n\nAt the House Intelligence Committee hearing, Comey and NSA Director Mike Rogers both deny that there was any information supporting Trump’s allegations in his original tweet.",
  "\"With respect to the president's tweets about alleged wiretapping directed at him by the prior administration, I have no information that supports those tweets and we have looked carefully inside the FBI,\" Comey said.",
  "\"The Department of Justice has asked me to share with you that the answer is the same for the Department of Justice and all its components.",
  "The department has no information that supports those tweets.\"",
  "Rogers denied that he ever requested that the British intelligence service GCHQ to wiretap Trump.",
  "He said that would be \"expressively against the construct of the Five Eyes agreement,\" an intelligence agreement between Australia, New Zealand, Canada, the United Kingdom and the United States.",
  "See Figure 5 on PolitiFact.com"
]