[
  "The former political adviser to Trump, with whom he maintains close ties, later deletes tweet that was part of series of profane challenges to president’s critics\n\nRoger Stone, a former adviser to Donald Trump, wrote on Saturday night that he had a “perfectly legal back channel” to Julian Assange, whose organization WikiLeaks published emails related to Hillary Clinton’s presidential campaign that intelligence agencies say were hacked by Russian intelligence.",
  "Stone then deleted the message.",
  "Trump 'wiretap': White House wants investigation but Clapper denies order Read more\n\nWhile tweeting his support of the president’s unsubstantiated claims that Barack Obama tried to undermine the Trump campaign, Stone directed a series of angry and abusive messages at a scientist who questioned him.",
  "In one post, later deleted, Stone said he had “never denied perfectly legal back channel to Assange who indeed had the goods on #CrookedHillary”.",
  "He also invited challengers to file libel suits against him, saying: “Bring it!",
  "Would enjoy crush u in court and forcing you to eat shit – you stupid ignorant ugly bitch!”\n\n\n\nStone sent similar, profanity-laced messages to other critics of the president, including author JK Rowling, whom he suggested should take refugees and migrants into her own home.",
  "Stone then deleted the tweets.",
  "Hours later, he added: “Just nothing better than calling out liberal jerk offs on Twitter.",
  "We won, you lost.",
  "You’re done!”\n\nLili Loofbourow (@Millicentsomer) Here are the tweets Roger Stone deleted.",
  "pic.twitter.com/2S0mFvKcsu\n\nA political operative whose work with the Republican party dates back to the days of Richard Nixon – whose face is tattooed on Stone’s back – Stone reportedly retains ties to the president, though he officially left Trump’s campaign in late 2015.",
  "In an interview last week with Breitbart News, the site previously run by Steve Bannon, now Trump’s chief strategist, Stone was described as one of Trump’s “political mentors” and someone who “remains one of his closest confidantes”.",
  "Last fall, US intelligence agencies formally accused the Kremlin of trying to interfere in the 2016 election, and in January reported that Russia’s intent was to help Trump’s campaign defeat Clinton.",
  "Part of that covert effort, the agencies said, was to hack into the emails of the Democratic party and Clinton’s campaign chairman, John Podesta.",
  "Those emails were then released by WikiLeaks over several months of the campaign.",
  "Assange, who has spent four years living in the Ecuadorian embassy in London to avoid extradition to Sweden over rape allegations, has denied that Russian agents provided the emails.",
  "During the campaign last August, Stone was recorded on video telling a group of Florida Republicans: “I actually have communicated with Assange.”\n\n“I believe the next tranche of his documents pertain to the Clinton Foundation, but there’s no telling what the October surprise may be,” he said.",
  "He then seemed to preview the WikiLeaks dump of Podesta emails, writing on Twitter: “Trust me, it will soon the Podesta’s time in the barrel.”\n\nIn October, he told a local CBS reporter about “a back-channel communication with Assange, because we have a good mutual friend”.",
  "“That friend travels back and forth from the United States to London and we talk,” Stone said.",
  "In an interview with CBS last week, Stone denied having any “direct conversations” with Assange and added: “Nor did I have advance knowledge of either the matter of his subsequent disclosures, or who he did or did not hack.”\n\nTrump ally Roger Stone: Americans can now choose 'alternative' truths Read more\n\nThe FBI is reportedly investigating Stone, along with former Trump campaign chief Paul Manafort, former adviser Carter Page and former national security adviser Michael Flynn, for possible contacts with Russian officials.",
  "In an interview with the Guardian last month, Stone called for an unbiased investigation into such alleged links, saying: “The president should tell his attorney general that either he finds proof of this, or he puts it to bed and announces none of it happened.”\n\nHe added: “I would relish the opportunity to testify in public under oath on this issue.”\n\nStone also denied that he had any contact with Russian officials during or after the campaign.",
  "“There was no collusion,” he said.",
  "“I have had no connection with the Russians.",
  "If the government has evidence that I was colluding with the Russians in Donald Trump’s campaign, they should indict me immediately.”\n\nIn a separate interview with CBS this week, Stone said that the investigation was biased.",
  "“It’s a witch-hunt,” he said.",
  "“I know it is.”"
]