[
  "\n\nAttorney General Jeff Sessions.",
  "(Brian Witte/AP)\n\nAttorney General Jeff Sessions insisted in a letter to Congress Monday that he was “correct” to say he did not have communications with the Russians as part of the presidential campaign even though he had twice met with the Russian ambassador.",
  "He said in the letter that he did not tell legislators sooner about those meetings because he thought he had fully answered the particular question he was asked.",
  "In what he framed as a supplement to his testimony during his January confirmation hearing, Sessions acknowledged that he spoke briefly to Russian Ambassador Sergey Kislyak at the Republican National Convention in Cleveland in July and that he met with Kislyak in his Senate office in September.",
  "[Sessions’s recusal does little to quell partisan fervor over Russia]\n\nAt his confirmation hearing, Sen. Al Franken (D-Minn.) had asked Sessions what he would do as attorney general if there was any evidence that anyone affiliated with the Trump campaign communicated with the Russian government during the course of the campaign.",
  "Sessions responded: “Sen.",
  "Franken, I’m not aware of any of those activities.",
  "I have been called a surrogate at a time or two in that campaign and I didn’t have — did not have communications with the Russians, and I’m unable to comment on it.”\n\n“My answer was correct,” Sessions wrote in his letter to Congress.",
  "“As I noted in my public statement on March 2, 2017, I was surprised by the allegations in the question, which I had not heard before.",
  "I answered the question, which asked about a ‘continuing exchange of information during the campaign between Trump’s surrogates and intermediaries for the Russian government,’ honestly.",
  "I did not mention communications I had had with the Russian ambassador over the years because the question did not ask about them.”\n\nLast week, Sessions announced he was recusing himself from any Justice Department investigations involving Trump’s campaign, on which he served as an adviser.",
  "The Washington Post's Karoun Demirjian brings us up to speed on Jeff Sessions's decision to recuse himself from all investigations into the 2016 presidential campaign.",
  "(Zoeann Murphy/The Washington Post)\n\n[Jeff Sessions’s full letter updating his Congressional testimony]\n\nHe did so a day after The Washington Post reported his meetings with Kislyak — though he said he had been talking about doing so with Justice Department ethics officials for some time.",
  "He clarified specifically Monday that recusal would include any probes of “Russian contacts with the Trump transition team and administration,” though he said that clarification “should not be taken as any evidence of the existence of any such investigation or its scope.”\n\n“Suffice it to say that the scope of my recusal is consistent with the applicable regulations, which I have considered and to which I have adhered,” Sessions wrote.",
  "Sessions wrote that he did not disclose his meetings with Kislyak before The Post reported on them because he considered his previous answer to Franken “responsive, and no one having suggested otherwise, there was no need for a supplemented answer.” He said he did “not recall any discussions with the Russian ambassador, or any other representative of the Russian government, regarding the political campaign on these occasions or any other occasion.”"
]