[
  "If you'd heard of representative Devin Nunes before this week, you're either from his California district or you pay closer than average attention to the House Permanent Select Committee on Intelligence, which he leads.",
  "In that capacity, Nunes also heads up the House investigation into Russian's interference in last year's presidential election, as well as any ties between Russia and Trump or his colleagues.",
  "But last week, Nunes grabbed far more headlines than usual.",
  "Wednesday, he held an extraordinary, impromptu news conference.",
  "President Trump and his associates, Nunes declared, had been caught up in surveillance by US intelligence agencies.",
  "Nunes then rushed to the White House to share the information in person.",
  "It was a remarkable breach of protocol—one that, like some sort of inverse Magic Eye poster, becomes more confusing the longer you look at it.",
  "Further complicating matters is the fact that Nunes was an adviser to Trump's transition team.",
  "The initial Nunes surveillance claims are plenty problematic on their own, and we’ve discussed them before.",
  "(The short version: The kind of “incidental collection” Nunes described has nothing to do with direct surveillance of Trump, his associates, or Trump Tower).",
  "It's becoming increasingly clear, though, that the way Nunes came into this information, and the way he disseminated it, holds more intrigue than his original allegations.",
  "Below, we’ve cobbled together a brief timeline of the Nunes claims from last week, based on publicly available information, various reports, and statements from both Nunes and his colleagues.",
  "And while it may not say anything conclusive about Nunes’ relationship with the White House—and whether that tarnishes his leadership role in the Russia investigation—it certainly raises plenty of questions about his objectivity and his ability to lead an independent investigation.",
  "Tuesday evening, March 21: Devin Nunes takes a phone call while sharing a ride with a staffer, according to The Washington Post.",
  "After the call, he switches cars without telling his team where he’s going.",
  "As a Nunes spokesperson confirmed following a later CNN report, the unscheduled trip is to the White House, where an unnamed source provides Nunes with information about incidental collection of Trump and his associates.",
  "Wednesday afternoon, March 22: Nunes holds a press conference in the Capitol building outlining “incidental collection” of Trump and associates, as well as their “unmasking,” which means they were identified by name in intelligence reports.",
  "Nunes says the reports came from FISA surveillance, which means that foreign nationals who the intelligence community has eyes on either talked to or about the president-elect and his transition team at some point.",
  "There’s nothing either incriminating or surprising about this.",
  "Next, Nunes visits the White House to brief Trump on the intelligence reports.",
  "Directly after, he holds another press conference, this time on the White House lawn.",
  "Meanwhile, Trump says he feels “somewhat vindicated” after the Nunes briefing, despite no evidence that Trump Tower was wiretapped (which is what he had claimed).",
  "Shortly thereafter, representative Adam Schiff of California, the ranking Democrat on the House Intelligence Committee, releases a statement clarifying that Nunes did not share his information with his colleagues prior to holding public press conferences.",
  "Schiff added that Nunes had informed him that, contrary to previous statements, “most of the names in the intercepted communications were in fact masked.”\n\nWednesday evening, March 22: Senator John McCain (R-Arizona), in an MSNBC interview, calls for a select committee to investigate Russia, saying that “no longer does the Congress have credibility to handle this alone.”\n\nThursday morning, March 23: Nunes apologizes to his Intelligence Committee colleagues “in a generic way,” according to representative Jackie Speier (D-California), a fellow committee member.",
  "Nunes also tells the committee that they’ll see the documents on Friday.",
  "(This does not happen.)",
  "Thursday afternoon, March 23: A Nunes spokesperson clarifies that Nunes does not know “for sure” whether Trump or his associates were on the phone calls that were being surveilled or whether they were just mentioned in conversations between two or more foreign nationals.",
  "Thursday night, March 23: Appearing on Hannity on Fox News, Nunes explains his rationale for briefing Trump on sensitive information: \"I felt like I had a duty and obligation to tell him, because, as you know, he’s taking a lot of heat in the news media,\" Nunes said.",
  "\"I think to some degree there are some things he should look at to see whether, in fact, he thinks the collection was proper or not.\"",
  "Friday morning, March 24: Nunes cancels a planned open Intelligence Committee hearing that was to feature former ODNI head James Clapper, former CIA director John Brennan, and former deputy attorney general Sally Yates.",
  "Schiff calls it an “attempt to choke off public info.”\n\nSeparately, representative Eric Swalwell, a California Democrat who also sits on the Intelligence Committee, confirms that Nunes has not showed them the intelligence reports as promised, adding that “it looks like [Nunes is] running his own intelligence service at this point.”\n\nMonday morning, March 27: A Nunes spokesperson says Nunes met his source at the White House last week \"in order to have proximity to a secure location where he could view the information provided by the source.\"",
  "That’s apparently referring to a SCIF, a protected room used to share classified materials.",
  "But the need for a SCIF doesn’t explain the use of the White House; the Capitol building houses several of them and sits just 15 minutes away by car.",
  "The spokesperson further clarifies that, “because of classification rules, the source could not simply put the documents in a backpack and walk them over to the House Intelligence Committee space.” That also seems unlikely, given that someone with access to that level of confidential documents would in most cases also be cleared to take them from one location to another.",
  "Monday night, March 27: Schiff officially calls on Nunes to recuse himself.",
  "Tuesday morning, March 28: Appearing on the Today show, senator Lindsey Graham (R-SC) colorfully derides Nunes as running an \"Inspector Clouseau investigation,\" referring to the bumbling detective in the Pink Panther series.",
  "Later Tuesday morning, Nunes declines to recuse himself from the investigation.",
  "When pressed on Democrat concerns that he's too close to Trump, Nunes responds that it \"sounds like their problem.\"",
  "House Speaker Paul Ryan also said he saw no reason for Nunes to step aside.",
  "Wednesday morning, March 28: Nunes shifts blame to the Democrats, saying: \"We’re beginning to figure out who’s actually serious about the investigation because it appears like the Democrats aren’t really serious about this investigation.\"",
  "Democrats on the panel respond by noting that it was Nunes who canceled a previously scheduled open panel scheduled with no explanation and no apparent intent to reschedule.",
  "Thursday afternoon, March 29: The New York Times reports that National Security Council senior director for intelligence Ezra Cohen-Watnick and White House national security lawyer Michael Ellis provided Nunes the intelligence documents, indicating a direct thread between the administration and the original news conference.",
  "At his daily press briefing, Press Secretary Sean Spicer declines to comment, saying he chooses to focus more on the \"substance\" than the \"process.\"",
  "Thursday morning, April 6: Due to an ethics complaint, Devin Nunes steps down from his leadership of the Russia investigation, leaving open the possibility of return after an inquiry.",
  "His statement reads, in full:\n\n\"Several leftwing activist groups have filed accusations against me with the Office of Congressional Ethics.",
  "The charges are entirely false and politically motivated, and are being leveled just as the American people are beginning to learn the truth about the improper unmasking of the identities of U.S. citizens and other abuses of power.",
  "Despite the baselessness of the charges, I believe it is in the best interests of the House Intelligence Committee and the Congress for me to have Representative Mike Conaway, with assistance from Representatives Trey Gowdy and Tom Rooney, temporarily take charge of the Committee’s Russia investigation while the House Ethics Committee looks into this matter.",
  "I will continue to fulfill all my other responsibilities as Committee Chairman, and I am requesting to speak to the Ethics Committee at the earliest possible opportunity in order to expedite the dismissal of these false claims.\"",
  "Thursday night, April 11: CNN reports that, after having reviewed the same documents that prompted the original Nunes allegations, both Republican and Democratic lawmakers found nothing \"unusual or illegal.\"",
  "Instead, the bipartisan consensus appears to be that Susan Rice was simply doing her job, and that no politically motivated attempts to unmask took place.",
  "We will continue to update this post as the Nunes situation evolves."
]