[
  "Rep. Devin Nunes (R-California) announced Wednesday that he had seen evidence that communications between President Donald Trump and members of his transition team were \"incidentally collected\" during surveillance operations of foreign targets.",
  "Nunes, chairman of the House Permanent Select Committee on Intelligence, went to the White House Wednesday afternoon to tell the president about the communications because, he said, he was concerned that the information might have been improperly distributed to several U.S. spy agencies.",
  "The information collected had nothing to do with the investigation into Russian interference in the 2016 presidential election, the chairman said.",
  "FBI director James Comey said Monday that the agency is investigating any possible connection between the Trump campaign and Russian interference in the election.",
  "Nunes apologized Thursday to Democrats on the committee for not sharing the information with them before he went to the White House to talk to the president about what he had been given.",
  "Below are the transcripts for the two news conferences that Nunes held Wednesday.",
  "Here is the transcript from Rep. Nunes’ first press conference on Wednesday\n\n“Good morning everyone.",
  "As promised I continue to keep you appraised of new developments.",
  "Some significant developments, I think, occurred of the course of the last few days with information that was brought to my attention, and I’m gonna just sort of read a very brief statement, and that’s about all I can tell you, but I want to keep you fully informed of what’s, uh, happening.",
  "At our open hearing on Monday, I encouraged anyone who has information about relative topics, including surveillance on President-elect Trump or his transition team, to come forward and speak to members of the Committee.",
  "I also said that while there was no a physical wiretap of Trump Tower, I was concerned that other surveillance activities were used against President Trump and his associates.",
  "So first, I recently confirmed that on numerous occasions, the intelligence community incidentally collected information about U.S. citizens involved in the Trump transition.",
  "Details about persons associated with the incoming administration, details with little apparent foreign intelligence value were widely disseminated in intelligence community reporting.",
  "Third, I have confirmed that additional names of Trump transition team members were unmasked.",
  "And forth and finally, I want to be clear, none of this surveillance was related to Russia, or the investigation of Russian activities, or of the Trump team.",
  "The House Intelligence Committee will thoroughly investigate the surveillance, and its subsequent dissemination, to determine, a few things here that I want to read off:\n\nWho was aware of it?",
  "Why it was not disclosed to Congress?",
  "Who requested and authorized the additional unmasking?",
  "Whether anyone directed the intelligence community to focus on Trump associates?",
  "And whether any laws, regulations, or procedures were violated?",
  "I’ve asked the directors of FBI, NSA, and CIA to expeditiously comply with my March 15th letter that you all received a couple of weeks ago, and provide a full account of these surveillance activities.",
  "I informed Speaker Ryan this morning of this information, and I will be going to the White House this afternoon to share what I know with the president and his team.",
  "Before I get to questions I want to say that, uh, as you know there has been what appears to be a terrorist attack in the United Kingdom, obviously very concerned and our thoughts and prayers go out to our strong friends and allies over across the pond.",
  "And with that I’ll open it up to questions.",
  "Reporter: Mr. Nunes, were any of these communications potentially picked up at Trump Tower?",
  "Nunes: Uh, we don’t know that yet, that’s why we need to get the information.",
  "I will say this, the NSA has been very, very helpful.",
  "They know how important these programs are, they are in constant communication with our team, and as you know they partially complied with our request last week, and I expect them to hopefully get more information by Friday.",
  "And I have spoke to Admiral Rogers about these concerns, and he wants to comply as quickly as he can.",
  "Reporter: And was the president also part of that incidental collection?",
  "Nunes: Yes … yes.",
  "Reporter: So let me just clarify: the president of the United States’s personal communications were intercepted as an incidental part of—\n\nNunes: Well what I think we have—well what I think we have—when we talk about intelligence products here, we’ve got to be very careful.",
  "From what I know right now, it looks like incidental collection.",
  "We don’t know exactly how that was picked up, umm, but we’re trying to get to the bottom of it.",
  "Reporter: So the president of the United States’s personal communications were intercepted in incidental collection, not in a targeted way?",
  "Nunes: It’s possible.",
  "We won’t know until we get the information on Friday.",
  "And that’s why, look, I think the NSA’s going to comply.",
  "I am concerned—we don’t know whether or not the FBI is going to comply.",
  "I have placed a call, I’m waiting to talk to Director Comey, hopefully later today.",
  "Reporter: Are you concerned that any of the surveillance was done illegally, or as incidental but a legal, you know, a warrant .",
  ".",
  ".",
  "Nunes: Yeah, that’s a really good question.",
  "So, I believe it was all done legally.",
  "I think it was all obtained legally.",
  "The question is was it masked, why was it unmasked because it appears we have no information about additional unmaskings.",
  "And then who was on the dissemination list, and was the dissemination list so far if it was such specific information about the Trump transition.",
  "And it appears, just to give you one piece of information I think might be helpful, it appears most of this occurred from what I’ve seen in November, December, and January, so that should probably—so during the transition.",
  "Reporter: So you said that the president’s communications were incidentally collected, but then you said it’s also possible, so was it collected or is it possible it was collected?",
  "Nunes: I just don’t know the answer to that yet.",
  "Reporter: So you don’t know if the president’s communications were—\n\nNunes: Look, I know that there was collection, regarding the President-elect and his team.",
  "I don’t know if it was actually, physically a phone call.",
  "Reporter: You don’t know if it was the president himself, his communication?",
  "Nunes: I do not know that.",
  "Reporter: Mr. Chairman, did the president’s conversations or anything about the president appear in intelligence reports, is that what you’re saying?",
  "Nunes: I have seen intelligence reports that clearly show, that, uh, the President-elect and his team were I guess at least monitored and disseminated out in intelligence, in what appears to be raw—well I shouldn’t say raw—but intelligence reporting channels.",
  "As best as I can say that until I can actually get all of the information that we’ve requested.",
  "Reporter: You said you have to go and brief the administration—\n\nSomeone: Please talk to the cameras!",
  "Reporter: Shouldn’t the administration be briefing you?",
  "Nunes: Well, the administration isn’t aware of this, so I need to make sure I go over there and tell them what I know.",
  "Because it involves them.",
  "Reporter: You said this was not related to Russia investigations?",
  "Can you give us some idea—\n\nNunes: The information that I have seen has nothing to do with Russia or the Russian investigations.",
  "So bluntly put, everything that I was able to view did not involve Russia or any discussions with Russia,s or any trump people or other Russians talking, or, so none of it has to do with Russia—that doesn’t mean it doesn’t exist, it just means we don’t have it.",
  "Reporter: Can you give us a broader sense of what it was related to?",
  "Nunes: It—look, a lot of it appears like it was, it looks to me like it was all legally collected, but it was essentially a lot of information on the President-elect and his transition team and what they were doing.",
  "Reporter: Was it incidental collection, or [unintelligible] collection?",
  "Nunes: I think, uh, from what I’ve seen it appears to be incidental collection.",
  "Any other questions, guys?",
  "Reporter: Wait, so what was found, just to be clear—it was—the material that you have seen so far, doesn’t make any reference or connection to Russia, or are you saying the incidental investigations themselves more broadly were not?",
  "Nunes: Yeah, so this information was legally brought to be by sources who thought that we should know it.",
  "And it was, it had, there were no references whatsoever in everything that I read, and it was dozens, let’s just say, let’s leave it at that, dozens of reports, and there was no mention of Russia.",
  "Reporter: And that was [unintelligible] by the person that brought that information to you?",
  "Nunes: That’s correct.",
  "Reporter: [Unintelligible]\n\nNunes: I’m not going to get into the sources, or when it arrived, but I wanted to brief the Speaker, which is what I did this morning, and obviously I briefed, I put in calls to the directors, I’ve spoken to the CIA Director and the NSA Director, and I’m waiting to talk to Director Comey, and I’m going to head to the White House after the votes.",
  "…\n\nReporter: Does this change—you’ve said repeatedly that the President was wrong when he said he was wiretapped at Trump Tower.",
  "Nunes: Well, what we’ve said from day one that there wasn’t a physical wiretap of Trump Tower, we don’t have any evidence to show that at all, but what I read—there was clearly significant information about President Trump and his team and there were additional names that were unmasked.",
  "Which is why we sent that letter on the 15th.",
  "Reporter: Is this a response to that letter?",
  "Nunes: No, no it was not.",
  "This was information brought to me by sources and I’m hoping that NSA, FBI, CIA get me anything else they have.",
  "Reporter: Do you plan to make this information available now or in the future?",
  "Nunes: You mean publicly?",
  "It’s all classified information.",
  "We’re hopeful we’re going to get the information I’ve seen plus a lot more information on Friday.",
  "Reporter: Was this surveillance or a criminal investigation?",
  "Nunes: No, it has nothing to do with any criminal investigation.",
  "This is normal incidental collection, at least from what I was able to read.",
  "Reporter: [Unintelligible] surveillance, then they have to have a basis for surveillance, isn’t that correct?",
  "Nunes: No, it was not criminal.",
  "It was normal foreign surveillance, is what it looks like to me.",
  "But let’s wait until we get all the information.",
  "Reporter: So this was about President Trump, but not necessarily about his communications specifically?",
  "Nunes: As of right now that’s what I’ve seen, but it’s hard to know until we get all the information and talk to the appropriate agencies.",
  "Reporter: You said you’re not confident where collection took place and you’re not confident who it involves—\n\nNunes: No, because all I was able to see was reports—reports on information that was collected.",
  "Reporter: How can you be confident, then, that it did not have anything to do with Russia and the Russia investigation?",
  "Nunes: Because I read through them and there was no mention of Russia.",
  "Reporter: Specifically are we talking about Paul Manafort, like here and his communications, or any other senior level Trump officials?",
  "Nunes: No, no.",
  "This appears to be all legally collected foreign intelligence under FISA, where there was incidental collection that then ended up in reporting channels and was widely disseminated.",
  "Reporter: Can you say which individuals in particular?",
  "Nunes: Not at this time.",
  "…\n\nReporter: You say that this is routine collection, incidental collection.",
  "Are you surprised by this today?",
  "Nunes: Yeah, I’m actually alarmed by it.",
  "We went through this about a year and a half ago as it related to members of Congress, if you may remember there was a report—I think it was in the Wall Street Journal—and there was a whole series of hearings, and then we had to have changes as to how members of Congress are informed if members of Congress are picked up in surveillance.",
  "And this looks like—it’s very similar to that, it reminds me of what happened a year and a half ago.",
  "Reporter: Could this have been the result of reverse targeting?",
  "Nunes: I don’t know.",
  "I’ve only—like I said, I’ve seen dozens of reports, I don’t know if there’s more than that, but clearly I thought it was important enough to tell all of you, inform the speaker, and then go to the White House and inform them.",
  "Because I think—they need to see it, if they don’t have it they need to see it.",
  "Reporter: You’re confident that this is [unintelligible] information?",
  "Nunes: It’s official IC information.",
  "Reporter: Did you receive this from members of the intelligence community who are officially communicating it to you, or was this—\n\nNunes: I don’t want to get into this, for the protections of American citizens, as you can imagine.",
  "Reporter: Which foreign country are we referring to here?",
  "Nunes: I’m not going to get into the exact countries.",
  "Reporter: Will this broaden the scope of your investigation, and what do you think of Democrats’ calls for an independent commission or counsel?",
  "Nunes: Uh, no, I mean, we’re doing our investigation, we’re following the facts where they lead, and clearly I thought this was important enough to come publicly and say what I have so far.",
  "Reporter: Is there definitely none of this pre-election, is this all during the transition period?",
  "Nunes: I don’t know that, but what I’ve seen is post-election.",
  "Reporter: Is it the surveillance itself that alarms you or is it the unmasking and dissemination, or both?",
  "Nunes: All the above.",
  "I’m really bothered by the unmasking, which is why we sent that letter on the 15th, because I want to see what additional names were unmasked.",
  "And now I know—it appears there were additional names that were unmasked.",
  "Reporter: What is it about the surveillance itself that alarms you if that was possibly just routine incidental collection on a foreign target?",
  "Nunes: I guess, from what I read, it just—it bothers me that that would have any foreign intelligence value whatsoever, and why people would need to know that about president elect trump and his transition team.",
  "Reporter: Just to be clear, were these communications actually collected inside Trump Tower?",
  "Nunes: We don’t know, we don’t know that.",
  "Reporter: How do you not know if it was Trump’s personal communications?",
  "Wouldn’t that be clear?",
  "Nunes: Because until I get all the information in its entirety from all the agencies, then we can go through it and we can go back and ask those kinds of questions, but I would just be speculating at this point.",
  "Reporter: Can you just say, do you think right now, the NSA or a member of the intelligence community was spying on Trump during the transition period?",
  "Nunes: Well, I guess it all depends on the one definition of spying.",
  "Clearly it bothers me enough, I’m not comfortable with it, and I want to make sure that the White House understands it and that’s why I briefed the Speaker this morning on this.",
  "Reporter: But you think he may have been spied on?",
  "Nunes: I’m not going to get into legal definitions here, but clearly I have a concern.",
  "Below is the transcript of the second press conference, held at the White House following Nunes’ meeting with the president.",
  "Nunes: I haven’t had a chance to brief a lot of you in the past, but just to have a chance to keep you updated with what’s happening with this investigation.",
  "Today I briefed the President on the concerns that I had about incidental collection and how it relates to President-elect Trump and his transition team, and the concerns that I had.",
  "As I said earlier, there will be more information, hopefully by Friday.",
  "The NSA is cooperating very very well.",
  "And lastly I’ll say that the reports that I was able to see did not have anything to do with Russia or the Russia investigation or any ties the Trump team.",
  "And with that, I’ll take a couple questions.",
  "Reporter: Can I ask you a question?",
  "Why is it appropriate for you to brief President Trump given that it’s his own administration or campaign associates that are a part of this investigation?",
  "Doesn’t it appear to be interference in some form?",
  "Nunes: Because what I saw has nothing to do with Russia and nothing to do with the Russia investigation.",
  "It has everything to do with surveillance activities, and the President needs to know that these intelligence reports are out there, and I have a duty to tell him that.",
  "Reporter: Is it appropriate to be drawing conclusions before it was completed?",
  "Nunes: I’m not drawing any conclusions, I’m just telling the President what exists in intelligence reports.",
  "Reporter: Are the subjects of surveillance under FISA orders?",
  "Nunes: It appears so.",
  "I don’t want to get too much into these details, but these were intelligence reports.",
  "It brings up a lot of concerns about whether things were properly minimized or not.",
  "But I’ll tell you, I’ve only seen some, it’s in the dozens.",
  "We don’t have the full scope of all the intelligence reports that have been produced or who ordered the unmasking of the names.",
  "Reporter: The surveillance—if it wasn’t related to Russia or anything like that, are you saying that it was political surveillance of political opponents, as suggested in his tweets?",
  "Nunes: What I’ve read bothers me.",
  "And I think it should bother the President himself and his team, because I think some of it seems to be inappropriate, but like I said, before we get all the information to the committee, it’s hard to really say.",
  "Reporter: We knew that there was some incidental collection, because Lt. Gen. Michael Flynn was caught talking to Sergey Kislyak.",
  "Does this go beyond that, and does this qualify as the kind of wiretapping the President was tweeting about?",
  "Nunes: It definitely goes beyond what happened to General Flynn—now of course, we don’t officially know yet what happened to Gen. Flynn.",
  "We just know that his name leaked out, but we don’t know how it was picked up yet.",
  "That’s why we asked in our March 15th letter for the NSA, CIA, and FBI to get us all the unmasking that was done.",
  "And I’ll tell you, NSA is being cooperative, but the FBI has not yet let us know whether they’re going to respond to our March 15th letter, which is now a few weeks old.",
  "Reporter: And again, does this seem to describe what the President was talking about, he was talking about, quote, wiretapping, which he then said was broader?",
  "Nunes: You—what I’ve read, there seems to me to be some level of surveillance activity, perhaps legal, but I don’t know that it’s right and I don’t know that the American people would be comfortable with what I read, but let us get all the reports.",
  "Reporter: So the President was correct in what he tweeted?",
  "Nunes: It is possible.",
  "Reporter: The President said that President Obama tapped his phones.",
  "Did you see anything—\n\nNo, no, no.",
  "That did not happen.",
  "I’ve said this for many, many weeks, including the day after or a couple days after in front of the press.",
  "That never happened.",
  "Reporter: Did you see anything to suggest that President Obama ordered any kind of surveillance on the President-elect?",
  "Nunes: Well, we don’t know who sent the taskings, if the taskings were changed into what went into these intelligence reports.",
  "But we’re going to try to find that out.",
  "Reporter: Did you have permission to put out this information today, did the Justice Department give you the OK to do that?",
  "Nunes: This is information that was brought to me that I thought the President needed to know about incidental collection, where the President himself and others in the Trump transition team were clearly put into intelligence reports that ended up in this White House and across a whole bunch of other agencies.",
  "And I thought it was important that the President know this.",
  "That’s why I briefed the Speaker this morning, and that’s why I came down here as soon as I could.",
  "Reporter: How many people are you seeing in these reports, and do any of them currently work at the White House?",
  "Nunes: I don’t want to get into the details.",
  "We don’t have—I was only able to see a few dozen, of which I think a lot of it does have foreign intelligence value.",
  "There were dozens of reports that I was able to see and we’re hoping that the NSA, FBI, CIA will provide—I know they exist, so I want them to provide them to our committee—so that all the members have an opportunity to see what I have been shown.",
  "Reporter: What did the President tell you after you briefed him about it?",
  "Nunes: I think the President is concerned and he should be.",
  "I think he’d like to see these reports.",
  "And hopefully when we get them, they’ll get them to the White House also.",
  "Reporter: Do you believe the President appropriately used the word wiretap, was it used correctly in his tweets, based on the information that you have seen?",
  "Nunes: Well, I think the wiretapping, if you use it generally, the President has said, he clearly used it differently than what I think a lot of people took it—did Obama wiretap Trump Tower which we knew didn’t happen—I think the President has been pretty clear on that—\n\nReporter: But the physical act of wiretapping, do you see anything in the information that—\n\nNunes: No, no.",
  "And I said that on day two.",
  "Reporter: Can you rule out the possibility that senior Obama administration officials were involved in this?",
  "Nunes: No we cannot.",
  "Reporter: Given that you have said there was a FISA warrant which would have been approved by a judge, are you concerned that essentially you’re saying that members of the Trump team were in contact with people who were the target of a counterintelligence or some form of investigation?",
  "Nunes: No, I think you’re reading too much into this.",
  "This is normal intelligence reporting, the question is, should he himself or others - should they have been put into these reports.",
  "I don’t know the answer to that yet, but we’re trying to get to the bottom of it.",
  "Reporter: So your issue is the unmasking, not that there was [unintelligible]\n\nNunes: Well, there’s two issues here.",
  "There’s additional unmasking of names, which I think is totally inappropriate, but we—I don’t know how many names were unmasked, but I know these additional unmaskings occurred.",
  "And then we have the additional issue of the names that were put into these intelligence reports that we have to get to the bottom of.",
  "And this is why we sent the letter two weeks ago.",
  "Reporter: Chairman, if I could just clarify and ask a few things.",
  "Are you suggesting that Mr. Trump [unintelligible] And third, why did you not take this up with Representative Schiff before going to the White House?",
  "Nunes: Yes, no, and I’m going to be meeting with Mr. Schiff at some point to talk about where to go with this investigation.",
  "But I had to brief the speaker first, then I had to talk to the NSA, the CIA Director, then I have to talk to the FBI Director, then I had to talk to all of you, and then I voted, and then I said I was coming here to brief the President.",
  "Reporter: Just to clarify, you’re concerned about this but you’re not calling for an additional investigation?",
  "Nunes: Well, we are investigating.",
  "Reporter: You just said no.",
  "Nunes: No, incidental—we’re already investigating.",
  "Reporter: You said it has nothing to do with Russia and you’re folding this in—\n\nNunes: Well, you’re folding this in—the unmasking of names—\n\nReporter: So an ongoing investigation and you thought it was appropriate to come and talk to the President about that.",
  "Nunes: Remember, we have had an ongoing investigation into Russia for a very, very long time, and all of their activities.",
  "We have scoping document in the Russia investigation and we will continue to investigate anything and everything else that might be caught up in this.",
  "Reporter: So Mr. Trump’s communications were in fact monitored?",
  "Can you tell us what he was communicating about or who he was communicating with?",
  "Nunes: No, I can’t say that.",
  "Reporter: You also said somebody brought you this communication.",
  "Can you tell us anything—\n\nNunes: I can say that we’ve been asking for people to come forward.",
  "They came through the proper channels and have clearances and I’m just going to leave it at that because we have to protect people who came forward in the right manner.",
  "I’m not even going to say it’s one person.",
  "Reporter: To be clear, you talk about this as being collected incidentally.",
  "But you say it had nothing to do with Russia.",
  "Are you suggesting these communications could have been collected as part of a criminal investigation, a criminal warrant?",
  "Nunes: No.",
  "In the dozens of reports I was able to see, I was able to determine that it looks like it was legal collection, incidental collection, that made itself into intelligence reports.",
  "It has to do with FISA, and there are multiple FISA warrants that are out there, but there’s nothing criminal at all involved.",
  "Reporter: Was it information that was looked at it in real time, or was it information that was collected, held, scored -\n\nNunes: It was fairly quick, from what I’ve seen, but we have to—once we get the reports, we can ask more questions of the agencies that produced them.",
  "Reporter: If it’s legal collection, wouldn’t it be inappropriate of you to talk about it, and are you attempting to give the president political cover in his talk about wiretapping?",
  "Nunes: The reason that we do this, that we have all these procedures in place, is to protect American citizens who are incidentally collected.",
  "There are certain thresholds that have to be met to make it into foreign intelligence products.",
  "If something else happens, it appears to me like there were things like maybe they didn’t meet the level of foreign intelligence value, and if that’s the case -\n\nReporter: But just to clarify, this is not intentional spying on Donald Trump or anyone in his—\n\nNunes: I have no idea—we won’t know that until we get to the bottom of whether, did people ask for the unmasking of additional names on the President-elect’s transition team.",
  "Reporter: You’ve said legal and incidental.",
  "That doesn’t sound like a proactive effort to spy.",
  "Nunes: I would refer to you to—we had a similar issue with members of Congress that were being picked up in incidental collection.",
  "We had to spend a full year working with the DNI on proper procedures for members of Congress to be notified.",
  "Reporter: Was the president unmasked?",
  "Was his name unmasked?",
  "Nunes: I’m not going to get into that, but I have every indication that it’s clear who’s in these reports.",
  "Reporter: Who would have access to those unmasked names?",
  "Nunes: We don’t know that yet."
]