[
  "The nation’s top intelligence official told associates in March that President Trump asked him if he could intervene with then-FBI Director James B. Comey to get the bureau to back off its focus on former national security adviser Michael Flynn in its Russia probe, according to officials.",
  "On March 22, less than a week after being confirmed by the Senate, Director of National Intelligence Daniel Coats attended a briefing at the White House together with officials from several government agencies.",
  "As the briefing was wrapping up, Trump asked everyone to leave the room except for Coats and CIA Director Mike Pompeo.",
  "The president then started complaining about the FBI investigation and Comey’s handling of it, said officials familiar with the account Coats gave to associates.",
  "Two days earlier, Comey had confirmed in a congressional hearing that the bureau was probing whether Trump’s campaign coordinated with Russia during the 2016 race.",
  "[Inside Trump’s anger and impatience — and his sudden decision to fire Comey]\n\nAfter the encounter, Coats discussed the conversation with other officials and decided that intervening with Comey as Trump had suggested would be inappropriate, according to officials who spoke on condition of anonymity to discuss sensitive internal matters.",
  "The events involving Coats show the president went further than just asking intelligence officials to deny publicly the existence of any evidence showing collusion during the 2016 election, as The Washington Post reported in May.",
  "The interaction with Coats indicates that Trump aimed to enlist top officials to have Comey curtail the bureau’s probe.",
  "[Trump asked intelligence chiefs to push back against FBI collusion probe after Comey revealed its existence]\n\nCoats will testify on Wednesday before the Senate Intelligence Committee.",
  "Lawmakers on the panel said they would press him for information about his interactions with the president regarding the FBI investigation.",
  "The question of whether the president obstructed the Russia investigation is expected to take center stage this week with Comey’s highly anticipated testimony on the Hill on Thursday.",
  "Comey associates say that before the director was fired in May, the president had asked him to drop the investigation into Flynn, and Comey refused.",
  "Brian P. Hale, a spokesman for the Office of the Director of National Intelligence (ODNI), declined to comment on whether Trump asked Coats to intervene with Comey regarding the Flynn investigation.",
  "Hale said in a statement: “Director Coats does not discuss his private conversations with the President.",
  "However, he has never felt pressured by the President or anyone else in the Administration to influence any intelligence matters or ongoing investigations.”\n\nA spokesman for Pompeo declined to comment on the closed-door discussions.",
  "The White House referred questions to outside lawyers, who did not immediately respond to a request for comment.",
  "Trump has repeatedly denied any coordination took place between his campaign and the Russian government, which, according to U.S. intelligence agencies, stole emails embarrassing to Democratic presidential candidate Hillary Clinton and leaked them to undermine her campaign.",
  "Flynn had served as an enthusiastic surrogate for Trump during the campaign and then was fired after just 24 days as national security adviser over revelations he misrepresented his discussions with the Russian ambassador to the United States.",
  "[Flynn’s swift downfall: From a phone call to a forced resignation]\n\nThe incidents suggest that Trump may not have appreciated the traditional barriers meant to insulate the intelligence agencies from politics.",
  "Though the ODNI oversees other intelligence agencies, the FBI director operates independently on many matters.",
  "For example, Comey kept James R. Clapper Jr., Coats’s predecessor in the Obama administration, in the dark about the bureau’s investigation into possible coordination between the Trump campaign and Russia.",
  "A day or two after the March 22 meeting, the president followed up with a phone call to Coats, according to officials familiar with the discussions.",
  "In the call, Trump asked Coats to issue a public statement denying the existence of any evidence of coordination between his campaign and the Russian government.",
  "Again, Coats decided not to act on the request.",
  "Trump similarly approached Adm. Mike Rogers, the director of the National Security Agency, to ask him to publicly deny the existence of any evidence of coordination, as The Post previously reported, according to current and former officials.",
  "Like Coats, Rogers refused to comply with the president’s request.",
  "Trump announced in January that he was nominating Coats to serve as director of national intelligence, responsible for overseeing U.S. intelligence agencies and for briefing the president on global developments.",
  "In February, as tensions flared between intelligence agencies and the White House over Russia and other issues, some of Trump’s advisers floated the idea of appointing a New York billionaire, Stephen A. Feinberg, to undertake a review of the ODNI.",
  "Coats, who was preparing for his confirmation hearing, felt blindsided, officials said.",
  "The White House backed away from the idea of naming Feinberg after Coats, members of the intelligence community and Congress raised objections.",
  "Officials say Trump’s advisers have since revived their proposal to appoint Feinberg to a senior position, possibly to review the roles of the ODNI and other intelligence agencies.",
  "Some officials said they viewed the prospective appointment of Feinberg as an effort by White House officials to put pressure on intelligence agencies to close ranks with the White House.",
  "In an appearance last month before the Senate Armed Services Committee, Coats refused to provide details about his interactions with Trump.",
  "But he indicated that he would cooperate with the Russia probe now being led by special counsel Robert S. Mueller III.",
  "Under questioning by Sen. Martin Heinrich (D-N.M.), Coats said that if asked, he would provide details of his conversations with Trump to Mueller.",
  "Coats also said that if he is called before an investigative committee, such as the Senate Intelligence Committee, “I certainly will provide them with what I know and what I don’t know.” He said the Trump administration had not directed the ODNI to withhold information from members of Congress conducting oversight.",
  "Read more:\n\nAll eyes are on Comey this Thursday — again\n\nLegal analysts: Trump might have obstructed justice, if Comey’s allegation is true\n\nPutin ridicules allegations of collusion between Trump aides and Russian officials"
]