[
  "President Trump told Fox Business Network's Maria Bartiromo on April 12, that his order to send airstrikes against a Syrian airfield took place during dessert with Chinese President Xi at Mar-a-Lago, as Xi ate, \"the most beautiful piece of chocolate cake that you've ever seen.\"",
  "(Fox Business Network)\n\nPresident Trump spoke with Fox Business Network's Maria Bartiromo in an interview airing Wednesday morning, and it was par for the course for Trump.",
  "By which I mean he rewrote history (on his views of attacking Syria), offered some cryptic comments (about FBI Director James Comey's job), and appeared to completely reverse course on strategy (saying he now wants to finish health-care reform before tax reform).",
  "He even appeared to brag about striking Syria while eating dessert with Chinese President Xi Jinping.",
  "Below is the full transcript, with the key parts highlighted and analyzed.",
  "To see an annotation, click on the yellow parts.",
  "TRUMP: Well, look, you know because you cover it.",
  "We've done an amazing job on regulations.",
  "We've freed it up.",
  "We freed up this country so much, the miners and energy and the banking system is now coming, too, with Dodd-Frank, which is a disaster.",
  "We freed up so much and we're getting great, great credit for it.",
  "We have done so much for so many people.",
  "I don't think that there is a presidential period of time in the first 100 days where anyone has done nearly what we've been able to do.",
  "And on top of it, we just had — during the first 100 days, a Supreme Court justice approved, not just nominated, but approved through a very, very hostile environment.",
  "We have thousands of jobs all across the country.",
  "Look at what's going on in Michigan with the expansion of the plants by Ford, by General Motors, yesterday Toyota announced that they're going to spend $1.3 to $1.9 billion in Kentucky.",
  "And different things.",
  "I mean the car industry is not going to leave us anymore, believe me.",
  "The car industry is staying in our country.",
  "They were leaving — if I didn't win this election, you would have lost your car industry to Mexico and to other countries.",
  "They're not leaving anymore, believe me.",
  "There's retribution if they leave.",
  "There was no retribution.",
  "BARTIROMO: Right.",
  "TRUMP: They'd leave, they would sell their cars in, they'd fire all our people.",
  "Now, there's retribution.",
  "And they understand that.",
  "Now, at the same time, I'm going to treat them great.",
  "But we want them to expand their plants and build new plants and that's what they're doing.",
  "TRUMP: Yes, I am waiting right now for so many people.",
  "BARTIROMO: You're under staffed.",
  "TRUMP: Hundreds and hundreds of people.",
  "And then they'll say, why isn't Trump doing this faster?",
  "You can't do it faster, because they're obstructing.",
  "They're obstructionists.",
  "So I have people — hundreds of people that we're trying to get through.",
  "I mean you have — you see the backlog.",
  "We can't get them through.",
  "BARTIROMO: Yes.",
  "TRUMP: And then the newspapers will say Trump doesn't get them through.",
  "Well, not — nothing to do with me.",
  "Statutorily, you have to go through this process.",
  "So it's been a lousy process.",
  "It's taken a long time to get my cabinet done.",
  "And as you know, it's not even done now.",
  "This is records stuff.",
  "You know, we're talking about records in terms of time.",
  "And it's very sad.",
  "Well, you see, even again, with the Supreme Court judge that everybody agrees is outstanding and you see what that process was.",
  "BARTIROMO: Absolutely.",
  "And the American people know it, I think.",
  "TRUMP: I think they know it.",
  "I think they get it.",
  "I wish it would be explained better, the obstructionist nature, though, because a lot of times I'll say why doesn't so and so have people under him or her?",
  "The reason is because we can't get them approved.",
  "BARTIROMO: Well, people are still wondering, though, they're scratching their heads, right, so many Obama-era staffers are still here.",
  "For example, was it a mistake not to ask Jim Comey to step down from the FBI at the outset of your presidency?",
  "Is it too late now to ask him to step down?",
  "TRUMP: No, it's not too late, but, you know, I have confidence in him.",
  "We'll see what happens.",
  "You know, it's going to be interesting.",
  "But, you know, we have to just — look, I have so many people that want to come into this administration.",
  "They're so excited about this administration and what's happening — bankers, law enforcement — everybody wants to come into this administration.",
  "Don't forget, when Jim Comey came out, he saved Hillary Clinton.",
  "People don't realize that.",
  "He saved her life, because — I call it Comey won.",
  "And I joke about it a little bit.",
  "When he was reading those charges, she was guilty on every charge.",
  "And then he said, she was essentially OK.",
  "But he — she wasn't OK, because she was guilty on every charge.",
  "And then you had two and then you had three.",
  "But Hillary Clinton won — or Comey won.",
  "She was guilty on every charge.",
  "BARTIROMO: Yes.",
  "TRUMP: So Director Comey...\n\nBARTIROMO: Well, that's (INAUDIBLE)...\n\nTRUMP: No, I'm just saying...\n\nBARTIROMO: (INAUDIBLE)?",
  "TRUMP: Well, because I want to give everybody a good, fair chance.",
  "Director Comey was very, very good to Hillary Clinton, that I can tell you.",
  "If he weren't, she would be, right now, going to trial.",
  "BARTIROMO: Are you going to push that?",
  "Are you going to put...\n\nTRUMP: No, I don't want to talk about that, I want to talk about (INAUDIBLE).",
  "BARTIROMO: Mr. President, just a final question for you.",
  "In the last weeks of the Obama presidency, he changed all the rules in terms of the intelligence agencies, allowing them to share raw data.",
  "TRUMP: Terrible.",
  "BARTIROMO: Why do you think he did this?",
  "TRUMP: Well, I'm going to let you figure that one out.",
  "But it's so obvious.",
  "When you look at Susan Rice and what's going on, and so many people are coming up to me and apologizing now.",
  "They're saying you know, you were right when you said that.",
  "Perhaps I didn't know how right I was, because nobody knew the extent of it.",
  "(INAUDIBLE)...\n\nBARTIROMO: When you sent that...\n\n(CROSSTALK)\n\nTRUMP: — what they did...\n\nBARTIROMO: — was that what you were referring to, the Susan Rice?",
  "TRUMP: Oh, sure.",
  "We're talking about surveillance.",
  "It was wiretapped in quotes.",
  "\"The New York Times\" said the word wiretapped in the headline of the first edition.",
  "Then they took it out of there fast when they realized.",
  "But I put wiretapped in quotes, meaning, because, look, wiretapping is an old-fashioned...\n\n(CROSSTALK)\n\nTRUMP: — there are too many wires anymore, right?",
  "(CROSSTALK)\n\nTRUMP: You don't have a lot of wires.",
  "Look at this room.",
  "This room used to have a lot of wires.",
  "Now it doesn't have so many wires.",
  "But we talked about surveillance or whatever.",
  "And you look at the extent of the surveillance.",
  "Me and so many other people, it's terrible.",
  "BARTIROMO: She said she didn't do it for political reasons.",
  "Susan Rice...\n\n(CROSSTALK)\n\nTRUMP: — does anybody really believe that?",
  "Nobody believes that, even the people that try to protect her in the news media.",
  "It's such a big story and I'm sure it will continue forward.",
  "But what they did is horrible.",
  "TRUMP: Well, I think many.",
  "We are going to have we are going to have tax reform at some point very soon.",
  "I think we're doing very well on health care.",
  "It's been very much misreported that we failed with health care.",
  "We haven't failed, we're negotiating and we continue to negotiate and we will save perhaps $900 billion.",
  "You know, if you look at the kind of numbers that we're talking about, that's all going back into the taxes.",
  "And we have to do health care first to pick up additional money so that we get great tax reform.",
  "So we're going to have a phenomenal tax reform.",
  "But I have to do health care first.",
  "I want to do it first to really do it right.",
  "Health care has been going along — you know, it's in negotiations (INAUDIBLE) and it's just a negotiation.",
  "And it's going to take a little while longer, but as you're probably hearing, Congress is coming along.",
  "We have some great people in Congress.",
  "They want it to happen.",
  "We will have no Democrats.",
  "Zero.",
  "That means we have to get close to 100 percent of the Republicans, not an easy way to run a government.",
  "You saw that with Justice Gorsuch, which is — who we're very proud of.",
  "He had no — almost no Democratic support, even though he was central casting, like the perfect Supreme Court judge.",
  "So we'll see what happens.",
  "I think we're doing very well with health care, which surprises — that's like breaking news, but they all know it, they just don't tend to write it.",
  "And after that, we're going to start on tax reform and infrastructure.",
  "BARTIROMO: But do you have to do health care before tax reform...\n\nTRUMP: Yes.",
  "BARTIROMO: When I speak with business managers, they say tax reform is so much more impactful to moving the needle on economic growth...\n\nTRUMP: And they're right.",
  "They're all right.",
  "But because I'm saving a tremendous amount — hundreds and hundreds of millions of dollars we're saving on health care.",
  "So we're going to have a much better plan than ObamaCare, which is failing.",
  "Even now, as I came in here, they're saying payments have to be made that weren't scheduled to be made on ObamaCare.",
  "If you don't make them, it fails.",
  "I mean, you know, it's just a mess.",
  "ObamaCare is a total mess.",
  "So we're serving tremendous amounts of money on health care when we get this done, number one.",
  "And most importantly, actually, we're going to have great health care.",
  "And all of that saving goes into the tax.",
  "If you don't do that, you can't put any of the savings into the tax cuts and the tax reform.",
  "BARTIROMO: How do you know you're not going to have a similar battle on the tax...\n\nTRUMP: Oh, I will.",
  "BARTIROMO: — (INAUDIBLE) to be, because you've got a border adjustment tax...\n\nTRUMP: I will.",
  "BARTIROMO: — the deductions, so...\n\nTRUMP: That's right.",
  "BARTIROMO: — who's to say that tax reform doesn't fail the way the bill — the House bill did?",
  "TRUMP: I think tax reform will be easier, but it's going to be tough.",
  "You have a lot of people out there that want — you know, they have their own agendas, including a lot of supporters of different people that are in Congress.",
  "They have their own agendas.",
  "They want certain things.",
  "Tax reform is going to be tough, but it won't be as tough as health care.",
  "Health care is very, very difficult.",
  "You look at that, look at Hillary Clinton failed and you look at so many of the others.",
  "And ObamaCare failed.",
  "ObamaCare was just, you know, they just, in the end, just gave up just to get the vote.",
  "You look at what they had to do in Nebraska, where they essentially gave it away to Nebraska to get that final vote.",
  "BARTIROMO: And we know the premiums up 116 percent (INAUDIBLE)...\n\nTRUMP: The premiums, oh, the premiums...\n\nBARTIROMO: — in Arizona and across the country.",
  "TRUMP: Are many, many of the — and this is going to be a much worse year than last year for ObamaCare.",
  "So ObamaCare is a disaster.",
  "It's really gone.",
  "Essentially, it's gone.",
  "If ObamaCare isn't bailed out almost on a monthly basis, it fails.",
  "It immediately fails.",
  "We have a great health care plan that I think will happen and if it happens, then I go immediately to tax reform.",
  "And that will happen.",
  "That will be easier than health care.",
  "BARTIROMO: How are you on the border adjustment tax?",
  "Have you decided?",
  "TRUMP: I haven't really wanted to talk about it.",
  "I have my own feelings.",
  "I don't like the word adjustment, because our country gets taken advantage of, to use a nice term, by every other country in the world.",
  "So when I hear border adjustment, adjustment means we lose.",
  "We lose.",
  "So I don't like the term border adjustment.",
  "BARTIROMO: Any tax at the border?",
  "TRUMP: Weak.",
  "Let's call it an import tax.",
  "Let's call it a reciprocal tax.",
  "You know, we have...\n\nBARTIROMO: So it's in there.",
  "You want a...\n\nTRUMP: We have countries, Maria, that charge us — our companies — 100 percent tax if they sell a motorcycle or if they sell — they make it in America, they make it in the United States, they sell it various countries.",
  "They sell very low, because the tax is 100 percent in some countries.",
  "The tax is 50 percent, 30 percent, 40 percent.",
  "But if they make a motorcycle and they sell it back into the United States, they have no tax.",
  "And do you think that's fair?",
  "And do you think that's smart?",
  "So I love the idea of reciprocal.",
  "You can call it a reciprocal or a matching tax or a mirror tax.",
  "There are numerous terms.",
  "BARTIROMO: Yes.",
  "TRUMP: But the reciprocal tax is very important.",
  "And you know the funny thing is that nobody gets angry when you say reciprocal tax.",
  "When you say we're going to charge a border tax — we'd be a rich nation if we did it, by the way...\n\nBARTIROMO: (INAUDIBLE).",
  "TRUMP: — but, you know...\n\nBARTIROMO: It sounds easier (INAUDIBLE)...\n\nTRUMP: — but that — nobody cares about that.",
  "But when you say reciprocal, nobody fights you.",
  "When you say I'm going to charge a 10 percent or a 20 percent border tax, everyone goes crazy, because they like free trade.",
  "Well, they don't say that the other countries are charging you much more than that.",
  "But when you say a reciprocal tax — and I'm not saying that's what I'm doing, but there has to be a certain reciprocal nature to it.",
  "But when you say reciprocal tax, nobody can get angry.",
  "Even the other countries, if like — if they're charging you a 50 percent tax, you say, OK, whatever you charge, we're charging.",
  "BARTIROMO: Like China and [India].",
  "TRUMP: They may not like it, but they can't get angry because they can't win that battle.",
  "BARTIROMO: What if you have a debate, you can't get to an agreement on that, do you prefer just cutting taxes?",
  "If you had to one, can you do just...\n\nTRUMP: Yes, well, we...\n\nBARTIROMO: — corporate tax cuts?",
  "TRUMP: — could keep trade and we could keep certain things separate.",
  "We may put it in the tax code or we may keep it separate.",
  "We have a lot of different things.",
  "And don't forget, we're going to be bringing back, as part of this, I think the number is closer — closer to $5 trillion.",
  "You know, you've been hearing — you've been using — and you keep using it, $2.5 trillion, right?",
  "BARTIROMO: (INAUDIBLE).",
  "TRUMP: But the money — the corporate inversions and the money over there is $2.5 trillion.",
  "So I think that money — because we've been saying that number for, what, five years now, would you say?",
  "So I know it's much more.",
  "It's probably $5 trillion or $4 trillion.",
  "That money is coming back.",
  "We're going to charge a very small tax on that money and the companies are going to bring that money back into the United States and do lots of good things with it.",
  "Right now, they can't bring it back.",
  "And it's not only the high techs, it's also because the bureaucracy is so horrible.",
  "I have friends who want to bring money back.",
  "Even if they were willing to pay the tax, which very few people are willing, the bureaucracy, the paperwork, the work to get it in, it's not worth it.",
  "BARTIROMO: Which is why you're rolling back these (INAUDIBLE)...\n\nTRUMP: Oh, I'm...\n\n(CROSSTALK)\n\nBARTIROMO: — through your executive orders.",
  "You're rolling back regulations.",
  "TRUMP: I have gotten...\n\nBARTIROMO: So if you had to do one...\n\nTRUMP: — rid of regulations...\n\nBARTIROMO: — corporate tax or individual tax, what's more important, if you had to do one this year?",
  "TRUMP: Both.",
  "Both.",
  "BARTIROMO: Both?",
  "TRUMP: Both.",
  "I almost think individual from my standpoint, because, you know, the middle class has just been taken advantage of in this country for so many years.",
  "But in terms of jobs, I mean I think both, but I think probably corporate.",
  "But they kind of both go hand in hand.",
  "It's not going to matter.",
  "BARTIROMO: Have you moved off of this soft deadline that your team put in place of August to get this done?",
  "Are you looking at the — later in the year?",
  "TRUMP: Well, you know, I put a deadline on health care and the fake news immediately went crazy, because when I didn't make the deadline, although I was...\n\n(CROSSTALK)\n\nTRUMP: — negotiating — don't forget, I said — and it's true, I didn't even say take a vote.",
  "I say withdraw.",
  "Well, that same thing is being negotiated and great points are being won and lost, but great points are being won that are going to lower premiums and make our health care incredible.",
  "But by putting a deadline, they say, oh, Trump didn't make it, he didn't make it.",
  "Now, look, so I don't want to put deadlines.",
  "Health care is going to happen at some point.",
  "Now, if it doesn't happen fast enough, I'll start the taxes.",
  "But the tax reform and the tax cuts are better if I can do health care first.",
  "BARTIROMO: What about infrastructure?",
  "How do you see it, when do you see it?",
  "TRUMP: A hundred percent.",
  "Very soon.",
  "I see it as part, perhaps, of the health care plan, because phase two of the health care plan, in order to get the votes, I need 60 percent for that and if I put that in, the Democrats are actually going to love the infrastructure plan.",
  "So we're going to actually — I believe, despite their tremendous hostility for years — this isn't just for Trump.",
  "This is for years it's been so hostile.",
  "You know, Maria, when I used to come to Washington, because I've been a very political person all my life, even though not on this side of the equation.",
  "But I've been very, very political.",
  "I used to see Democrats and Republicans.",
  "They were best friends.",
  "And they'd fight a little bit during the day and then they'd have dinner with their families at night.",
  "You'd see them at restaurants.",
  "I used to joke with the business and, you know, Republicans...\n\nBARTIROMO: They would have a coffee together?",
  "TRUMP: Yes, they'd be together.",
  "They'd have breakfast together.",
  "And then they go and fight and then they have lunch.",
  "Today, you don't see that.",
  "The level of hatred is incredible.",
  "And I'm not just saying in the last 90 days, I'm saying this has been for the last few years.",
  "It's incredibly divisive.",
  "BARTIROMO: Has it gotten in the way of getting things done?",
  "TRUMP: Well, as an example, on health care, I won't get one Democrat vote, even though many of them think it's an incredible plan.",
  "Take a look at Justice Gorsuch.",
  "You can't get better.",
  "Top of the line in every aspect.",
  "And he got three votes from the Democrats.",
  "He should have gotten all of them.",
  "He got three votes.",
  "And those three people, you know, are to be respected for doing it.",
  "But it's — there's a great level of hostility and they're putting their hatred way, way above — way above the country and the benefit to the country that, you know, things that they do can have such benefit.",
  "So I probably — I always assume no Democrat votes.",
  "Now, the good thing is we have the House.",
  "We have the Senate.",
  "And we have the White House.",
  "So we're all set.",
  "But within there, you have certain factions.",
  "You have the conservative Republicans.",
  "You have the moderate Republicans and you have to get them together.",
  "But we need close to 100 percent.",
  "That's a pretty hard thing to get.",
  "But we get it.",
  "TRUMP: OK, just so you understand, we're not going into Syria, because, you know, there were some questions.",
  "Nikki Haley is doing a great job.",
  "Rex is doing a fantastic job, our secretary of State.",
  "General McMaster, fantastic.",
  "But if you add it all up and if they take every little word, they'll say oh, they're different.",
  "Just so you understand, we're not going into Syria.",
  "But when I see people using horrible, horrible chemical weapons, which they agreed not to use under the Obama administration, but they violated it.",
  "BARTIROMO: They said they got rid of them.",
  "TRUMP: Look, what I did should have been done by the Obama administration a long time before I did it and you would have had a much better — I think Syria would be a lot better off right now than it has been.",
  "BARTIROMO: Obama pushed...\n\nTRUMP: (INAUDIBLE).",
  "BARTIROMO: — he resisted doing it.",
  "TRUMP: When I looked, he — well, he didn't do it.",
  "BARTIROMO: Right.",
  "TRUMP: I don't know what happened, but he didn't do it.",
  "And in fact, they had a big attack right after he drew the red line in the sand.",
  "They had a very big attack and everybody waited, what's going on, and nothing happened.",
  "And even the Obama people admitted he was wrong for not doing it.",
  "I will tell you that when I looked at the pictures on any show or any newspaper, but especially when you see them on television...\n\nBARTIROMO: (INAUDIBLE).",
  "TRUMP: — and you see these beautiful kids that are dead in their father's arms, or you see kids gasping for life and you know they're — it's over.",
  "It's over for them.",
  "They're hosing them down, hundreds of them.",
  "When you see that, I immediately called General Mattis.",
  "I said, what can we do?",
  "And they came back with a number of different alternatives.",
  "And we hit them very hard.",
  "Now, are we going to get involved with Syria?",
  "No.",
  "But if I see them using gas and using things that — I mean even some of the worst tyrants in the world didn't use the kind of gases that they used.",
  "And some of the gases are unbelievably potent.",
  "So when I saw that, I said we have to do something.",
  "BARTIROMO: Does the strike against Syria give more leverage to Rex Tillerson ahead of his meeting with his counterpart in Russia?",
  "TRUMP: I don't know.",
  "I don't know.",
  "I can't tell you.",
  "But I'll let you know soon, because they're going to be finishing that meeting pretty soon.",
  "Rex is doing an outstanding job.",
  "He's been — he's got a great sense.",
  "Look, he ran ExxonMobil for many years and it was flawlessly run.",
  "And he's doing a really, really good job.",
  "We're proud of him.",
  "But he's over in Russia.",
  "He's going soon.",
  "He's going to have meetings and then he's coming back and I'll certainly let us know.",
  "BARTIROMO: What's the message that you want him to deliver...\n\nTRUMP: Well, I think the message is...\n\nBARTIROMO: — to the Russians?",
  "TRUMP: — number one, you should have peace in Syria.",
  "It's enough.",
  "And frankly, you know, we talked the chemicals, because, you know, people just don't see this, the level of brutality, the level of viciousness.",
  "But when they drop barrel bombs and bombs of any kind right on top of a civilian population, that's the worst thing — I've never seen anything like it.",
  "And frankly, Putin is backing a person that's truly an evil person.",
  "And I think it's very bad for Russia.",
  "I think it's very bad for mankind.",
  "It's very bad for this world.",
  "But when you drop gas or bombs or barrel bombs — they have these massive barrels with dynamite and they drop them right in the middle of a group of people.",
  "And in all fairness, you see the same kids — no arms, no legs, no face.",
  "This is an animal.",
  "And I really think that there's going to be a lot of pressure on Russia to make sure that peace happens, because, frankly, if Russia didn't go in and back this animal, you wouldn't have a problem right now.",
  "He was going to be overthrown.",
  "I thought he was gone.",
  "He had another week.",
  "I mean he was finished.",
  "He had nothing, nothing.",
  "And then Russia came in and saved him.",
  "And then Obama made one of the worst deals in history with the Iran deal.",
  "So you really have Iran and you have Russia and you have Assad.",
  "BARTIROMO: You redirected navy ships to go toward the Korean Peninsula.",
  "What we are doing right now in terms of North Korea?",
  "TRUMP: You never know, do you?",
  "You never know.",
  "BARTIROMO: That's all (INAUDIBLE)...\n\nTRUMP: You know I don't think about the military.",
  "BARTIROMO: Yes.",
  "TRUMP: I'm not like Obama, where they talk about in four months we're waiting — we're going to hit Mosul.",
  "BARTIROMO: Right.",
  "TRUMP: And in the meantime, they get ready and like you've never seen — look, they're still fighting.",
  "Mosul was supposed to last for a week and now they've been fighting it for many months and so many more people died.",
  "I don't want to talk about it.",
  "We are sending an armada, very powerful.",
  "We have submarines, very powerful, far more powerful than the aircraft carrier, that I can tell you.",
  "And we have the best military people on Earth.",
  "And I will say this.",
  "He is doing the wrong thing.",
  "He is doing the wrong thing.",
  "BARTIROMO: Do you...\n\nTRUMP: He's making a big mistake.",
  "BARTIROMO: — do you think he's mentally fit?",
  "TRUMP: I don't know.",
  "I don't know.",
  "I don't know him.",
  "But he's doing the wrong thing.",
  "I have a very, very good meeting with President Xi of China.",
  "I really liked him.",
  "We had a great chemistry, I think.",
  "I mean at least I had a great chemistry — maybe he didn't like me, but I think he liked me.",
  "We were going to have a 10 or a 15 minute sit-down.",
  "It lasted for three hours.",
  "Then the next day, it was another schedule, because everything is very orderly with the Chinese, frankly.",
  "And we had meetings scheduled.",
  "Well, the 15 minutes on the first day lasted for three hours.",
  "The 15 minutes on the second day lasted for two hours, just one-on-one, the two of us with interpreters.",
  "And I mean we understand each other.",
  "I think he's, you know, a person that I got along with really well.",
  "We had a good chemistry, yes.",
  "BARTIROMO: Did he give you any suggestion that he would help...\n\nTRUMP: Well...\n\nBARTIROMO: — with North Korea?",
  "TRUMP: We had the meeting.",
  "BARTIROMO: Did you get into trade and currency?",
  "TRUMP: The first thing I brought up was North Korea.",
  "I said you've got to help us with North Korea, because we can't allow it.",
  "And it's not good for you.",
  "And you have a tremendous power because of trade.",
  "Now, he then explains thousands of years of history with Korea.",
  "Not that easy.",
  "In other words, not as simple as people would think.",
  "They've had tremendous conflict with Korea over the years.",
  "Now, his father was in China four times.",
  "He was never in China.",
  "So I said, look, you have a tremendous power because of trading through the border.",
  "If they don't get food, they don't get, you know, they can't sell their coal.",
  "In fact, I hear today two massive coal ships from North Korea were sent back to North Korea, heading to China.",
  "They were sent back, which is a very good sign.",
  "But I think China can help us.",
  "I hope China can help us.",
  "We talked about trade and I can tell you, China will do much better on trade if they help us with North Korea.",
  "BARTIROMO: And you think he knows that?",
  "TRUMP: I think he knows that.",
  "I told him that, yes.",
  "BARTIROMO: When you were with the president of China, you're launching these military strikes.",
  "TRUMP: Yes.",
  "BARTIROMO: Was that planned?",
  "How did that come about that it's happening right then, because right there, you're saying a reminder, here's who the superpower in the world is, right?",
  "TRUMP: You have no idea how many people want to hear the answer to this.",
  "I have had — I have watched speculation for three days now on what that was like (INAUDIBLE).",
  "BARTIROMO: When did you tell him?",
  "TRUMP: But I'll tell you (INAUDIBLE)...\n\nBARTIROMO: Before dessert or what?",
  "TRUMP: But I will tell you, only because you've treated me so good for so long, I have to (INAUDIBLE) right?",
  "I was sitting at the table.",
  "We had finished dinner.",
  "We're now having dessert.",
  "And we had the most beautiful piece of chocolate cake that you've ever seen and President Xi was enjoying it.",
  "And I was given the message from the generals that the ships are locked and loaded, what do you do?",
  "And we made a determination to do it, so the missiles were on the way.",
  "And I said, Mr. President, let me explain something to you.",
  "This was during dessert.",
  "We've just fired 59 missiles, all of which hit, by the way, unbelievable, from, you know, hundreds of miles away, all of which hit, amazing.",
  "BARTIROMO: Unmanned?",
  "Brilliant.",
  "TRUMP: It's so incredible.",
  "It's brilliant.",
  "It's genius.",
  "Our technology, our equipment, is better than anybody by a factor of five.",
  "I mean look, we have, in terms of technology, nobody can even come close to competing.",
  "Now we're going to start getting it, because, you know, the military has been cut back and depleted so badly by the past administration and by the war in Iraq, which was another disaster.",
  "So what happens is I said we've just launched 59 missiles heading to Iraq and I wanted you to know this.",
  "And he was eating his cake.",
  "And he was silent.",
  "BARTIROMO: (INAUDIBLE) to Syria?",
  "TRUMP: Yes.",
  "Heading toward Syria.",
  "In other words, we've just launched 59 missiles heading toward Syria.",
  "And I want you to know that, because I didn't want him to go home.",
  "We were almost finished.",
  "It was a full day in Palm Beach.",
  "We're almost finished and I — what does he do, finish his dessert and go home and then they say, you know, the guy you just had dinner with just attacked a country?",
  "BARTIROMO: How did he react?",
  "TRUMP: So he paused for 10 seconds and then he asked the interpreter to please say it again.",
  "I didn't think that was a good sign.",
  "And he said to me, anybody that uses gases — you could almost say or anything else — but anybody that was so brutal and uses gases to do that young children and babies, it's OK.\n\nBARTIROMO: He agreed.",
  "TRUMP: He was OK with it.",
  "He was OK.",
  "I'll tell you, we get along really well.",
  "I really like being with him.",
  "I'm going to be speaking to him tonight at 10:00, actually.",
  "I have a call tonight at 10:00.",
  "It's all set up with the president of China.",
  "But we got along — there was a great feeling, I think, between both of us.",
  "Now, we have two very different countries, two very different peoples.",
  "But I think he understood the message and I understood what he was saying to me."
]