[
  "WASHINGTON (AP) — Last August, a handwritten ledger surfaced in Ukraine with dollar amounts and dates next to the name of Paul Manafort, who was then Donald Trump's campaign chairman.",
  "Ukrainian investigators called it evidence of off-the-books payments from a pro-Russian political party — and part of a larger pattern of corruption under the country's former president.",
  "Manafort, who worked for the party as an international political consultant, has publicly questioned the ledger's authenticity.",
  "Now, financial records newly obtained by The Associated Press confirm that at least $1.2 million in payments listed in the ledger next to Manafort's name were actually received by his consulting firm in the United States.",
  "They include payments in 2007 and 2009, providing the first evidence that Manafort's firm received at least some money listed in the so-called Black Ledger.",
  "The two payments came years before Manafort became involved in Trump's campaign, but for the first time bolster the credibility of the ledger.",
  "They also put the ledger in a new light, as federal prosecutors in the U.S. have been investigating Manafort's work in Eastern Europe as part of a larger anti-corruption probe.",
  "Separately, Manafort is also under scrutiny as part of congressional and FBI investigations into possible contacts between Trump associates and Russia's government under President Vladimir Putin during the 2016 U.S. presidential campaign.",
  "The payments detailed in the ledger and confirmed by the documents obtained by the AP are unrelated to the 2016 presidential campaign and came years before Manafort worked as Trump's unpaid campaign chairman.",
  "In a statement to the AP on Tuesday, Manafort did not deny that his firm received the money but said \"any wire transactions received by my company are legitimate payments for political consulting work that was provided.",
  "I invoiced my clients and they paid via wire transfer, which I received through a U.S.",
  "bank.\"",
  "Manafort noted that he agreed to be paid according to his \"clients' preferred financial institutions and instructions.\"",
  "On Wednesday, Manafort's spokesman Jason Maloni provided an additional statement to the AP, saying that Manafort received all of his payments via wire transfers conducted through the international banking system.",
  "\"Mr. Manafort's work in Ukraine was totally open and appropriate, and wire transfers for international work are perfectly legal,\" Maloni said.",
  "He noted that Manafort had never been paid in cash.",
  "Instead, he said Manafort's exclusive use of wire transfers for payment undermines the descriptions of the ledger last year given by Ukrainian anti-corruption authorities and a lawmaker that the ledger detailed cash payments.",
  "Previously, Manafort and Maloni have maintained the ledger was fabricated and said no public evidence existed that Manafort or others received payments recorded in it.",
  "The AP, however, identified in the records two payments received by Manafort that aligned with the ledger: one for $750,000 that a Ukrainian lawmaker said last month was part of a money-laundering effort that should be investigated by U.S. authorities.",
  "The other was $455,249 and also matched a ledger entry.",
  "The newly obtained records also expand the global scope of Manafort's financial activities related to his Ukrainian political consulting, because both payments came from companies once registered in the Central American country of Belize.",
  "Last month, the AP reported that the U.S. government has examined Manafort's financial transactions in the Mediterranean country of Cyprus as part of its probe.",
  "Federal prosecutors have been looking into Manafort's work for years as part of an effort to recover Ukrainian assets stolen after the 2014 ouster of Ukrainian President Viktor Yanukovych, who fled to Russia.",
  "No charges have been filed as part of the investigation.",
  "Manafort, a longtime Republican political operative, led the presidential campaign from March until August last year when Trump asked him to resign.",
  "The resignation came after a tumultuous week in which The New York Times revealed that Manafort's name appeared in the Ukraine ledger — although the newspaper said at the time that officials were unsure whether Manafort actually received the money — and after the AP separately reported that he had orchestrated a covert Washington lobbying operation until 2014 on behalf of Ukraine's pro-Russian Party of Regions.",
  "On Wednesday, Maloni told the AP that Manafort intends to register with the Justice Department as a foreign agent for work he did on behalf of political interests in Ukraine.",
  "Manafort began discussions with the U.S. government about his lobbying activities after Trump hired him in March 2016, Maloni said, although it was unclear whether those conversations occurred before or after Trump forced Manafort to resign in August.",
  "By registering retroactively, Manafort will be acknowledging that he failed to properly disclose his work to the Justice Department as required by federal law.",
  "Manafort has recently been given guidance by federal authorities related to whether he should register as a foreign agent, Maloni said.",
  "Asked by the AP whether Manafort intends to register as a foreign agent, Maloni said, \"Yes, he is registering.\"",
  "Also Wednesday, one of the Washington lobbying firms involved in that covert campaign, the Podesta Group Inc., formally registered with the Justice Department under the Foreign Agents Registration Act.",
  "In doing so, it acknowledged that its work at the time could have principally benefited the Ukrainian government.",
  "The firm, run by the brother of Hillary Clinton presidential campaign chairman John Podesta, reported being paid more than $1.2 million for its efforts.",
  "It cited unspecified \"information brought to light in recent months\" and conversations with Justice Department employees as the reason for its decision.",
  "The other firm, Mercury LLC, later said it also will register as a foreign agent over its work on the campaign.",
  "Officials with the Ukrainian National Anti-Corruption Bureau, which is investigating corruption under Yanukovych, have said they believe the ledger is genuine.",
  "But they have previously noted that they have no way of knowing whether Manafort received the money listed next to his name.",
  "The bureau said it is not investigating Manafort because he is not a Ukrainian citizen.",
  "Still, Manafort's work continues to draw attention in Ukrainian politics.",
  "Last month, Ukrainian lawmaker Serhiy Leshchenko revealed an invoice bearing the letterhead of Manafort's namesake company, Davis Manafort, that Leshchenko said was crafted to conceal a payment to Manafort as a purchase of 501 computers.",
  "The AP provided to Manafort the amounts of the payments, dates and number of the bank account where they were received.",
  "Manafort told the AP that he was unable to review his own banking records showing receipt of the payments because his bank destroyed the records after a standard 7-year retention period.",
  "He said Tuesday the \"computer sales contract is a fraud.\"",
  "\"The signature is not mine, and I didn't sell computers,\" he said in a statement.",
  "\"What is clear, however, is individuals with political motivations are taking disparate pieces of information and distorting their significance through a campaign of smear and innuendo.\"",
  "Leshchenko said last month the 2009 invoice was one of about 50 pages of documents, including private paperwork and copies of employee-issued debit cards, that were found in Manafort's former Kiev office by a new tenant.",
  "The amount of the invoice — $750,000— and the payment date of Oct. 14, 2009, matches one entry on the ledger indicating payments to Manafort from the Party of Regions.",
  "The invoice was addressed to Neocom Systems Ltd., a company formerly registered in Belize, and included the account and routing numbers and postal address for Manafort's account at a branch of Wachovia National Bank in Alexandria, Virginia.",
  "The AP had previously been unable to independently verify the $750,000 payment went to a Manafort company, but the newly obtained financial records reflect Manafort's receipt of that payment.",
  "The records show that Davis Manafort received the amount from Neocom Systems the day after the date of the invoice.",
  "A $455,249 payment in November 2007 also matches the amount in the ledger.",
  "It came from Graten Alliance Ltd., a company that had also been registered in Belize.",
  "It is now inactive.",
  "In an interview with the AP, Leshchenko contended that Yanukovych, as Ukraine's leader, paid Manafort money that came from his government's budget and was \"stolen from Ukrainian citizens.\"",
  "He said: \"Money received by Manafort has to be returned to the Ukrainian people.\"",
  "Leshchenko said U.S. authorities should investigate what he described as corrupt deals between Manafort and Yanukovych.",
  "\"It's about a U.S. citizen and money was transferred to a U.S. bank account,\" he said.",
  "Maloni accused Leshchenko on Wednesday of changing his story, saying Leshchenko had previously said the ledger detailed cash payments but now said that wire transfers support his allegations.",
  "Maloni said Leshchenko's allegations were politically motivated because Manafort once supported an opposing political party.",
  "\"There is absolutely nothing improper with this method of payment and there is no basis to give any credibility to the current Leshchenko allegations to the contrary,\" Maloni said.",
  "As the AP reported last month, U.S. authorities have been looking into Manafort's financial transactions in Cyprus.",
  "The records of Manafort's Cypriot transactions were requested by the U.S. Treasury Department Financial Crimes Enforcement Network, which works internationally with agencies to track money laundering and the movement of illicit funds around the globe.",
  "Dozens of Ukrainian political figures mentioned in the Black Ledger are under investigation in Ukraine.",
  "The anti-corruption bureau, which has been looking into the Black Ledger, publicly confirmed the authenticity of the signature of one top official mentioned there.",
  "In December, the bureau accused Mykhaylo Okhendovsky of receiving more than $160,000 from Party of Regions officials in 2012, when he was Ukraine's main election official.",
  "The bureau said it would identify more suspects in the coming months.",
  "___\n\nAssociated Press writers Nataliya Vasilyeva contributed reporting from Kiev and Moscow, and Lynn Berry from Washington.",
  "___\n\nReach the AP's Washington investigative team at https://www.ap.org/tips."
]