[
  "Sessions recuses himself from any Michael Flynn investigation\n\nAttorney General Jeff Sessions said Friday that his recusal from Justice Department investigations into the 2016 campaign for president will extend into inquiries into the activities of former national security adviser Michael Flynn, under fire for his ties to foreign governments.",
  "“My recusal deals with the campaign issues,” Sessions told NBC’s “Today” show.",
  "“But I would expect not to be involved in this one.”\n\nStory Continued Below\n\n\"You would recuse yourself from any decision dealing with general Flynn?\"",
  "asked Today anchor Matt Lauer.",
  "\"Yeah,\" Sessions replied.",
  "Flynn, a former head of the Defense Intelligence Agency who served briefly as President Donald Trump’s national security adviser, has been the subject of scrutiny in recent weeks amid reports surrounding lobbying work he did for the Turkish government and a paid speech he delivered at an event for RT, a propaganda arm of the Russian government.",
  "Sessions, too, has been tied to Russia: The attorney general recused himself from the Justice Department’s investigation into Russian interference in last year’s election amid reports that he had met on multiple occasions with Russia’s ambassador to the U.S. during the campaign even though he had testified during his Senate confirmation hearing that he had not interacted with Russian officials.",
  "The most reliable politics newsletter.",
  "Sign up for POLITICO Playbook and get the latest news, every morning — in your inbox.",
  "Email Sign Up By signing up you agree to receive email newsletters or alerts from POLITICO.",
  "You can unsubscribe at any time.",
  "Sessions later explained the discrepancy by saying he had met with the ambassador in his capacity as a senator and not as a representative of Trump’s campaign, for which he was a high-profile surrogate.",
  "On Thursday, the Pentagon’s inspector general announced that it had opened an investigation into Flynn, who left the Defense Department in 2014 but maintained a security clearance that was last renewed in 2016.",
  "But while the FBI has acknowledged that it is investigating Russian interference in last year’s election as well as possible ties between Trump’s presidential campaign and the Kremlin, Sessions said he was unaware of any specific investigation into Flynn.",
  "“I really don't know whether there's an investigation or should be,” Sessions said.",
  "“And we don't confirm investigations of – you know, in the Department of Justice.”"
]