[
  "Deputy Attorney General Rod J. Rosenstein, speaking before lawmakers Friday, defended his controversial memo criticizing former FBI director James B. Comey — a document the White House initially used to justify the firing of Comey.",
  "“Former Department of Justice officials from both political parties have criticized Director Comey’s decisions,” Rosenstein said in an opening statement before the House of Representatives, remarks devoted largely to repeating his charge that Comey mishandled the investigation into Hillary Clinton’s use of a private email server when she was secretary of state.",
  "“It was not just an isolated mistake; the series of public statements about the email investigation, in my opinion, departed from the proper role of the FBI director and damaged public confidence in the bureau and the department,” Rosenstein said.",
  "“My memorandum is not a legal brief; these are not issues of law,” said Rosenstein, a longtime federal prosecutor.",
  "“It is a candid internal memorandum about the FBI director’s public statements concerning a high-profile criminal investigation.”\n\nThe House briefing capped a chaotic week on Capitol Hill, as lawmakers continued to grapple with Comey’s firing and a wave of new reports about President Trump’s behavior and the federal probe of possible collusion between his associates and the Russian government.",
  "(Amber Ferguson/The Washington Post)\n\nIn the days after Comey’s firing, some lawmakers, former Justice officials and people who knew Rosenstein wondered if he had been forced to write the politically charged memo for Trump.",
  "But Rosenstein, who was only recently confirmed as the Justice Department’s second-highest ranking official, left no doubt that it was voluntary.",
  "“I wrote it,” Rosenstein said.",
  "“I believe it.",
  "I stand by it.”\n\n“Notwithstanding my personal affection for Director Comey, I thought it was appropriate to seek a new leader,” Rosenstein said.",
  "“I wrote a brief memorandum to the attorney general summarizing my long-standing concerns about Director Comey’s public statements concerning the Secretary Clinton email investigation.",
  "I chose the issues to include in my memorandum.”\n\nRosenstein said he learned on May 8 that Trump was going to fire Comey and the president “sought my advice and input.”\n\nPresident Trump told Russian diplomats during a May 10 meeting in the Oval Office that the firing of Comey had relieved “great pressure” on him, according to the New York Times.",
  "“I just fired the head of the FBI,” Trump said, according to the Times account.",
  "“He was crazy, a real nut job.",
  "I faced great pressure because of Russia.",
  "That’s taken off.”\n\nTrump also told the Russians, as he has said publicly, “I’m not under investigation.”\n\nAfter Rosenstein was nominated by Trump to be deputy attorney general, a friend of Comey’s told the FBI director that he was encouraged by Rosenstein’s nomination and likely Senate confirmation, according to an account of the conversation in the New York Times.",
  "But Comey did not completely agree with his friend, Ben Wittes, a senior fellow at the Brookings Institution and the editor in chief of the Lawfare blog.",
  "“[Comey] said, ‘I don’t know.",
  "I have some concerns.",
  "He’s good, he’s solid but he’s also a survivor and you don’t survive that long without making some compromises and I’m concerned about that,” according to the Times account.",
  "Comey has agreed to publicly testify before the Senate Intelligence Committee sometime after Memorial Day, committee chairman Richard Burr (R-N.C.) and Sen. Mark R. Warner (D-Va.) announced Friday.",
  "[Who is Rod Rosenstein?",
  "With Sessions’s recusal, official poised to oversee probe into Russian interference in 2016 race]\n\nRosenstein had briefed the full Senate on Thursday at an event that left several key questions unanswered, including what exactly Trump said to Rosenstein when he told him Comey would be fired, and to what degree congressional investigators will maintain access to witnesses and documents given Rosenstein’s appointment of Robert S. Mueller III, a former FBI director, as special counsel.",
  "Those issues were not resolved with Rosenstein’s speech to members of the House on Friday.",
  "He told House members only that he appointed a special counsel to restore Americans’ faith in the Russia investigation, saying that interference in U.S. elections should not be a partisan issue.",
  "The moment brought applause from most lawmakers present, according to several House members.",
  "But Democrats, in particular, left the meeting frustrated that Rosenstein was not more forthcoming with information about Trump’s decision to fire Comey.",
  "Several said they learned nothing new from speaking with him.",
  "Rep. Charlie Crist (D-Fla.) described the meeting as a “brief presentation followed by a Q and A.",
  "And not a whole lot of A.”\n\nRep. Jim Himes (D-Conn.) recalled the “dissonant moment” when Rosenstein refused to say “who had asked him, if anyone had asked him, to write his memorandum.”\n\n“He said, ‘That is Bob Mueller’s purview,’ and that was puzzling to a lot of us,” said Himes, a member of the House Intelligence Committee.",
  "Several lawmakers have expressed concerns that the new special counsel investigation may impede the congressional investigations.",
  "Rosenstein assured House members that the Justice Department would work with members of Congress “to coordinate our parallel efforts” and establish a point of contact for Mueller.",
  "“You can never get guidance from the executive branch about how Congress is to do something because there’s inherently always going to be tension,” said Rep. Darrell Issa (R-Calif.).",
  "“Congress is going to want to look over the shoulder of this investigation .",
  ".",
  ".",
  "the executive branch will always try to limit that for fear that it would contaminate a potential criminal investigation for leaks, all the while sometimes leaks occur in the executive branch.",
  "So I don’t expect this to be any different.”\n\nRosenstein also told the lawmakers that he is “not aware” of any request by the FBI for additional resources for the investigation of Russian interference in the 2016 presidential election.",
  "“Moreover,” he said, “I consulted my staff and acting FBI director Andrew McCabe, and none of them recalls such a request.”"
]