[
  "In an NBC News exclusive interview, President Trump revealed to Lester Holt that he was preparing to fire FBI Director James Comey regardless of recommendations from the attorney general and deputy attorney general.",
  "TRUMP: Look, he's a showboat.",
  "He's a grandstander.",
  "The FBI has been in turmoil.",
  "You know that, I know that, everybody knows that.",
  "You take a look at the FBI a year ago, it was in virtual turmoil -- less than a year ago.",
  "It hasn't recovered from that.",
  "HOLT: Monday you met with the Deputy Attorney General Rod Rosenstein.",
  "TRUMP: Right.",
  "HOLT: Did you ask for a recommendation?",
  "TRUMP: What I did is I was going to fire Comey.",
  "My decision.",
  "It was not...\n\n\n\nHOLT: You had made the decision before they came into your office (ph).",
  "TRUMP: I -- I was going to fire Comey.",
  "I -- there's no good time to do it, by the way.",
  "They...\n\n\n\nHOLT: Because in your letter, you said...\n\n\n\n(CROSSTALK)\n\n\n\nTRUMP: They -- they were...\n\n\n\nHOLT: ...I -- I accepted -- accepted their recommendations.",
  "TRUMP: Yeah, well, they also...\n\n\n\nHOLT: So, you had already made the decision.",
  "TRUMP: Oh, I was going to fire regardless of recommendation.",
  "HOLT: So, there was...\n\n\n\n(CROSSTALK)\n\n\n\nTRUMP: They -- he made a recommendation.",
  "He's highly respected.",
  "Very good guy, very smart guy.",
  "And the Democrats like him.",
  "The Republicans like him.",
  "He had made a recommendation.",
  "But regardless of recommendation, I was going to fire Comey knowing there was no good time to do it\n\n\n\nAnd in fact, when I decided to just do it, I said to myself -- I said, you know, this Russia thing with Trump and Russia is a made-up story.",
  "It's an excuse by the Democrats for having lost an election that they should've won.",
  "And the reason they should've won it is the electoral college is almost impossible for a Republican to win.",
  "It's very hard because you start off at such a disadvantage.",
  "So, everybody was thinking they should've won the election.",
  "This was an excuse for having lost an election.",
  "HOLT: But were -- are you angry...\n\n\n\n(CROSSTALK)\n\n\n\nHOLT: ...angry with Mr. Comey because of his Russia investigation?",
  "TRUMP: I just want somebody that's competent.",
  "I am a big fan of the FBI.",
  "I love the FBI.",
  "HOLT: But were you a fan of...\n\n\n\n(CROSSTALK)\n\n\n\nTRUMP: ...people of the FBI.",
  "HOLT: him taking up that investigation?",
  "TRUMP: I think that -- about the Hillary Clinton investigation?",
  "HOLT: No, about -- about the Russian investigation and possible...\n\n\n\nTRUMP: No, I don't care...\n\n\n\nHOLT: ...links between...\n\n\n\nTRUMP: Look -- look, let me tell you.",
  "As far as I'm concerned, I want that thing to be absolutely done properly.",
  "When I did this now, I said I probably maybe will confuse people.",
  "Maybe I'll expand that -- you know, I'll lengthen the time because it should be over with.",
  "It should -- in my opinion, should've been over with a long time ago because it -- all it is an excuse.",
  "But I said to myself I might even lengthen out the investigation.",
  "But I have to do the right thing for the American people.",
  "He's the wrong man for that position.",
  "HOLT: Let me ask you about your termination letter to Mr. Comey.",
  "You write, \"I greatly appreciate you informing me on three separate occasions that I am not under investigation.\"",
  "Why did you put that in there?",
  "TRUMP: Because he told me that.",
  "I mean, he told me that.",
  "HOLT: He told you, you weren't under investigation with...\n\n\n\nTRUMP: Yeah, and I...\n\n\n\nHOLT: ...regard to the Russian investigation.",
  "TRUMP: ...I've heard that -- I've heard that from others.",
  "I think...\n\n\n\nHOLT: Was it in a phone call?",
  "Did you meet face to face?",
  "TRUMP: I had a dinner with him.",
  "He wanted to have dinner because he wanted to stay on.",
  "We had a very nice dinner at the White House...\n\n\n\nHOLT: He -- he asked...\n\n\n\n(CROSSTALK)\n\n\n\nTRUMP: ...very early on.",
  "That dinner was arranged.",
  "I think he asked for the dinner.",
  "And he wanted to stay on as the FBI head.",
  "And I said I'll, you know, consider.",
  "We'll see what happens.",
  "But we had a very nice dinner.",
  "And at that time, he told you are not under investigation...\n\n\n\nHOLT: That was...\n\n\n\nTRUMP: ...which I knew anyway.",
  "HOLT: That was one meeting.",
  "When was the -- when was the other two?",
  "TRUMP: First of all, when you're under investigation, you're giving all sorts of documents and everything.",
  "I knew I wasn't under.",
  "And I heard it was stated at the committee -- at some committee level that I wasn't, number one.",
  "HOLT: So, that didn't come directly from him.",
  "TRUMP: Then, during a phone call, he said it.",
  "And then, during another phone call he said it.",
  "So, he said it once at dinner and then he said it twice during phone calls.",
  "HOLT: Did -- did you call him?",
  "TRUMP: In one case I called him and one case he called me.",
  "HOLT: And did you ask am I under investigation?",
  "TRUMP: I actually asked him, yes.",
  "I said if it's possible, would you let me know am I under investigation.",
  "He said you are not under investigation.",
  "HOLT: But he's -- he's given sworn testimony that there's an ongoing investigation into the Trump campaign and possible collusion with the Russian government.",
  "You were the centerpiece of the Trump campaign.",
  "TRUMP: Well, all I can tell you is... HOLT: So, was be being truthful when he said you weren't under investigation?",
  "TRUMP: ...well, I know whether -- I know that I'm not under investigation -- me, personally.",
  "I'm not talking about campaigns.",
  "I'm not talking about anything else.",
  "I'm not under investigation.",
  "HOLT: Did you ask him to drop the investigation?",
  "TRUMP: No, never.",
  "HOLT: Did anyone from the White House...\n\n\n\nTRUMP: No.",
  "In fact, I want the investigation speeded up...\n\n\n\n(CROSSTALK)\n\n\n\nHOLT: Did anyone from the White House ask him to -- to end the investigation?",
  "TRUMP: No, no.",
  "Why would we do that?",
  "HOLT: Any -- any surrogates on behalf of the White House?",
  "TRUMP: Not that I know of.",
  "Look, I want to find out if there was a problem with an election having to do with Russia.",
  "Or by the way any -- but -- any -- anybody else.",
  "Any other country.",
  "And I want that to be so strong and so good.",
  "And I want it to happen.",
  "I also want to have a really competent, capable director.",
  "He's not.",
  "He's a show boater.",
  "He's not my man or not my man.",
  "I didn't appoint him.",
  "He was appointed long before me.",
  "But I want somebody who's going to do a great job.",
  "And I will tell you, we're looking at candidates right now who could be spectacular.",
  "And that's what I want for the FBI.",
  "HOLT: What you said a moment ago about supporting the idea of investigation.",
  "A lot of people would find it hard to believe that the man who just said that tweeted very recently it's a total hoax.",
  "It's a taxpayer charade.",
  "TRUMP: Oh, I think that looking into me and the campaign -- look, I have nothing to do -- this was set up by the Democrats.",
  "There is no collusion between me and my campaign and the Russians.",
  "The other thing is the Russians did not affect the vote.",
  "And everybody seems to think that.",
  "HOLT: There is an investigation underway though, an FBI investigation.",
  "Is that a charade?",
  "TRUMP: Well, I don't know if it's an FBI or if it's -- there's so many investigations.",
  "I don't know if it's an FBI investigation or if it's Congress, if it's the Senate and the House...\n\n\n\nHOLT: Well, James Comey testified there was an FBI investigation...\n\n\n\nTRUMP: Well, yeah, but I think they're also helping the House and the Senate.",
  "So, you probably have FBI.",
  "But you have House, you have Senate.",
  "They have other investigations.",
  "HOLT: But when you put out tweets it's a total hoax.",
  "It's a taxpayer charade.",
  "And you're looking for a new FBI director, are you not sending that person a message to lay off?",
  "TRUMP: No, I'm not doing that.",
  "I think that we have to get back to work.",
  "But I want to find out -- I want to get to the bottom.",
  "If Russia hacked -- if Russia did anything having to do with our election, I want to know about it.",
  "HOLT: Well, there's already -- there's already intelligence from virtually every intelligence agency that yes, that happened (ph).",
  "TRUMP: I'll tell you this.",
  "If Russia or anybody else is trying to interfere with our elections, I think it's a horrible thing and I want to get to the bottom of it.",
  "And I want to make sure it will never, ever happen.",
  "HOLT: Were you angry with James Comey when he went public and said he can't support your unsubstantiated charges of wiretapping -- that your -- your predecessor wire tapped you?",
  "TRUMP: I was surprised he said it, but I wasn't angry.",
  "There's a big thing going on right now which is spying.",
  "And it's -- you can scroll to anything you want.",
  "The unmasking and the spying.",
  "And to me, that's the big story right now.",
  "That's a very, very big story.",
  "HOLT: You didn't take that as a sign that this loyalty that he came out and contradicted you?",
  "(CROSSTALK)\n\n\n\nTRUMP: No, I didn't -- I didn't -- I don't think of it as loyalty.",
  "I mean, I want whoever the director is, I want him to do the right thing.",
  "HOLT: And what about when he went public and said that there was in fact an FBI investigation looking at your campaign and Russia?",
  "Did that anger you?",
  "I -- I ask that because...\n\n\n\nTRUMP: Well, I -- I -- you know I have that...\n\n\n\nHOLT: ...there's a -- a sense that you...\n\n\n\nTRUMP: ...I have that...\n\n\n\nHOLT: ...that there was a building anger.",
  "TRUMP: No, no, no.",
  "I -- I know every once in a while, you'll see that in the newspaper, anger somebody will report or they'll have false sources that maybe don't exist because of the media -- the way the media is.",
  "No.",
  "I will tell you, I think that -- I want very simply a great FBI director.",
  "HOLT: And will you expect if they would -- they would continue on with this investigation...\n\n\n\nTRUMP: Oh, yeah, sure.",
  "I expect that.",
  "HOLT: General Flynn is a part of this investigation as you know.",
  "Sally Yates recently testified that the White House was notified that he had been compromised, he was at risk of...\n\n\n\nTRUMP: Yeah.",
  "HOLT: ...of being blackmailed.",
  "It was 18 days later that he was finally fired.",
  "During that 18 days, he had access, I assume, to all the nation's top secrets.",
  "One day you meet on the issue of Comey...\n\n\n\nTRUMP: Right.",
  "HOLT: ...and you fire him in a humiliating way, while he's sitting in a room with his colleagues and it's appearing on the TV.",
  "TRUMP: Because my White House counsel Don McGahn came back to me and did not sound like an emergency of any -- he didn't make it sound like he was, you know -- and she actually didn't make it sound that way, either in the hearings the other day.",
  "Like it had to be done immediately.",
  "This man has served for many years.",
  "He's a general.",
  "He's a, in my opinion, a very good person.",
  "I believe that it would be very unfair to hear from somebody who we don't even know and immediately run out and fire a general.",
  "Now...\n\n\n\nHOLT: The acting Attorney General at the time.",
  "TRUMP: My White House counsel came to me.",
  "They had, I believe, two meetings.",
  "And we ultimately fired -- but we fired for a different reason.",
  "HOLT: You're talking about General Flynn?",
  "TRUMP: General Flynn, yes.",
  "HOLT: Because -- because of lying to the vice president.",
  "TRUMP: Yeah, but everything plays in -- everything plays into it.",
  "But we fired him because he said something to the vice president that was not so.",
  "HOLT: Did you know that he had had -- that received payments from the Russian government?",
  "That he had...\n\n\n\nTRUMP: No.",
  "HOLT: ...received payments from the Turkish government?",
  "TRUMP: No, but Obama perhaps knew because he had clearance from the Obama administration.",
  "And his -- and -- and this is something they never want to report.",
  "He had clearance from the Obama administration, the highest clearance you can have.",
  "And I think it's a very unfair thing that the media doesn't talk about that.",
  "You know, you're talking about 2015.",
  "I don't know that I knew him in 2015.",
  "HOLT: The Senate Intelligence Committee wants information from the Treasury Department's financial crimes unit about your finances, your -- your businesses' finance.",
  "TRUMP: Yeah.",
  "HOLT: Can you tell us whether you, your family, your businesses, your surrogates have accepted any investments, any loans from Russians individuals...\n\n\n\nTRUMP: Yeah, in fact I just sent a letter...\n\n\n\nHOLT: ...or institutions?",
  "TRUMPS: ...to Lindsay Graham from one of the most prestigious law firms in the country -- a tremendous, highly rated law firm -- that I have nothing to do with Russia.",
  "I have no investments in Russia, none whatsoever.",
  "I don't have property in Russia -- a lot of people thought I owned office buildings in Moscow.",
  "I don't have property in Russia.",
  "And I am in very -- I -- I mean I -- I'm in total compliance in every way.",
  "Now, I have to tell you, I file documents -- hundreds of pages worth of documents with the Federal Elections Bureau.",
  "Everybody's seen that.",
  "I built a great company, but I'm not involved with Russia.",
  "I have had dealings over the years where I sold a house to a very wealthy Russian many years ago.",
  "I had the Miss Universe pageant, which I owned for quite a while.",
  "I had it in Moscow a long time ago.",
  "But other than that, I have nothing to do with Russia.",
  "HOLT: And one last question on this matter.",
  "Did you ever...\n\n\n\nTRUMP: And I have a certified letter, just so you understand.",
  "I'm not just saying that.",
  "I've given the letter -- I've given the letter to Senator Lindsay Graham.",
  "He has the letter.",
  "And I think frankly, it's -- I assume he's going to give the letter out.",
  "But it says: \"I am not involved in Russia.\"",
  "No loans, no nothing.",
  "HOLT: Did you worry at all when you made the decision to fire Comey when you did, the day before Lavrov was here in the White House and -- and the Russian Ambassador.",
  "Did you think through the optics of a way this would look?",
  "TRUMP: I never thought about -- it was set up a while ago.",
  "And frankly, I could've waited.",
  "But what difference does it make?",
  "I'm not looking for cosmetics.",
  "I'm looking to do a great job for the country.",
  "I'm looking to create jobs.",
  "I'm looking to create strength and security.",
  "I'm looking to have strong borders.",
  "I'm looking for things like that.",
  "I think it's really a good thing that I meet with people.",
  "Now, this is a public meeting.",
  "Because, you know, when you cover this, the people watching may say oh, he met with Lavrov.",
  "Well, this was announced that I'm meeting with Lavrov.",
  "Just like a number of days ago, I spoke -- had a very good conversation -- very public in the sense that everybody knew this was taking place.",
  "I meet -- I -- I talk all the time.",
  "Just spoke with the head of -- the new head of South Korea who just got elected.",
  "I speak with the head of India.",
  "I speak with the head of China.",
  "I have to speak with Putin also.",
  "It's called Russia.",
  "But when I spoke with Putin, he asked me whether or not I would see Lavrov.",
  "Now, what do I -- should I say no, I'm not going to see him?",
  "I said, I will see him.",
  "During that discussion with Lavrov, I think we had a great discussion having to do with Syria, having to do with the Ukraine.",
  "And maybe, that discussion will lead to a lot less people getting killed and will lead ultimately to peace.",
  "So, I'm -- I'm OK with those discussions, Lester.",
  "I think it's a good thing, not a bad thing."
]