[
  "President Donald Trump could be weighing the termination of special counsel Robert Mueller from his oversight of the federal Russia investigation, Christopher Ruddy, CEO of the conservative Newsmax Media and a friend of President Trump, told PBS NewsHour’s Judy Woodruff on Monday.",
  "“I think he’s considering perhaps terminating the special counsel.",
  "I think he’s weighing that option,” Ruddy said when asked by Woodruff whether the president was prepared to let the special counsel pursue the Russia investigation.",
  "“I think it’s pretty clear by what one of his lawyers said on television recently.”\n\n“I personally think it would be a very significant mistake,” Ruddy added.",
  "The comments come the day before Attorney General Jeff Sessions is set to testify before the Senate Intelligence Committee, the same panel before which former FBI director James Comey appeared last week.",
  "WATCH LIVE: Sessions testifies about Russia meetings in Senate hearing\n\nIn his testimony June 8, Comey detailed his meetings with Trump before he was fired May 9, including conversations in which the president referred to the Russia investigations as a cloud over his presidency.",
  "Comey also detailed conversations in which he said the president told him he hoped the director could “let go” of investigations into former National Security Adviser Michael Flynn’s contacts with Russia.",
  "READ MORE: Important takeaways from Comey’s Senate hearing\n\nRuddy told Woodruff that Trump was optimistic after the Comey hearing and “generally felt he had won a victory.”\n\n“Director Comey’s testimony once again proved that there was no obstruction” of the Russia investigations, Ruddy said, adding the president and his top aides felt that some people in Washington were trying to undermine Trump’s agenda by focusing on the investigations.",
  "Ruddy also said Mueller was under consideration for the director of the FBI before he was appointed special counsel, as reported earlier by NPR.",
  "“The president did talk with him in the days before he was named special counsel.",
  "I think there’s a conflict there,” Ruddy said.",
  "“There’s some real conflicts,” Ruddy continued.",
  "“He comes from a law firm that represents members of the Trump family.",
  "He interviewed the day before, a few days before, he was appointed special counsel, with the president, who was looking at him potentially to become the next FBI Director.",
  "That hasn’t been published, but it’s true.",
  "And I think it would be strange that he would have a confidential conversation and then a few days later become the prosecutor of the person he may be investigating.”\n\nREAD MORE: President Trump calls appointment of special counsel a ‘witch hunt’"
]