[
  "For the second time in a week, the 15 senators who sit on the Senate Intelligence Committee were responsible for questioning a key figure at the center of the Russia investigations.",
  "Here is what we learned from the testimony of Attorney General Jeff Sessions, who answered questions about his contacts with Russian officials, his recusal from the federal Russia probe, and his role in the firing of former FBI director James Comey.",
  "Why Sessions recused himself, exactly.",
  "The attorney general said he formally removed himself from any federal investigations involving President Donald Trump’s campaign because of a U.S. statute.",
  "The statute is 28 CFR 45.2, which disqualifies officials from participating in prosecutions if they have a personal or political relationship with a subject of the probe.Sessions: I recused myself from Russia investigation because of role on Trump campaign Sessions recused himself on March 2, one day after the Washington Post reported that he met with Russia’s ambassador to the U.S. Sergey Kislyak, despite testimony indicating otherwise.",
  "“Many suggested [I recused myself] because I was a subject of the investigation, but [the statute] was the reason,” Sessions said at the hearing Tuesday.",
  "Why he still was involved in Comey’s firing, despite the recusal.",
  "Senators from both parties pressed Sessions on this point.",
  "He insisted that he recused himself from a single FBI investigation — the one into Russia’s alleged ties to Trump’s campaign — and that he did not think his recusal should block his ability to conduct oversight of the FBI and its director.",
  "“I am the attorney general,” Sessions testified.",
  "“It is my responsibility to ensure the department is running properly.”\n\nREAD MORE: Sessions says he had concerns about Comey long before firing\n\nSessions does not have a legal reason for refusing to discuss his conversations with the president.",
  "In the hearing, the nation’s top law enforcement officer repeatedly declined to describe any conversation with Trump which the president himself had not already made public.",
  "Sessions applied that answer universally, from any conversations about firing Comey, to whether the president asked him to leave the room so Trump could meet alone with Comey.",
  "Senators Martin Heinrich D-N.M., Angus King, I-Maine, and Kamala Harris, D-Calif., and other Democrats focused on this issue.",
  "Some asked Sessions whether executive privilege has been invoked.",
  "No, Sessions responded.",
  "“Then what is the legal basis of your refusal?” King pressed at one point.",
  "“I am protecting the right of the president to assert [executive privilege] as he chooses,” Sessions answered, adding that he thought discussing those conversations was not appropriate.",
  "He said that was a longtime policy at the Department of Justice.",
  "Heinrich asked if this is a written policy.",
  "Sessions said he believed it was.",
  "But later, when Harris asked him the same question, Sessions acknowledged that he wasn’t sure.",
  "Harris also asked him if, ahead of the hearing, Sessions and his aides reviewed DOJ’s policies on his ability to answer questions under oath about conversations with a president.",
  "Sessions said they “talked about it,” but admitted that he was not familiar with details of the department’s policies.",
  "“I am unable to answer these questions,” Sessions said.",
  "Those close to the president don’t know if there are tapes.",
  "Asked by Sen. Marco Rubio, R-Fla, if he knows whether Mr. Trump recorded any of his conversations, Sessions replied simply, “I don’t know.” Questions remain, especially about the Comey firing.",
  "Sessions’ decision not to discuss communications with the president left many questions unanswered — in particular when Trump told him he wanted to fire Comey, and whether the president ordered him to write a letter recommending that action.",
  "The head of the National Security Agency answered a lot of questions behind closed doors.",
  "Senate Intelligence Chairman Richard Burr, R-N.C., told the hearing that on Monday night, NSA Director Michael Rogers spent two hours with the committee in closed session, and did answer the questions he had said he could not tackle in his testimony at an open session last week.",
  "Those involved his communications with the president as well as whether Rogers took notes of those communications.",
  "Meetings vs encounters.",
  "A new, potentially important word entered the Russia investigation lexicon: encounter.",
  "Sessions differentiated between his more formal meetings with Kislyak, in his Senate office and at the Republican National Convention last year, versus a more brief interaction that may or may not have happened at a VIP reception following a foreign policy speech Trump gave at a Washington, D.C., hotel in April 2016.",
  "Sessions called that last event an “encounter,” and also stressed it was so brief he doesn’t remember it.",
  "Going forward,this distinction could be useful in trying to piece together the nature of contacts in the wide-ranging Russia investigations.",
  "According to Sessions, encounters matter — but they’re not as important as a formal meeting.",
  "READ MORE: Read Jeff Sessions’ prepared Senate testimony on Russia"
]