[
  "Trump has said repeatedly that no collusion occurred.",
  "\"After 7 months of investigations & committee hearings about my 'collusion with the Russians,' nobody has been able to show any proof.",
  "Sad!\"",
  "he tweeted June 16.",
  "The White House did not comment for this story.",
  "The DNI, NSA and Mueller's office also did not comment.",
  "Because the meetings were classified, sources shared limited details.",
  "But they said the two intelligence leaders recounted conversations that appeared to show the President's deep frustration that the Russia allegations have continued to cloud his administration.",
  "The question of what the President said to Coats and Rogers has been hanging over the administration since The Washington Post reported the interactions in late May.",
  "CNN has confirmed the March interactions between the intelligence chiefs and the President in which he made the requests.",
  "These came a few days after Comey publicly confirmed for the first time the existence of the federal investigation of potential collusion between the Trump campaign and Russia.",
  "In a public Senate intelligence hearing earlier this month in which both men testified, senators in both parties grew frustrated and angry after neither would agree to clear up exactly what the President said to them.",
  "Rogers and Coats said they did not feel pressured to do anything but would not describe any details of their conversations with Trump.",
  "\"In the three-plus years that I have been the director of the National Security Agency, to the best of my recollection, I have never been directed to do anything I believe to be illegal, immoral, unethical or inappropriate, and to the best of my recollection during that same period of service I do not recall ever feeling pressured to do so,\" Rogers said during the public hearing.",
  "JUST WATCHED Ex-DHS Chief testifies on Russia meddling Replay More Videos ... MUST WATCH Ex-DHS Chief testifies on Russia meddling 02:40\n\nCoats offered a similar response.",
  "\"In my time of service, which is interacting with the President of the United States or anybody in his administration, I have never been pressured — I have never felt pressured — to intervene or interfere in any way with shaping intelligence in a political way or in relation to an ongoing investigation,\" he said.",
  "The reason for their public reticence, one congressional source told CNN, is that Coats and Rogers had asked the White House for guidance on whether their conversations with the President were protected by executive privilege, which meant they would not be allowed to discuss it.",
  "They did not get an answer from the White House before testifying and did not know how to answer the committee.",
  "The result was an awkward and contentious public hearing.",
  "JUST WATCHED Spicer not sure if Trump thinks Russia meddled Replay More Videos ... MUST WATCH Spicer not sure if Trump thinks Russia meddled 02:57\n\nIn classified follow-up meetings with the Senate intelligence committee, they were more forthcoming, according to sources familiar with the closed-door session.",
  "One congressional source expressed frustration that Coats and Rogers didn't answer the questions in public, especially since what they ended up expressing in private was that they did not feel that the President pressured either of them to do anything improper.",
  "Rogers' interaction with the President is also documented in a memo written by his deputy at the NSA, Richard Ledgett.",
  "JUST WATCHED Trump, legal team send conflicting messages Replay More Videos ... MUST WATCH Trump, legal team send conflicting messages 02:01\n\nOne congressional source who has seen the memo tells CNN that it is one page and, unlike memos written by former FBI Director James Comey, does not have many details of the conversation.",
  "Instead, it simply documents that the interaction occurred -- and makes clear that Rogers thought it was out of the ordinary.",
  "Coats did not document his conversations with the President about the issue, the source said."
]