[
  "Among its other requests, the memo also orders that any records be preserved about foreign travel by transition officials or personnel of Mr. Trump’s presidential campaign.",
  "“With this in mind,” the memo said, “please immediately suspend any deletion, modification, overwriting, or other possible destruction of the information described above, including electronic information, and take all reasonable measures to preserve this information.”\n\nIt directs recipients to turn over relevant documents to the presidential transition team.",
  "While the memo does not say so, it is the type of notice that organizations distribute after receiving a preservation order from the Justice Department — an order that all documents be preserved at the beginning of an inquiry in case investigators someday want to see them.",
  "Lawyers sometimes send these notices on their own in anticipation of such an order.",
  "The memo alerts Mr. Trump’s former transition aides that “failure to follow these protocols could result in criminal or civil penalties, and could form the basis of legal claims, legal presumptions, or jury instructions relating to spoliation of evidence.”\n\nEarlier on Thursday, the president had lashed out on Twitter about the investigation, calling it “the single greatest WITCH HUNT in American political history — led by some very bad and conflicted people!”\n\nThe document request illustrated the seriousness of the inquiry being conducted by Mr. Mueller and investigators in Congress, and how deeply they are delving into Mr. Trump’s activities and those of his associates.",
  "Last month, the Senate Intelligence Committee, which is running its own investigation of possible links between the Trump campaign and Russian meddling in the election, also asked the president’s transition team to collect and preserve all documents and materials related to Russia.",
  "The request covered the entire length of the campaign and transition, from June 2015 when Mr. Trump first announced his candidacy, to the inauguration on Jan. 20."
]