[
  "\n\nAttorney Stephen Ryan in 2007 at a House Oversight and Government Reform hearing in Washington.",
  "(Linda Davidson/The Washington Post)\n\nMIAMI — Michael Cohen, who for years has served as President Trump’s personal attorney, has hired a lawyer of his own to help him navigate the expanding Russia investigation.",
  "Cohen confirmed Friday to The Washington Post that he has retained Stephen M. Ryan, a Washington-based lawyer from the law firm McDermott, Will & Emery who has experience prosecuting criminal cases as an assistant U.S. attorney.",
  "Cohen’s hiring of Ryan as his personal lawyer was first reported by Katy Tur of NBC News.",
  "Cohen’s decision is the latest indication that the Russia probe overseen by special counsel Robert S. Mueller III is intensifying and could end up focusing on a number of Trump associates, both inside and outside the White House.",
  "[Trump lashes out at Russia probe; Pence hires a lawyer]\n\nMichael Caputo, a New York-based political operative and radio commentator who served as a senior communications adviser on Trump's campaign, also has hired a lawyer of his own to navigate the Russia probe.",
  "Caputo has retained Dennis C. Vacco, a former New York state attorney general and a partner at the law firm Lippes Mathias Wexler Friedman.",
  "His hiring also was first reported by NBC's Tur.",
  "On Thursday, Vice President Pence’s office announced that the vice president had hired outside legal counsel, Richard Cullen, to assist him with inquiries from the Mueller investigation as well as congressional committee probes.",
  "During a Friday morning event here in Miami, The Post asked Pence whether he had any comment about hiring his own lawyer.",
  "The vice president said only: “It’s very routine.",
  "Very routine.”\n\nIt is not entirely clear what role Cohen or Caputo might have in the Russia investigation.",
  "Cohen, who worked as a lawyer for the Trump Organization for a decade, made an appearance in the dossier compiled by a former British spy.",
  "The dossier, which was published online in January by BuzzFeed, alleged that he had traveled to Prague to meet with Russians and coordinate their hacking efforts.",
  "Trump has rejected the dossier as “fake news,” and Cohen has vigorously denied its allegations about him, noting he was in California at the time it alleged he had visited Prague.",
  "Congressional investigators asked President Trump's personal attorney, Michael Cohen, to turn over documents related to potential contacts with Russia and testify in front of Congress — but on May 30, Cohen said he'd refused to do so.",
  "(Peter Stevenson/The Washington Post)\n\nIn January, Cohen was involved in a separate incident that could potentially have drawn the attention of investigators.",
  "He has confirmed that he met with a Ukrainian lawmaker at a New York hotel at the urging of a former Trump business associate named Felix Sater.",
  "At the meeting, Sater gave Cohen a peace plan that the lawmaker had drawn up for his country that would have paved the way for the lifting of sanctions imposed on Russia after its 2014 military incursion in Ukraine.",
  "The New York Times reported that Cohen said he took the plan and left it in the White House office of then national security adviser Michael Flynn, days before Flynn resigned over his contacts with Russia's ambassador.",
  "Cohen told the Post that he had merely recommended Flynn as the proper recipient for the plan but that he had taken the written proposal home and thrown it away.",
  "[Amid Russia scrutiny, Trump associates received informal Ukraine peace proposal]\n\nCaputo, who briefly worked for the campaign, was an ally to former campaign chairman Paul Manafort.",
  "He lived in Moscow for several years in the 1990s, and briefly held a contract in 2000 with the Russian conglomerate Gazprom Media to improve Russian President Vladimir Putin's image in the United States."
]