[
  "President Trump and son Donald Trump Jr. (Photo illustration: Yahoo News; photos: Alex Brandon/AP, Matt York/AP)\n\nWASHINGTON — President Trump’s legal team was informed more than three weeks ago about the email chain arranging a June 2016 meeting between his son Donald Jr. and a Kremlin-connected lawyer, two sources familiar with the handling of the matter told Yahoo News.",
  "Trump told Reuters in an interview on Wednesday that he learned just “a couple of days ago” that Donald Jr. had met with the Russian lawyer, Natalia Veselnitskaya, hoping to receive information that “would incriminate Hillary” and was “part of Russia and its government’s support for Mr. Trump.” A day earlier, on Tuesday, Donald Jr. released the email exchanges himself, after learning they would be published by the New York Times.",
  "Trump repeated that assertion in a talk with reporters on Air Force One on his way to Paris Wednesday night.",
  "“I only heard about it two or three days ago,” he said, according to a transcript of his talk, when asked about the meeting with Veselnitskaya at Trump Tower in June 2016 attended by Donald Trump Jr., Paul Manafort, then Trump’s campaign chief, and Trump’s son-in-law Jared Kushner.",
  "But the sources told Yahoo News that Marc Kasowitz, the president’s chief lawyer in the Russia investigation, and Alan Garten, executive vice president and chief legal officer of the Trump Organization, were both informed about the emails in the third week of June, after they were discovered by lawyers for Kushner, who is now a senior White House official.",
  "The exchange apparently was initiated on June 3, 2016, when a Trump family associate, publicist Rob Goldstone, emailed Donald Jr. with an offer of something “very interesting” … “official documents and information” that “would be very useful to your father.” On June 8, 2016, Trump Jr. forwarded an email to Kushner and Manafort about the upcoming meeting with the subject line: “FW: Russia-Clinton-private & confidential.” Trump Jr. wrote back later that day, telling Goldstone “if it’s what you say I love it especially later in the summer.”\n\nThe discovery of the emails prompted Kushner to amend his security clearance form to reflect the meeting, which he had failed to report when he originally sought clearance for his White House job.",
  "That revision — his second — to the so-called SF-86, was done on June 21.",
  "Kushner made the change even though there were questions among his lawyers whether the meeting had to be reported, given that there was no clear evidence that Veselnitskaya was a government official.",
  "The change to the security form prompted the FBI to question Kushner on June 23, the second time he was interviewed by agents about his security clearance, the sources said.",
  "But the information that Trump’s lawyers were told about the emails in June raises questions about why they would not have immediately informed the president.",
  "Trump’s campaign is under investigation by special counsel Robert Mueller into possible collusion with Russian government officials.",
  "The emails appear to be the first hard evidence of contacts between top campaign officials and someone connected to the Kremlin.",
  "A spokesman for Kasowitz declined to comment, saying the matter involved “privileged information.” Garten did not respond to an email request for comment.",
  "Richard Painter, the former chief ethics lawyer for President George W. Bush told Yahoo News Thursday night that he finds it “weird” and “unbelievable” that Trump’s lawyers would not have informed the president about a matter so sensitive relating to the Russia investigation.",
  "“You have a professional obligation to inform the client about information that he needs to make informed decisions,” he said.",
  "That would be especially true for a client “who feels the need to comment on every last thing in the world,” he added.",
  "Pushing back the discovery of the emails to the third week in June also raises additional questions about the initial public statements made by the White House after the existence of the meeting was first reported by the New York Times on July 8.",
  "At that time, Trump Jr. issued a public statement describing the session as a “short introductory meeting” in which the primary topic of discussion was “the adoption of Russian children” by American families.",
  "The actual purpose of the meeting, to obtain damaging information about Hillary Clinton ostensibly collected by the Russian government, wasn’t mentioned in Trump’s initial statement.",
  "The next day, Reince Priebus, the White House chief of staff, said in an interview that the meeting was a “big nothing burger.”\n\nThe president himself repeatedly described the Russia investigation as “fake news” and ridiculed television networks’ reports about it.",
  "“With four months looking at Russia … under a magnifying glass, they have ‘zero tapes’ of T people colluding.",
  "There is no collusion & no obstruction.",
  "I should be given apology!” the president wrote in two tweets on June 26.",
  "The real story is that President Obama did NOTHING after being informed in August about Russian meddling.",
  "With 4 months looking at Russia… — Donald J. Trump (@realDonaldTrump) June 26, 2017\n\n\n\n\n\n..under a magnifying glass, they have zero \"tapes\" of T people colluding.",
  "There is no collusion & no obstruction.",
  "I should be given apology!",
  "— Donald J. Trump (@realDonaldTrump) June 26, 2017\n\n\n\n\n\nBut questions were raised about President Trump’s account of when he learned about the meeting, in light of a statement he made on June 7, 2016 — before the meeting, but after the email exchanges with Donald Jr. On that day, Trump promised a major address the following week that he said would describe Clinton’s “corrupt dealings” to give “favorable treatment” to foreign governments, including “the Russians.” White House officials have said the timing of Trump’s statement was a coincidence and that his promised address about the Clintons was postponed when, a few days later, an Islamic State-inspired security guard went on a rampage at the Pulse nightclub in Orlando, Fla., killing 49 people.",
  "Aside from questions about the credibility of White House statements, the disclosure of the emails potentially has raised new questions about Kushner’s security clearance.",
  "He initially filed his SF-86 on Jan. 18, leaving out any mention of meetings with foreign government officials during the transition and the campaign.",
  "His lawyers have said this was inadvertent and that a member of his staff had prematurely hit the “send” button for the form before it was completed.",
  "Within twelve hours, they have said, Kushner notified the FBI that he would make amendments and disclose his meetings with foreign officials.",
  "This was followed by a revised security clearance submission on May 11 in which Kushner reported more than 100 meetings with officials from over 20 countries, including a meeting with the Russian Ambassador Sergey Kislyak and another with Sergey Gorkov, head of a Russian state-owned bank.",
  "The revised security clearance led to Kushner’s first FBI interview about the matter in mid-May, the sources said.",
  "The bureau is now reviewing Kushner’s second amended form following the new disclosure about his meeting with the Russian lawyer.",
  "His lawyers are confident that it won’t raise any additional problems since, as they have asserted, Kushner had forgotten the meeting — he was only briefly present — and had no intent to conceal it.",
  "In the meantime, he has an interim security clearance, sources said.",
  "Read more from Yahoo News:"
]