[
  "Donald Trump.",
  "AP Photo/Richard Drew, File\n\nPresident Donald Trump during a Fox News interview appeared to make a case for getting Robert Mueller pulled off the FBI's investigation into Russia's interference in the 2016 US election.",
  "Excerpts from an interview Trump had with \"Fox and Friends\" released Thursday night showed an adamant Trump criticizing Mueller, a former FBI director, for his past association with James Comey, whom Trump fired as FBI director in May amid the bureau's Russia investigation.",
  "\"Well he's very, very good friends with Comey, which is very bothersome ... We're going to have to see,\" Trump said of Mueller.",
  "The president also accused Mueller of hiring Hillary Clinton supporters to oversee portions of the investigation.",
  "The Trump-Russia inquiry has grown dramatically since Mueller took the reins last month, and it now includes an investigation into possible financial connections between the Trump campaign and Russian operatives.",
  "Mueller is also reportedly investigating Trump for possible obstruction of justice, sparked by accusations that the president had tried to influence the investigation.",
  "Trump told Fox News' Ainsley Earhardt \"there has been no obstruction, there has been no collusion,\" and the president accused Comey of leaking information to reporters.",
  "Former FBI Director James Comey.",
  "Zach Gibson/Getty Images\n\nComey testified under oath before the Senate that Trump, in the first days of his presidency, had demanded Comey's loyalty during a private dinner at the White House.",
  "Comey said he was noncommittal.",
  "Comey also said Trump privately asked him to \"let go\" of the FBI's investigation of Trump's former national security adviser, Michael Flynn.",
  "After Trump fired Comey, he told NBC News' Lester Holt that he had the Russia investigation in mind when he made his decision.",
  "Since then, Trump and his surrogates have made public statements suggesting that the administration was floating the possibility of a major shake-up in the Russia investigation.",
  "Former House Speaker Newt Gingrich called Mueller the \"tip of a deep-state spear aimed at\" Trump, after it was reported that Mueller was adding obstruction of justice to the FBI's investigation into Russia and the Trump campaign.",
  "Several other Trump allies echoed Gingrich's remarks, including conservative commentator Ann Coulter, who said Attorney General Jeff Sessions \"should fire Mueller,\" and radio host Bill Mitchell, who suggested Mueller and Comey may have \"colluded\" and said Mueller should \"immediately\" step down.",
  "Those rumblings, among others, were labeled by critics as a move to discredit Mueller's findings before the investigation was finished."
]