[
  "Trump admits: 'I did not make, and do not have' tapes of Comey conversations\n\nDonald Trump admitted on Thursday that he is not in possession of any secret recordings of conversations with James Comey, ending a 41-day saga that began when he issued a menacing tweet about the FBI director he had just fired.",
  "“With all of the recently reported electronic surveillance, intercepts, unmasking and illegal leaking of information, I have no idea ... whether there are ‘tapes’ or recordings of my conversations with James Comey, but I did not make, and do not have, any such recordings,” the president wrote on Twitter.",
  "The announcement came after weeks of speculation in which Trump teased and tantalised the media by refusing to deny the existence of tapes, a prospect that drew inevitable comparisons with Richard Nixon and the Watergate scandal.",
  "Either Trump or Comey is lying.",
  "Who might it be?",
  "| Lawrence Douglas Read more\n\nThe possibility that Trump might have them was raised by the president himself after he unceremoniously dismissed Comey last month.",
  "“James Comey better hope that there are no ‘tapes’ of our conversations before he starts leaking to the press,” he tweeted on 12 May, implying, but not explicitly declaring, that such recordings might exist.",
  "The explosive claim appeared to come in response to a New York Times article that reported Trump asked Comey for “loyalty” during a private dinner at the White House.",
  "It raised concerns that Trump, like some of his predecessors, was secretly recording all his conversations in the Oval Office.",
  "Soon after, Comey testified before Congress about his dealings with Trump before being dismissed and how he perceived his firing to be related to the FBI investigation into ties between Trump’s campaign and Russian officials.",
  "“The endeavor was to change the way the Russia investigation was being conducted,” Comey said.",
  "In an 8 June hearing in Congress, Comey described several meetings with Trump and said he in fact hoped the tapes do exist, as they would support his description of their discussions.",
  "He told the Senate intelligence committee: “I’ve seen the tweet about tapes.",
  "Lordy, I hope there are tapes.”\n\nThe following day, Trump appeared to relish keeping journalists guessing.",
  "At a press conference in the White House rose garden, he was asked about the tapes and said enigmatically: “Well, I’ll tell you about that maybe some time in the very near future.”\n\nOne reporter shouted: “Are there tapes, sir?” Trump replied: “Oh, you’re going to be very disappointed when you hear the answer, don’t worry.”\n\nThe issue was also frequently raised at daily press briefings at the White House but was deflected by official spokespeople.",
  "Asked on Thursday why Trump sent out the initial tweet and seemed to be playing a “game”, deputy press secretary Sarah Huckabee Sanders replied: “I don’t think there was a game.",
  "Again, he’s answered the question.",
  "He gave a timeline and the frame in which he would.",
  "He said by the end of this week and he’s done that.”\n\nThe possibility of tapes existing also pushed a number of legislators to ask the president to release any tapes he might have and to even support a congressional subpoena to acquire them if need be.",
  "Adam Schiff, the top Democrat on the House intelligence committee, tweeted early on Thursday: “Deadline to turn over any tapes of Comey conversations to House Intel – if they exist – is Friday.",
  "Time is running out for WH to comply.”\n\nThe absence of audio recordings is likely to increase the significance of contemporaneous notes made by Comey after his conversations with Trump.",
  "Trump’s tweet on Thursday came less than half an hour after Bloomberg News reported that no such tapes existed, citing a source “familiar with the matter”.",
  "The source said: “Trump raised the possibility of tapes in a strategic fashion to ensure that Comey told the truth.”\n\nSanders declined to elaborate.",
  "“I think the president’s statement via Twitter today is extremely clear and I don’t have anything to add to the statement itself,” she told reporters.",
  "“You guys asked for an answer.",
  "He gave you one.",
  "He said he would have it to you by the end of this week, which he did.",
  "And beyond timing of that, I can’t really speak anything further,” Sanders added.",
  "Asked if Trump now regretted that original tweet, the spokeswoman replied: “Uh, I don’t think so.”"
]