[
  "Ending one the most turbulent tenures of a Washington-based ambassador in recent memory, the Kremlin has decided to recall Ambassador to the United States Sergey Kislyak, three individuals familiar with the decision told BuzzFeed News.",
  "The decision to bring Kislyak back to Russia rather than appoint him to a senior position at the United Nations in New York, as several outlets previously reported, comes amid investigations by the FBI and Congress into the 66-year-old diplomat’s contacts with President Donald Trump’s top aides during the 2016 presidential campaign.",
  "“He could use some time away,” said a US-based diplomat.",
  "Though Kislyak’s departure has long been expected, Moscow would not confirm his departure date.",
  "The US–Russia Business Council, however, is hosting a going away party for the ambassador on July 11 at the St. Regis Hotel.",
  "Russian Foreign Ministry spokeswoman Maria Zakharova on Monday said Kislyak, \"who has worked in the US for 9 years, will go down in the history of bilateral relations as a man who made everything possible for their development, even in the most difficult moments.\"",
  "As Kislyak’s associations came under intensifying scrutiny in recent weeks, an array of politicians in both parties tripped over themselves in trying to deny any past contacts with Kislyak, whose meetings with Trump’s son-in-law Jared Kushner, Attorney General Jeff Sessions, and former national security adviser Michael Flynn have become a central source of intrigue in the broader Russia probe.",
  "All three men failed to report their meetings or conversations with the Russian ambassador at various times.",
  "At one point, the intrigue spread beyond the Trump camp — in late April, House Minority Leader Nancy Pelosi claimed she’d never met Kislyak shortly before photos surfaced of her meeting with him alongside other lawmakers in 2010.",
  "As a result, Kislyak has been labeled everything from “spymaster,” to “typhoid Mary,” to “the most radioactive man in Washington.”"
]