[
  "Former Trump Campaign Manager Paul Manafort Registers As A Foreign Agent\n\nEnlarge this image toggle caption Matt Rourke/AP Matt Rourke/AP\n\nA firm headed by Paul Manafort, who served as President Trump's campaign manager last year, made more than $17 million in two years working for the pro-Russia political party that controlled Ukraine's government, according to documents filed late Tuesday.",
  "Manafort, who resigned from Trump's campaign last August after his work for Ukrainian interests came under scrutiny, has registered as a foreign agent with the U.S. Justice Department, as did his deputy, Rick Gates.",
  "Manafort spokesman Jason Maloni said Manafort had started the registration process under the Foreign Agents Registration Act in September of last year, before the November 2016 election.",
  "\"Paul's primary focus was always directed at domestic Ukrainian political campaign work and that is reflected in yesterday's filing.",
  "Paul has appreciated the professionalism and guidance of the FARA unit throughout this process,\" Maloni said.",
  "Manafort did domestic political consulting for the Party of Regions, headed by former Ukrainian President Viktor Yanukovych, who fled to Russia after an uprising in 2014.",
  "Much of Manafort's work was aimed at \"advancing the goal of greater political and economic integration between Ukraine and the West,\" the documents say.",
  "\"Manafort was representing a political party, a very strong pro-Russian political party in ... Ukraine from 2012 to 2014, pulling in a whopping $17 million by the way,\" says Craig Holman, government affairs lobbyist at Public Citizen, a progressive public interest group.",
  "Holman says Manafort should have filed the disclosure forms right after he began working for Ukraine's government.",
  "Manafort's work in Ukraine ended in 2014, after Yanukovych stepped down and well before Manafort worked for Trump's campaign.",
  "Manafort is one of several current and former Trump associates whose ties to the former Soviet Union have attracted attention.",
  "He is said to be a focus of interest in the investigation headed by Department of Justice special counsel Robert Mueller into Russia's interference in the U.S. presidential election.",
  "Manafort is the second Trump associate to register retroactively as a foreign agent.",
  "Former national security adviser Michael Flynn has acknowledged lobbying for the government of Turkey in the months leading up to last year's election."
]