[
  "After Trump Slams Sessions, Attorney General Says He Will Stay On The Job\n\nEnlarge this image toggle caption Chip Somodevilla/Getty Images Chip Somodevilla/Getty Images\n\nUpdated at 4:50 p.m.",
  "ET\n\nAttorney General Jeff Sessions says he will stay at his post for \"as long as that is appropriate.\"",
  "That follows comments by President Trump, who said he wouldn't have appointed Sessions had he known Sessions would recuse himself from the investigation into possible collusion between the Trump campaign and Russia.",
  "At a news conference on an unrelated law enforcement action this morning, Sessions was asked about President Trump's comments to The New York Times suggesting that he regrets appointing him.",
  "Trump told the newspaper on Wednesday that \"Sessions should have never recused himself\" from the Russia probe and that \"if he was going to recuse himself, he should have told me before he took the job and I would have picked somebody else.\"",
  "\"We in this Department of Justice will continue every single day to work hard to serve the national interest, and we wholeheartedly join in the priorities of President Trump,\" Sessions said to reporters Thursday morning.",
  "\"I have the honor of serving as attorney general.",
  "It is something that goes beyond any thought I would have ever had for myself.",
  "We love this job.",
  "We love this department and I plan to continue to do so as long as that is appropriate.\"",
  "Sessions offered to resign over Trump's frustration with his recusal earlier this year, and Trump declined his offer.",
  "He announced that he would recuse himself from the Russia probe in March.",
  "\"I should not be involved in investigating a campaign I had a role in,\" Sessions said at the time.",
  "The attorney general testified to the Senate Intelligence Committee that he began discussing recusal with officials at the Justice Department the day after he took office in February.",
  "\"From that point, Feb. 10, until I announced my formal recusal on March 2, I was never briefed on any investigative details, did not access any information about the investigation,\" he added.",
  "Sessions was pressed on how he can still effectively serve as attorney general with Trump's seeming lack of confidence in him.",
  "Sessions cited Thursday's DOJ law enforcement action on illicit dark web commerce and a health care-related action last week as work the department will continue to do.",
  "As a senator from Alabama, Sessions was an early supporter of Trump's campaign and was influential in the development of the campaign's aggressive immigration policies.",
  "White House spokeswoman Sarah Huckabee Sanders was asked at Thursday's briefing if President Trump still had confidence in Sessions.",
  "\"Clearly, he has confidence in him or he would not be the attorney general,\" she responded.",
  "In the interview, Trump questioned the loyalty of Deputy Attorney General Rod Rosenstein, who before his appointment had been a federal prosecutor in Baltimore, a predominantly Democratic city.",
  "\"There are very few Republicans in Baltimore, if any,\" Trump said.",
  "Rosenstein was the U.S. Attorney based in Baltimore, but actually resides in Bethesda, Md.",
  "Asked about that comment at Thursday's news conference, Rosenstein said, \"I was proud to be here yesterday.",
  "I'm proud to be here today.",
  "I'll be proud to work here tomorrow.\"",
  "As Sessions left the news conference, a reporter shouted: Was he \"a zombie attorney general?\"",
  "Sessions did not answer as he left the room."
]