[
  "CLOSE Scaramucci is replacing former communications director Mike Dubke, who resigned in May.",
  "Video provided by Newsy Newslook\n\nWall Street financier Anthony Scaramucci took over the White House communications shop Friday, saying President Trump is “doing a phenomenal job and we just need to get it out there a little more aggressively.”\n\nTrump sounded a similar note in his statement announcing the appointment.",
  "“We have accomplished so much and we’re being given credit for so little,” he said.",
  "Scaramucci, who served on Trump's transition team and is now a senior vice president and chief strategy officer at the Export-Import Bank, surfaced Thursday evening as the leading candidate to be the new communications director.",
  "Scaramucci met with Trump Friday morning, and the White House confirmed the news on Friday afternoon.",
  "He then met with the White House press corps early Friday afternoon in a wide-ranging news conference.",
  "According to two officials, Scaramucci's selection led to White House press secretary Sean Spicer quitting his position.",
  "Spicer objected to Scaramucci's hiring, said the two officials, who spoke on condition of anonymity because they weren't authorized to speak publicly.",
  "Spicer said on Twitter that he would leave his position in August.",
  "The communications director job has been open since Mike Dubke resigned in May.",
  "Dubke, who did not work on the Trump campaign and did not know the president before the hire, was in the role for three months before he left.",
  "Spicer has handled the communications director's responsibilities ever since, something he did prior to Dubke coming on board.",
  "Scaramucci doesn't have communications experience.",
  "He spent years on Wall Street, including at Goldman Sachs and Lehmann Brothers.",
  "In 2005, he started his own global investment firm, SkyBridge Capital.",
  "So who will Scaramucci learn from?",
  "The president himself.",
  "“The best messenger, the best media person, the most savvy person in the White House is the president of the United States and I’m hoping to learn from him,\" he said at Friday's briefing.",
  "He also said he doesn't plan to curtail the president's use of Twitter.",
  "“It’s very important for him to express his identity,” he said.",
  "“People love him.”\n\nScaramucci famously called Trump a hack politician in August 2015, just a couple months after Trump announced his candidacy.",
  "Scaramucci said it was one of the biggest mistakes he’s ever made – and it's one the president hasn’t forgotten.",
  "“He brings it up every 15 seconds,” Scaramucci said.",
  "Scaramucci also noted, \"I don’t think I’d be standing here if I didn’t have a good relationship with the president.\"",
  "CLOSE Sean Spicer has submitted his resignation as the White House press secretary shortly after President Trump named Anthony Scaramucci as the new communications director.",
  "USA TODAY\n\nScaramucci’s appointment signals that Trump values loyalty and a certain star power over actual credentials for a communications job, said Anthony D'Angelo, public relations professor at Syracuse University's Newhouse School.",
  "\"That’s not to say Scaramucci can’t do the job as White House communications director,\" D'Angelo said, \"But his background as a hedge fund owner is obviously not the typical career path for a top-level communications position in the White House or anywhere else.\"",
  "Scaramucci has already started to address some of the issues that have plagued the administration, including Trump's approval rating and the president's belief that major voter fraud took place in the 2016 president election.",
  "He said the polls showing Trump has historically low approval ratings are moving targets.",
  "“Sometimes the polls can be wrong,” he said.",
  "“People said during the campaign we were going to lose and we ended up winning.”\n\nAsked if he believes Trump’s claim that millions of people voted illegally in the presidential election, Scaramucci said he’s not up to speed on that issue.",
  "“If the president says it, let me do more research on it,' he said.",
  "\"My guess is that there’s probably some level of truth to that.”\n\nScaramucci took his senior job at the Export-Import Bank in June.",
  "He had previously been under consideration for another post at the White House before Trump took office.",
  "In order to join the administration, Scaramucci sold his investment firm in January, but the job fell through.",
  "Prior to backing Trump in the 2016 election, Scaramucci first supported Wisconsin Gov.",
  "Scott Walker and former Florida governor Jeb Bush.",
  "Scaramucci dismissed reports of a tense relationship with Trump’s chief of staff, saying he and Reince Priebus may “rough each other up” once in a while, but “he’s a dear friend.”\n\n“You guys are going to be very, very surprised about the relationship that I have with Reince, the closeness that we’re going to have,” he said.",
  "Scaramucci, however, will be reporting directly to Trump and not to Priebus.",
  "Still, he said he's used to being part of a team and his approach to the job will be \"to keep my head in the game and keep my ego low.\"",
  "Read or Share this story: https://usat.ly/2vIiqtx"
]