[
  "The wide-ranging nature of Mr. Mueller’s investigation could put him on a collision course with Mr. Trump, who has said publicly that Mr. Mueller should keep his investigation narrowly focused on last year’s presidential campaign.",
  "In an interview with The New York Times, Mr. Trump said Mr. Mueller would be overstepping his boundaries if he investigated his family’s finances unrelated to Russia.",
  "For the moment, Mr. Mueller’s team has shown a measure of deference to White House officials, sparing them grand jury subpoenas and allowing them to appear for voluntary interviews.",
  "Those sessions are expected to begin soon.",
  "Ty Cobb, a lawyer brought in to manage the White House response to the inquiry, has told administration officials that he wants to avoid any subpoenas from the special prosecutor.",
  "Staff members have been working long hours answering Mr. Mueller’s request for 13 categories of documents, including records related to Mr. Comey’s firing and Mr. Trump’s role in drafting a misleading statement about a June 2016 meeting between campaign officials and Russian-born visitors.",
  "Nonetheless, the demand for documents has provoked at least one angry confrontation between Mr. Cobb and Donald F. McGahn II, the White House counsel, over whether certain documents should be withheld to protect the president’s right to confidentiality.",
  "But associates of both Mr. Manafort and Mr. Flynn have received more peremptory treatment.",
  "Instead of invitations to the prosecutor’s office, they have been presented with grand jury subpoenas, forcing them to either testify or take the Fifth Amendment and raise suspicions that they had something to hide.",
  "At least three witnesses have recently been subpoenaed to testify about Mr. Manafort: Jason Maloni, a spokesman who appeared before the grand jury for more than two hours on Friday, and the heads of two consulting firms — Mercury Public Affairs and the Podesta Group — who worked with Mr. Manafort on behalf of Viktor F. Yanukovych, the pro-Russia former president of Ukraine.",
  "Mr. Mueller’s team also took the unusual step of issuing a subpoena to Melissa Laurenza, a specialist in lobbying law who formerly represented Mr. Manafort, according to people familiar with the subpoena.",
  "Conversations between lawyers and their clients are normally considered bound by attorney-client privilege, but there are exceptions when lawyers prepare public documents that are filed on behalf of their client.",
  "Mr. Mueller took over the Russia investigation in May, after the F.B.I.",
  "had already spent nearly a year looking into connections between Mr. Trump’s associates and Russians.",
  "His team has occasionally been caught by surprise, hearing of possibly important information only when it is revealed in the news media."
]