[
  "(CNN) The Senate on Thursday passed sweeping legislation slapping new sanctions on Russia and rebuking President Donald Trump in a bill that now will head to the President's desk.",
  "The bill, which gives Congress new powers to block Trump from easing sanctions against Moscow, passed the Senate 98-2.",
  "It passed the House on Tuesday 419-3.",
  "The measure is one of the first major bipartisan pieces of legislation passed during Trump's presidency, and it effectively ties the hands of the President when it comes to easing Russia sanctions.",
  "The bill also includes new sanctions on Iran and North Korea, and was a product of lengthy negotiations between the House and Senate that devolved into finger-pointing between the two parties and chambers several times before an agreement was finalized.",
  "White House Press Secretary Sarah Huckabee Sanders told reporters that the President would review the sanctions bill.",
  "She did not say whether Trump would sign or veto the measure.",
  "\"We'll review that and let you know what we do,\" she told reporters Thursday night outside the White House.",
  "Lawmakers who spearheaded the sanctions deal, however, were highly skeptical that Trump would actually veto a bill that passed with overwhelming veto-proof majorities in both chambers.",
  "\"I had a conversation with the President just in the last few days, I've talked to (Secretary of State Rex) Tillerson Tuesday night.",
  "I don't think that's real,\" said Senate foreign relations committee Chairman Bob Corker.",
  "\"I just can't imagine -- you look at the vote count.\"",
  "Maryland Sen. Ben Cardin, the top Democrat on the Senate foreign relations committee, said there was no question Congress would override a veto.",
  "\"This bill gives the President a strong hand.",
  "Vetoing the bill is a weaker hand,\" Cardin told CNN.",
  "\"If he vetoes the bill, it shows presidential weakness toward Russia.\"",
  "While the sanctions bill is clearly headed to Trump's desk -- once the White House formally receives it he will have 10 days to sign or veto the measure -- its fate was murky just a day earlier.",
  "Corker and House Majority Leader Kevin McCarthy were fighting over the North Korean sanctions, after McCarthy added it to the bill before the House passed it, against Corker's wishes.",
  "Corker had threatened to strip out the North Korean portion, but that would have likely pushed the bill beyond the August congressional recess, which both Democrats and Republicans hoped to avoid.",
  "Democrats and some Republicans said the bill needed to pass now amid concerns the White House was considering returning two Russian compounds in New York and Maryland seized by the Obama administration in December in response to election interference.",
  "Corker and McCarthy agreed to pass the bill with the House's North Korean sanctions included, and in exchange, the House agreed to take up any future North Korean sanctions bills that go through the Senate.",
  "Corker and other senators want to include congressional review over North Korean sanctions, similar to the provision in the current bill that gives Congress veto power over easing Russia sanctions.",
  "Before the fight over North Korea, the sanctions bill languished in the House for weeks amid multiple procedural disputes, which prompted Democrats accusing Republicans of stalling on behalf of the White House.",
  "The final bill did include several tweaks made to the Russia sanctions to address concerns from energy and other US companies , as well as European countries.",
  "But several European countries still have concerns, particularly over a natural gas pipeline between Germany and Russia.",
  "Russia has also threatened to retaliate, and Russian President Vladimir Putin on Thursday called the new sanctions \"illegal under international law.\""
]