[
  "Browder Says “No Doubt” Lawyer Who Met With Trump Jr. a Russian Agent\n\nThe Russian lawyer who met with Donald Trump, Jr. was working on behalf of the Russian government to persuade the Trump campaign to repeal the Magnitsky Act, Bill Browder, the founder and CEO of Hermitage Capital Management testified before Congress on Thursday.",
  "On July 11, Donald Trump Jr., the president’s son, disclosed emails he exchanged arranging a meeting with a Russian lawyer named Natalya Veselnitskaya.",
  "He claims the meeting focused mostly on adoption.",
  "“There’s no doubt” Veselnitskaya was working on behalf of the Russian government, Browder told the Senate Judiciary Committee.",
  "Not only was she working for a family in Russia closely tied to Putin, but she also worked for Russian security service the FSB “in the Moscow region where she’s from,” Browder said.",
  "Browder has been battling the Russian government for over a decade.",
  "He alleges that Russian law enforcement stole $230 million his company had paid in taxes.",
  "His lawyer, Sergei Magnitsky, died in Russian custody after investigating the affair, ultimately leading Browder to work with Congress to pass the Magnitsky Act, which levied targeted sanctions against powerful players in Russia.",
  "According to Donald Trump Jr., who posted his emails about the July meeting, Veselnitskaya “wanted to talk about adoption policy and the Magnitsky Act.” While he said nothing of value came from the meeting, Veselnitskaya is best known for her effort to repeal the the legislation, and her representation of the companies that Bill Browder has accused of stealing from him.",
  "The case against her client, Prevezon Holdings, was settled by President Donald Trump’s Attorney General, Jeff Sessions, just days before the trial was scheduled to begin.",
  "“It’s absolutely clear the interest and the goal was to repeal the Magnitsky Act,” Browder said of the meeting.",
  "“What they were willing to offer in return I don’t know.",
  "The FSB would’ve studied their targets carefully, offered something they thought was appealing and sizeable enough to be consistent with what they were asking for.”\n\nAsked why one law matters so much to Vladimir Putin when the U.S. has levied other sanctions on Russia, Browder argued it’s because the sanctions targeted specific wealthy individuals directly tied to the Russian president’s own suspected massive personal fortune.",
  "“It affects Putin’s money,” Browder said.",
  "One proposal discussed was removing a loophole that allows the removal of banks and other businesses from the treasury sanctions list without asking Congress first.",
  "That move would mirror a new Russian sanctions bill passed by both the House and the Senate this week that would prevent President Trump from loosening sanctions on Russia without Congress’s input.",
  "While it would be very challenging for Russia to repeal the Magnitisky Act entirely, even with the buy-in of the U.S. president, there are loopholes to relieve pressure on some of the high-ranking billionaires in Putin’s kleptocracy.",
  "For example, it’s possible to remove banks from the Treasury Department’s Office of Foreign Assets Control sanctions list with executive action after they’ve been added.",
  "“No bank wants to be in violation of the treasury sanctions list,” Browder said.",
  "“You basically become a financial pariah.”\n\nBecause pawns of the not only the Russian government but other nation states can get away with this behavior so easily, it demands changes in foreign lobbying laws, Browder argued.",
  "The hearing, focused on the Foreign Agents Registration Act or FARA, was directed at finding ways to hold people accountable when they fail to register as lobbyists for other countries.",
  "Browder pointed out that one way to bypass the law is to register on behalf of an international company, though many companies, including oil companies in Russia, very often act on behalf of the government.",
  "He described it as “a loophole you can drive a truck through in the Lobbying Disclosures Act.”\n\nBrowder argued that Fusion GPS, an American opposition research firm, has also functioned as an arm of the Russian government.",
  "Its founder Glenn Simpson, a former Wall Street Journal reporter, was one of the people in Washington who has helped Veselnitskaya lobby to repeal the Magnitsky Act—by working for an American law firm hired to defend Prevezon.",
  "Fusion GPS has denied that it worked on behalf of Russian interests to undermine U.S. law, because the law firm was an American company.",
  "“If people who haven’t registered as foreign agents are convicted, prosecuted, and imprisoned, then everyone in the future will register as foreign agents,” Browder argued.",
  "Sen. Lindsey Graham, (R-S.C.), asked Browder why Fusion GPS would be working on behalf of the Russian government to help get Trump elected when the same firm was behind the effort to release the notorious dossier against Trump.",
  "“Putin is in the business of trying to create chaos,” Browder said.",
  "Photo Credit: LEON NEAL/Getty Images"
]