[
  "The testimony prepared by Magnitsky Act lobbyist William Browder for the Senate Judiciary Committee, probing alleged Russian meddling into the US election, is false, Russian attorney Natalia Veselnitskaya told RT, adding that she has the proof.",
  "Browder was due to testify before the Committee on Wednesday, but his appearance was eventually rescheduled for Thursday.",
  "The delay was caused by Senate Democrats invoking a rule barring the committee sessions from lasting more than two hours in response to attempts by the Republicans to repeal ObamaCare.",
  "Read more\n\nHowever, Browder’s written testimony to Committee was published on The Atlantic website earlier this week.",
  "“I read the transcript carefully – there is nothing new there, he has already said all these things before.",
  "And I can tell you with certainty that… Browder will give false testimony,” Veselnitskaya told RT on the phone.",
  "The Russian attorney has recently made headlines due to her participation in the controversial meeting with US president Donald Trump’s son, Donald Trump Jr., the president’s son-in-law, Jared Kushner, and then-campaign chairman Paul J. Manafort, during the race for the White House in June 2016.",
  "“As a person who he talks about in his statements, I am also ready to testify and prove to anyone in the US or any other country that Mr. Browder is telling lies,” Veselnitskaya said.",
  "“I have evidence that explain his motives – why he is ready to give false testimony before the Senate despite possible consequences and prosecution for perjury,” she added.",
  "The attorney urged a public hearing to be organized where every side will be able to present their case, stressing that “naturally, every participant must be guaranteed safety.”\n\nREAD MORE: Democrats & Russians 'laughing' at 'witch hunt' collusion probe – Trump\n\n“I am ready to defend my good name in any court,” Veselnitskaya said, but added that she doubts that the US will present her with such opportunity due to the “negative attitude towards Russia that is prevalent among Americans today, knowing their hatred towards their own president.”\n\nIn Russia, Browder is notorious for his financial crimes back in the 2000s as the CEO of Hermitage Capital investment company.",
  "The businessman was sentenced in absentia to nine years in prison for tax evasion by a Russian court.",
  "According to the 2013 verdict, Browder together with his Russian lawyer Sergey Magnitsky failed to pay over 552 million rubles in taxes (about US$16 million).",
  "Read more\n\nThe American was also found guilty of illegally buying shares in the country’s gas giant, Gazprom, costing Russia at least 3 billion rubles (US$100 million).",
  "Following the death of Magnitsky in a Moscow detention center in 2009, Browder actively lobbied for the so-called Magnitsky Act, a 2012 law that allowed the US government to seize assets from a number of alleged Russian human rights abusers as well as barring them from entering the country.",
  "Moscow responded to the American move by prohibiting the US families from adopting Russian children among other measures.",
  "According to the transcript of Browder’s testimony, he plans to share his take on the whole Magnitsky saga with the Senate Judiciary Committee to help its members “understand the methods of Russian operatives in Washington and how they use US enablers to achieve major foreign policy goals without disclosing those interests.”\n\nAmong other things, Browder claims in the transcript that Veselnitskaya hired the co-founder of the US firm Fusion GPS, Glenn Simpson, to conduct a \"smear campaign\" against him.",
  "In her earlier interview with RT, Veselnitskaya said that Browder has launched his own disinformation campaign over her meeting with Donald Trump Jr. to retaliate against her personally for a recent defeat in court.",
  "She was one of the legal experts who represented Cyprus-based holding company Prevezon, owned by Russian businessman Denis Katsyv, in its defense against allegations of money laundering.",
  "The case, which was launched in 2013, ended in a settlement in May this year with no admission of guilt by Prevezon."
]