[
  "Sergei Kislyak, former Russian ambassador to Washington, appears on the Russian 24 channel's 'Press Conference' to deny discussing secrets or sanctions with Trump's National Security Advisor Mike Flynn (Photo: Russia 24)\n\nSergey Kislyak, Russia's former ambassador to Washington, denied Saturday that he had discussed secrets or even the issue of sanctions with now-fired Trump national security adviser Michael Flynn in a series of controversial conversations.",
  "Kislyak's remarks, made in an interview on the Russian 24 channel's \"Press Conference\" program, are at odds with the circumstances surrounding the firing of Flynn, who was dismissed in February for lying to Vice President Pence in saying he had not discussed sanctions with Kislyak.",
  "Flynn's firing, after 24 days on the job, followed warnings by acting Attorney General Sally Yates to the new Trump White House team that Flynn was potentially vulnerable to Russian blackmail regarding phone calls he had with Kislyak during the transition period.",
  "Kislyak, who completed his nine-year tour as ambassador to Washington in July, said in fact that he had clear instructions from Moscow not to talk about sanctions with the incoming Trump team.",
  "Former national security adviser Michael Flynn.",
  "(Photo: Carolyn Kaster, AP Images)\n\n\"I did not discuss sanctions with anyone, and rest assured that I carried out my instructions honestly,\" the diplomat said, adding that Moscow \"does not bargain for sanctions\" because it considers sanctions to be illegal.",
  "He also described his talks with Flynn as entirely appropriate.",
  "\"How can it be that a diplomat is forbidden to communicate with representatives of the elected administration?",
  "Any diplomat — Russian, not Russian — is working to better understand the policy of the country where he works,\" he said.",
  "According to Kislyak, who has been Russia's ambassador to the U.S. since 2008, the two discussed such topics of mutual interest as the fight against terrorism.",
  "He said they talked about \"the simplest things\" and there were no secrets from the Russian side.",
  "He said the exchange was \"absolutely correct, calm, absolutely transparent,\" according to the Russian news site Vesti.ru.",
  "The Russian diplomat declined to indicate the form of his conversations with Flynn, including whether they were by phone or in person..\n\n\"I didn't come here to testify,\" he told the Russian \"Press Conference\" panel.",
  "\"We don't comment on concrete conversations with our interlocutors and leave it for them to decide what they would like to reveal and what not.\"",
  "He also denied that Russia interfered in the 2016 presidential election and denied that the Kremlin supported Trump, saying they were read for any outcome.",
  "He said that Russia was \"fully prepared for both one option and the other.\"",
  "The Washington Posthas reported that Kislyak was overheard by U.S. spy agencies telling his bosses he had discussed campaign-related matters, including issues important to Moscow, with now Attorney General Jeff Sessions during the 2016 presidential race.",
  "More: Special counsel Robert Mueller using multiple grand juries in Russia inquiry\n\nMore: President Trump signs new Russia sanctions, questions whether bill interferes with foreign policy authority\n\nRead or Share this story: https://usat.ly/2vC2NYl"
]