[
  "WASHINGTON — The co-founder of a Washington opposition research firm that produced a dossier of salacious allegations involving President Donald Trump met for hours with congressional investigators Tuesday in a closed-door appearance that stretched into the evening.",
  "Glenn Simpson’s lawyer emerged from the daylong private appearance with the Senate Judiciary Committee and said his client had “told Congress the truth and cleared the record on many matters of interest.”\n\nThe lawyer, Josh Levy, noted that Simpson appeared voluntarily and said he had so far been the only witness to participate in a private interview with the Senate Judiciary Committee as the panel looks into Russian interference in the 2016 presidential election.",
  "The sheer length of Simpson’s appearance — far longer, for instance, than Trump’s son-in-law, Jared Kushner, spent earlier this summer before Senate and House intelligence committees — reflected the intrigue on Capitol Hill surrounding the dossier and the origins of the document.",
  "READ MORE: All of the Russia investigations, explained\n\nSimpson’s firm, Fusion GPS, hired a British intelligence officer who produced a dossier containing allegations of ties between Trump and his associates and Russia.",
  "Simpson kept the identities of the firm’s clients confidential during his appearance before Congress, his lawyer said.",
  "The document attracted public attention in January when it was revealed that FBI Director James Comey had briefed Trump about its existence soon before he was inaugurated as president.",
  "It’s unclear to what extent the allegations in the dossier have been corroborated or verified by the FBI since the bureau has not publicly discussed it.",
  "“Fusion GPS is proud of the work it has conducted and stands by it,” Levy, Simpson’s lawyer, said in a statement.",
  "He said the “investigation into Mr. Simpson began as a desperate attempt by the Trump campaign and its allies to smear Fusion GPS because of its reported connection to the Trump dossier.”\n\nREAD MORE: What we know ?",
  "and what we don’t ?",
  "about Mueller’s grand jury\n\nLeaders of the Judiciary Committee said last month that they were negotiating private appearances for Donald Trump Jr., who has attracted scrutiny for accepting a June 2016 meeting with Russians at which he expected to receive damaging information about Hillary Clinton, and for Paul Manafort, the former Trump campaign chairman.",
  "Yet no dates have been announced for their appearances.",
  "“Following up on comments from certain Senate Judiciary Committee members who have noted Mr. Simpson’s cooperation with this investigation,” Levy said in a statement, “I would like to add that he is the first and only witness to participate in an interview with the Committee as it probes Russian interference in the 2016 election.”\n\nFollow Eric Tucker on Twitter at https://twitter.com/etuckerAP"
]