[
  "Washington (CNN) Attorney General Jeff Sessions on Wednesday faced tough questions from his former colleagues on the Senate judiciary committee -- forcing him to once again repeatedly deny any improper contacts with the Russian government during the presidential campaign.",
  "\"My concern is you were part of the Russian facade and went along with it,\" Vermont Democrat Sen. Patrick Leahy said after a second round of tense questioning as the hearing stretched into the afternoon.",
  "\"I'm sorry, I've known you for years, and I'm sorry you would do that. \"",
  "Sessions denied the allegation and expressed dismay that his former committee chairman would make it.",
  "\"It did hurt me to hear you say I'm part of a façade, I'm not part of a façade,\" Sessions said.",
  "During the nearly five-hour hearing that touched on topics including Russian election meddling, immigration and criminal justice reform, Sessions also debated executive privilege with committee Democrats.",
  "Sessions refused to discuss his \"confidential conversations with the President,\" rejecting Democrats' questions about his interactions with President Donald Trump despite their pre-hearing warnings they expected him to answer, saying they were misunderstanding executive privilege.",
  "\"I can neither assert executive privilege neither can I disclose today the contents of my confidential conversations with the President,\" Sessions said.",
  "\"It is well established that the President is entitled to have private, confidential conversations with his Cabinet officials ... such communications are the core of executive privilege.\"",
  "Chairman Chuck Grassley backed up Sessions after several rounds of such questions, saying former Attorney General Eric Holder had made similar claims during the Obama administration.",
  "Over the hours of his testimony, Sessions defended his integrity amid sharp questioning from Democrats -- in particular Sen. Al Franken of Minnesota -- who grilled Sessions over previous comments he made during his confirmation process where he said he had not had been in contact with anyone connected to the Russian government during the presidential campaign, a topic of keen interest amid the ongoing investigation into Russian meddling in the US election.",
  "It was later revealed that Sessions met with then-Russian Ambassador to the US Sergey Kislyak on multiple occasions.",
  "\"I've committed myself to a high level of public service, to reach the highest level of standards and decency in my public service,\" Sessions told Franken.",
  "\"You have now gone through this long talk that I believe is totally unfair to me.\"",
  "Sessions' comments on executive privilege were a disappointment to the panel's Democrats, who had written him an earlier letter that they expected him to testify about conversations he had with the President about the firing about former FBI Director James Comey.",
  "Sessions told the committee: \"I cannot waive that privilege myself or otherwise compromise his ability to assert it.\"",
  "Sessions also grew visibly uncomfortable when Leahy asked him about his interactions with Special Counsel Robert Mueller's investigation.",
  "Leahy pressed Sessions on whether he had been interviewed by Mueller, not allowing Sessions to demur to ask the special counsel about it first.",
  "\"The answer's no,\" Sessions finally said.",
  "In an awkward follow-up exchange later with Connecticut Sen. Richard Blumenthal, the Democrat pressed Sessions on whether he or his office had been asked for an interview, with Sessions smiling wanly as he avoided giving a firm answer.",
  "\"I don't think so,\" Sessions said, adding he was \"not aware of it.\"",
  "Incredulous, Blumenthal asked Sessions if he was sure.",
  "Sessions said he would follow up \"within hours.\"",
  "\"I don't know,\" Sessions said.",
  "\"You seem to know, I don't want to come in here and be trapped.",
  "..",
  "I will check and let you know.\"",
  "Later in the questioning, Sessions added: \"My staff handed me a note that I have not been asked for an interview at this point.",
  "... Maybe you better check your source.\"",
  "Wednesday's hearing is the Judiciary committee's first turn to ask questions of Sessions since his confirmation hearing, a sore subject for committee Democrats who have pushed for a chance to question the attorney general on a range of issues, including the Russia investigation and the extent of his prior contacts with Russian officials that led to his recusal from the investigation\n\nExecutive privilege and pardon power\n\nDemocrats had warned Sessions they would ask him about conversations he's had with President Donald Trump, a topic Sessions dodged when testifying in June before the intelligence committee citing concerns about executive privilege.",
  "The top Democrat on the committee, Sen. Dianne Feinstein reiterated that message in her opening statements at the hearing, which covered voting rights, civil rights, the Deferred Action for Childhood Arrivals program and the Comey's firing.",
  "\"It's important, I believe to understand what role you had in this process, including conversations you had with the President and others in the White House,\" Feinstein said, saying Democrats already alerted Sessions they \"expected answers or the assertion of a valid claim of executive privilege by the President.\"",
  "The topic was also the subject of a tense exchange with Rhode Island Democratic Sen. Sheldon Whitehouse, who read aloud from policies and rules about executive privilege and pressed Sessions on whether he was stretching the limits of what the White House is entitled to.",
  "\"This period of abeyance has turned into a non-assertion assertion of executive privilege,\" Whitehouse said.",
  "\"The executive branch is a co-equal branch and you would not want someone demanding to know who you talked to in your office, your counsel, your chief of staff.",
  "Neither would we want to be prowling willy-nilly through the Supreme Court and what their clerks knew or were told,\" Sessions said.",
  "\"This is not a little matter, is all I'm saying to you.",
  "And if this isn't legitimate and you make the specific cases, we'll review it, but it shouldn't be done casually, I got to say.\"",
  "The presidential pardon power also came up in relation to the Russia investigation.",
  "Sessions was asked by Sen. Amy Klobuchar, a Democrat from Minnesota, about whether the President could pre-emptively pardon a person under investigation.",
  "\"Well the pardon power is quite broad,\" Sessions said, saying he'd prefer to answer in writing.",
  "\"I have not studied it.",
  "I don't know whether that would be appropriate or not, frankly.\"",
  "He later told Blumenthal: \"My understanding is a pardon can be issued before a conviction's occurred.\"",
  "Russia comes up again\n\nSessions' meetings with Russian officials during the 2016 campaign came up quickly during the hearing, and was the subject of multiple testy exchanges with his former colleagues on the committee.",
  "Leahy asked Sessions about his response to a question on his confirmation questionnaire.",
  "Leahy referred to the questionnaire, which asked if Sessions had been in contact with anyone connected to the Russian government.",
  "\"You answered emphatically, no,\" Leahy said, noting that after Sessions' confirmation it was revealed by the press that Sessions had met with Russian Ambassador Sergey Kislyak on multiple occasions.",
  "\"You answered no, you concealed your own contact with Russian officials at a time when such contacts were of great interest to the committee.\"",
  "Leahy said that as a senator, Sessions \"wouldn't tolerate being misled\" and asked him if he could \"understand\" the impression of Democrats that his answer was \"false testimony.\"",
  "\"I believe my answer was correct,\" Sessions said, pulling out the questionnaire and reading from the lead-up to the question, which referenced interference in the 2016 campaign.",
  "\"I took that to mean, not any casual conversation, but did I participate with the Russians about the 2016 election,\" Sessions said.",
  "\"Every one of your previous questions talked about improper involvement and I felt the answer was no.\"",
  "Leahy and Sessions went back and forth for several minutes, with Leahy noting that both men were lawyers and know the difference between \"no\" and \"I don't recall.\"",
  "He asked Sessions anew whether he had discussed with Russian officials emails, interference in the election, sanctions and the Magnitsky Act, and Trump's policies with Russian officials.",
  "Sessions and Leahy went through each, with Sessions giving answers from \"I don't recall having done any such thing\" to a flat \"no.\"",
  "Heated exchange with Franken\n\nFranken picked up on the exchange, and pressed Sessions on his answers to the Democrat's own questions during the confirmation hearing.",
  "In a back and forth that included repeated asides about time remaining and pleas to the chairman for fairness, Sessions took umbrage at Franken's implication that he had acted improperly.",
  "Franken read extensively from Sessions' public statements, saying repeatedly \"the goalposts have been moved.\"",
  "\"Not being able to recall what you discussed with him is very different than saying, 'I have not had communications with the Russians,'\" Franken said.",
  "\"The ambassador from Russia is Russian.",
  "And how your responses morphed from, 'I did not have communications with the Russians' to 'I did not discuss substantive, I did not discuss the political campaign' and then finally going to, 'I did not discuss interference in the election.",
  "'That, to me, is moving the goal posts every time.",
  "... By the end, we're going to a 75-yard field goal.\"",
  "\"Let me just say, without hesitation, that I conducted no improper discussions with Russians at any time regarding a campaign or any other item facing this country,\" Sessions tried to begin his answer, before an aside about time.",
  "\"Mr. Chairman, I don't have to sit here and listen --\" Sessions said.",
  "\"You're the one who's testifying,\" Franken shot back.",
  "\"Without having a chance to respond, give me a break,\" Sessions said.",
  "Sessions also read at length from the transcript of his confirmation hearing and Franken's original question, which referred to a CNN report about the Trump dossier that he said at the time he did not expect Sessions would have yet seen.",
  "\"I'm disappointed,\" Sessions said.",
  "\"I think it was a good faith response to a dramatic event at the time.",
  "And I don't think it's fair for you to suggest otherwise.\"",
  "When it became Nebraska Republican Sen. Ben Sasse's turn to ask questions, he cut the tension with humor and apologized for a distraction during the previous exchange.",
  "\"I dumped a Dr. Pepper on Sen. Cruz, so that was what was distracting us on this side of the dais,\" Sasse cracked.",
  "Going into a break from the hearing, Grassley referenced private information that he and Feinstein were given by then-Director Comey that he wished the committee could be briefed on, saying he believes it would have helped assuage Franken's concerns.",
  "He said they had asked the FBI to give the full committee a briefing on it but were denied.",
  "\"The FBI did not do that and now we have conflicts I think could have been avoided if the FBI would have been more transparent,\" Grassley said.",
  "Travel ban\n\nThe oversight hearing comes after a tumultuous summer for Sessions, during which he was publicly derided by the President over his recusal from the Russian meddling investigation, served as the face of the administration's decision to rescind DACA and as his department suffered setbacks in the courts in trying to implement key pieces of the President's agenda, a fresh one coming Tuesday when a federal court blocked the third travel ban from going into effect and a second judge followed suit in part on Wednesday.",
  "Sessions defended the travel ban in his opening statements on Wednesday, saying it was an \"important step\" for national security.",
  "\"It is a lawful and necessary order that we are proud to defend,\" Sessions said.",
  "\"We're confident that we will prevail as time goes by in the Supreme Court.\"",
  "This story has been updated with additional developments and will continue to update."
]