[
  "Breaking News Emails Get breaking news alerts and special reports.",
  "The news and stories that matter, delivered weekday mornings.",
  "WASHINGTON — Tony Podesta and the Podesta Group are now the subjects of a federal investigation being led by Special Counsel Robert Mueller, three sources with knowledge of the matter told NBC News.",
  "The probe of Podesta and his Democratic-leaning lobbying firm grew out of Mueller's inquiry into the finances of former Trump campaign chairman Paul Manafort, according to the sources.",
  "As special counsel, Mueller has been tasked with investigating possible collusion between the Trump campaign and Russia.",
  "Manafort had organized a public relations campaign for a non-profit called the European Centre for a Modern Ukraine (ECMU).",
  "Podesta's company was one of many firms that worked on the campaign, which promoted Ukraine's image in the West.",
  "The sources said the investigation into Podesta and his company began as more of a fact-finding mission about the ECMU and Manafort's role in the campaign, but has now morphed into a criminal inquiry into whether the firm violated the Foreign Agents Registration Act, known as FARA.",
  "Related: What Did Paul Manafort Really Do in Ukraine?",
  "Under FARA, people who lobby on behalf of foreign governments, leaders or political parties must file detailed disclosures about their spending and activities with the Justice Department.",
  "Willful failure to file the forms is a felony and can result in up to five years in prison, though such prosecutions are rare.",
  "The Podesta Group amended its FARA registration to accurately reflect its work with ECMU only after the payments were reported by the media.",
  "Manafort's firm also filed a FARA registration after media reports in June disclosed its work in Ukraine from 2012 through 2014.",
  "A spokeswoman said the Podesta Group’s original filing was submitted after the advice of legal experts because the ECMU \"had certified that it was neither funded nor directed by a foreign government or political party.\"",
  "After the media reports, said the spokeswoman, the Podesta Group reached out to FARA regulators who instructed how the firm should file.",
  "The ECMU was reportedly backed by the Party of Regions, the pro-Russian and oligarch-funded Ukrainian political party for which Manafort worked as a consultant, and which paid his firm millions.",
  "Viktor Yanukovych of the Party of Regions, a Manafort client, was president of Ukraine during the ECMU campaign, which ran from 2012 to 2014.",
  "He fled the country in 2014.",
  "Tony Podesta is the chairman of the Podesta Group and the brother of John Podesta, Hillary Clinton's presidential campaign chairman.",
  "John Podesta is not currently affiliated with the Podesta Group and is not part of Mueller's investigation.",
  "In a statement, a spokesman for the Podesta Group said the firm \"is cooperating fully with the Special Counsel's office and has taken every possible step to provide documentation that confirms timely compliance.",
  "In all of our client engagements, the Podesta Group conducts due diligence and consults with appropriate legal experts to ensure compliance with disclosure regulations at all times — and we did so in this case.\"",
  "Paul Manafort at the Republican National Convention in Cleveland, Ohio on July 14, 2016.",
  "Rick Wilking / Reuters file\n\nA spokesperson for Mueller's office declined to comment.",
  "In late August, NBC News reported that Special Counsel Mueller's team sent subpoenas to six firms who were involved in public relations lobbying for ECMU.",
  "The subpoenas sought testimony from public relations executives who worked on the campaign organized by Manafort, people directly familiar with the matter told NBC News.",
  "One source with knowledge of the investigation said that federal investigators have now met with several former staffers of the various firms involved in the ECMU campaign.",
  "Mueller's team is closely examining the lobbying campaign, which ran between 2012 and 2014.",
  "Six firms participated in the public relations effort that Manafort coordinated, paid for by the Brussels-based ECMU.",
  "The stated goal was to build support for Ukraine's entry into the European Union, the same source said.",
  "Related: Mueller Seeks Testimony From PR Firms That Worked With Manafort\n\nTwo of the firms, Podesta Group and Mercury LLC, worked in Washington with Manafort partner Rick Gates, according to lobbying disclosure records.",
  "Three other firms worked in Europe, the executive said.",
  "NBC News could not confirm the identity of those three.",
  "Ukrainian President Viktor Yanukovych (R) looks on as German Foreign Affairs Minister Frank-Walter Steinmeier walks behind him before signing an agreement in Kiev on February 21, 2014.",
  "Sergei Supinsky / AFP/Getty Images file\n\nManafort, whose Alexandria, Virginia, apartment was raided by FBI agents in July, has emerged as a key figure in the Mueller probe.",
  "The inquiry into the lobbying campaign appears to be part of a larger investigation into his work for the Party of Regions, his offshore banking transactions, his tax compliance and his real estate dealings, people familiar with the probe have told NBC News.",
  "The Associated Press first revealed the pro-Ukraine lobbying campaign in August 2016, while Manafort was still running the Trump campaign.",
  "Manafort left the campaign within days.",
  "The report said the ECMU campaign was designed to sway public opinion and included attempts to solicit favorable press coverage in The New York Times and The Wall Street Journal."
]