[
  "HANOI, Vietnam (AP) — President Donald Trump on Sunday said he believes U.S. intelligence agencies, which have concluded that Russia meddled in the 2016 U.S. presidential election.",
  "But Trump also said he believes Russian President Vladimir Putin is sincere when he says Russia didn't interfere.",
  "\"I believe that he feels that he and Russia did not meddle in the election,\" Trump said of Putin at a news conference with Vietnam's president in Hanoi.",
  "\"As to whether I believe it, I'm with our agencies.\"",
  "He added, \"As currently led by fine people, I believe very much in our intelligence agencies.\"",
  "Top U.S. intelligence officials, including those at the CIA, have concluded that Russia interfered in the election to help the Republican Trump defeat Democrat Hillary Clinton.",
  "A special counsel and multiple Congressional committees are also investigating potential collusion between Moscow and Trump campaign aides.",
  "That probe has so far led to the indictments of Trump's former campaign chairman and another top aide for financial and other crimes unrelated to the campaign, as well as a guilty plea from a Trump foreign policy adviser.",
  "It's a question that has followed Trump since January, when he said for the first time at a press conference in Trump Tower shortly before taking office that he accepted Russia was behind the election year hacking of Democrats that roiled the White House race.",
  "\"As far as hacking, I think it was Russia,\" Trump said then, quickly adding that \"other countries and other people\" also hack U.S. interests.",
  "But the issue wasn't settled.",
  "Speaking to reporters aboard Air Force One on Saturday on his way to Hanoi, Trump had said that Putin again vehemently denied the allegations — this time on the sidelines of an economic conference in the seaside city of Danang.",
  "Trump danced around questions of whether he believed Putin, but stressed Putin's denials.",
  "He also accused Democrats of using the issue to try to sabotage relations between the two countries, putting lives at risk.",
  "\"Every time he sees me, he said: 'I didn't do that.'",
  "And I believe — I really believe — that when he tells me that, he means it,\" Trump said, arguing that it made no sense for him to belabor the issue.",
  "\"I'd rather have him get out of Syria, to be honest with you.",
  "I'd rather have him, you know, work with him on the Ukraine than standing and arguing,\" he said.",
  "Trump also lashed out at the former heads of the nation's intelligence agencies, claiming there were plenty of reasons to be suspicious of their findings.",
  "\"I mean, give me a break.",
  "They're political hacks,\" Trump said, citing by name James Clapper, the former director of national intelligence, John Brennan, the former CIA director and his ousted ex-FBI director James Comey, whom Trump said was \"proven now to be a liar and he's proven to be a leaker.\"",
  "In a tweet sent Sunday from Hanoi, Trump bashed the \"haters and fools\" he said were questioning his efforts to improve relations with Russia and accused critics of \"playing politics\" and hurting the country.",
  "Trump's Saturday comments sparked criticism from lawmakers with ties to the intelligence community.",
  "Rep. Adam Schiff, the California Democrat who is his party's top member on the House's intelligence committee, said in a statement that Trump \"fools no one\" and that the president understands how the Russians intervened in the election through hacking, social media and television coverage of the presidential race.",
  "Sen. John McCain, R-Ariz., the party's presidential nominee in 2008, said in a statement that Trump's faith in Putin's denial was \"naive.\"",
  "\"There's nothing 'America First' about taking the word of a KGB colonel over that of the American intelligence community,\" McCain wrote, referring to Putin's former career in Soviet intelligence.",
  "\"Vladimir Putin does not have America's interests at heart.\"",
  "Trump was in Hanoi for a brief state visit.",
  "He was traveling to the Philippines later Sunday — the last stop of his five country trip — for a pair of summits.",
  "In brief remarks after his arrival at Hanoi's presidential palace, Trump offered Vietnam help negotiating with China on disputes over the South China Sea.",
  "Beijing's island-building there has drawn criticism from Washington, which argues the U.S. has a national interest in freedom of navigation in sea lanes critical for world trade.",
  "U.S. Secretary of State Rex Tillerson earlier this month said China's \"provocative actions\" challenged international law and norms.",
  "\"If I can help mediate or arbitrate, please let me know,\" Trump offered.",
  "\"I'm a very good mediator and a very good arbitrator.",
  "I've done plenty of it from both sides.\"",
  "Vietnamese President Tran Dai Quang said he preferred to settle the dispute through \"peaceful negotiations\" and \"with respect for diplomatic and legal process in accordance with international law.\"",
  "Trump also said he hoped to have more help from Chinese President Xi Jinping as well as Russia, when it comes to isolating North Korea, in an effort to pressure the country to abandon its nuclear weapons program.",
  "\"President Xi I think is going to be a tremendous help.",
  "I hope Russia likewise will be a tremendous help,\" Trump said.",
  "\"I think they can make a big difference.\"",
  "Earlier, Trump had exchanged schools yard taunts with the country's leader Kim Jong-un.",
  "\"Why would Kim Jong-un insult me by calling me \"old,\" when I would NEVER call him \"short and fat?\"",
  "Trump tweeted from Vietnam, adding: \"Oh well, I try so hard to be his friend - and maybe someday that will happen!\"",
  "Asked whether he could really be friends with Kim, Trump said, \"I think anything's a possibility.",
  "Strange things happen in life.\"",
  "Trump and Putin did not have a formal meeting while they were in Vietnam for the Asia-Pacific Economic Cooperation summit, but the two spoke informally several times and reached an agreement on a number of principles for the future of war-torn Syria.",
  "Trump's comments made clear that Trump still does not take the meddling seriously and sees little benefit in punishing a nation accused of undermining the most fundamental tenet of American democracy: free and fair elections.",
  "They also suggest that Trump is unlikely to work aggressively to try to prevent future meddling despite repeated warnings from senior intelligence officials that Russia is likely to try to interfere again.",
  "___\n\nAssociated Press writers Darlene Superville and Ken Thomas in Washington contributed to this report.",
  "___\n\nFollow Colvin and Lemire on Twitter at http://twitter.com/@colvinj and http://twitter.com/@JonLemire"
]