[
  "Attorney General Jeff Sessions on Tuesday again revised his account of what he knew about the Trump campaign's dealings with Russians, acknowledging for the first time that he recalled a meeting where a foreign policy adviser mentioned having contacts who could possibly broker a meeting between then-candidate Donald Trump and Russian President Vladi­mir Putin.",
  "Testifying before the House Judiciary Committee, Sessions said he now remembered adviser George Papadopoulos saying in March 2016 that he knew people who might be able to help arrange a Trump-Putin meeting.",
  "When Sessions was asked last month whether he thought surrogates from the Trump campaign had communications with the Russians, he said, \"I did not, and I'm not aware of anyone else that did, and I don't believe it happened.\"",
  "But at Tuesday's hearing, Sessions said his memory had been refreshed.",
  "[4 key takeaways from Sessions’s memory-lapse-filled congressional hearing]\n\n\"I do now recall the March 2016 meeting at the Trump hotel that Mr. Papadopoulos attended, but I have no clear recollection of the details of what he said at that meeting,\" Sessions told lawmakers.",
  "\"After reading his account, and to the best of my recollection, I believe that I wanted to make clear to him that he was not authorized to represent the campaign with the Russian government or any other foreign government, for that matter.\"",
  "Attorney General Jeff Sessions testifies before the House Judiciary Committee.",
  "(Reynold/Epa-Efe/Rex/Shutterstock/Reynold/Epa-Efe/Rex/Shutterstock)\n\nSessions added later: \"I remember the pushback.",
  "I remember that he suggested an ability to negotiate with Russians or others, and I thought he had no ability, or it would not be appropriate for him to do so.\"",
  "The more-than-five-hour hearing marked the first time Sessions has personally addressed apparent discrepancies that have emerged in recent weeks between what he has said publicly and what other Trump advisers have claimed about their Russia-related dealings.",
  "Papadopoulos pleaded guilty in early October to lying to the FBI, admitting he told Trump, Sessions and other campaign officials that he had contacts who could help arrange a meeting between Trump and Putin.",
  "Separately, former Trump campaign foreign policy adviser Carter Page testified before the House Intelligence Committee recently that he had told Sessions of his plans to travel to Moscow.",
  "Democrats questioned Sessions about his dealings with both men, noting that their accounts were out of sync with what Sessions had said previously and that his account of Russia-related matters had shifted multiple times.",
  "\"I hope the attorney general can provide some clarification on this problem in his remarks today,\" said Rep. John Conyers Jr. (D-Mich.).",
  "The hearing at times grew heated, as Sessions insisted that he had \"always told the truth\" and bristled at the suggestion that he had ever misled legislators or the public.",
  "He said his memory had been refreshed by news accounts and asserted that he still did not recall his conversation with Page — though he added that he was \"not able to dispute it.\"",
  "Page has also said the interaction was brief and forgettable, as he was not traveling to Moscow for the campaign.",
  "\"Does that establish some sort of improper contact with the Russians?\"",
  "Sessions rhetorically asked Rep. Hakeem Jeffries (D-N.Y.).",
  "The hearing was Sessions's first appearance before the House Judiciary Committee, and it came as the attorney general found himself a key figure in several major news events.",
  "A day earlier, the Justice Department sent a letter to committee Chairman Bob Goodlatte (R-Va.), saying Sessions had directed senior federal prosecutors to explore whether a second special counsel should be appointed to probe a host of GOP concerns — possibly including alleged wrongdoing by the Clinton Foundation and the controversial sale of a uranium company to Russia.",
  "[Sessions considering second special counsel to investigate Republican concerns, letter shows]\n\nUnder critical questioning from Rep. Jim Jordan (R-Ohio), Sessions said he would need a \"factual basis\" to appoint a special counsel and remarked that Jordan's assertions about how things appeared were \"not enough basis\" to do so.",
  "But he later clarified that he \"did not mean to suggest that I was taking a side one way or the other on that subject.\"",
  "The mere suggestion of appointing a special counsel to probe Clinton-related matters drew swift condemnation from Democratic lawmakers, though some commentators said Sessions seemed to be trying simply to mollify conservatives by floating the idea of a second special counsel without actually installing one.",
  "Conyers sought to highlight that Trump had publicly pressed the Justice Department to investigate Clinton-related matters, noting, \"What strikes me about these comments is the president's view that the criminal justice system serves him and not the public.\"",
  "Sessions, though, disputed that he had been inappropriately pushed to do anything.",
  "\"I have not been improperly influenced and would not be improperly influenced,\" he said.",
  "Sessions has said previously that he would recuse himself from any Justice Department investigations of Clinton's email practices or her family's charitable foundation — mindful that his past public comments \"could place my objectivity in question.\"",
  "Sessions was also pressed Tuesday to answer questions about the conduct of Alabama Republican Senate candidate Roy Moore, who is running to fill the seat Sessions once held.",
  "Asked by Rep. Sheila Jackson Lee (D-Tex.)",
  "if he believes the women who have accused Moore of sexual misconduct, Sessions replied, \"I have no reason to doubt these young women.\"",
  "On Monday, an Alabama woman accused Moore of sexually assaulting her in the late 1970s, when she was 16 years old.",
  "That followed a report last week in The Washington Post detailing allegations that Moore initiated a sexual encounter with a 14-year-old girl when he was 32.",
  "Moore has denied the allegations.",
  "Sessions also revealed Tuesday that the Justice Department has 27 open leak investigations, including some that started before Trump took office, compared with nine such inquiries in the latter years of the Obama administration.",
  "And he said he still needs to follow through on a request from senators for information on the steps he's taken to protect U.S. elections from foreign interference.",
  "The main focus of the hearing, though, was Russia and the several occasions on which Sessions's account of the topic has changed.",
  "[At least nine people in Trump’s orbit had contact with Russians during campaign and transition ]\n\nAt his January confirmation hearing to be attorney general, Sessions said he \"did not have communications with the Russians\" during the campaign.",
  "When The Post later revealed that he had twice spoken with Russia's ambassador to the United States, he revised his account, saying that he had no meetings with Russians \"to discuss issues of the campaign.\"",
  "The Post reported in July that Russia's U.S. ambassador told his superiors that he and Sessions discussed campaign-related matters, including policy issues important to Moscow.",
  "And at an October appearance before the Senate Judiciary Committee, Sessions seemed to shift his position again.",
  "That time, he said he had conducted no \"improper discussions with Russians at any time regarding a campaign or any other item facing this country,\" although he acknowledged that it was possible in one of his conversations that \"some comment was made about what Trump's positions were.\"",
  "Several Democratic legislators highlighted the evolving statements, and at one point, an exasperated Sessions exclaimed, \"I certainly didn't mean I hadn't met a Russian in my life.\"",
  "Jeffries asserted that Sessions had previously criticized Clinton for her lack of recall during an FBI interview and said intentionally forgetting might be criminal.",
  "\"Do you still believe that the intentional failure to remember can constitute a criminal act?\"",
  "Jeffries asked.",
  "\"If it's an act to deceive,\" Sessions responded, \"yes.\"",
  "Read more:\n\nSessions considering second special counsel to investigate Republican concerns, letter shows\n\nAll the known times the Trump campaign met with Russians"
]