[
  "President Trump's adviser and son-in-law Jared Kushner received and forwarded emails about WikiLeaks and a \"Russian backdoor overture and dinner invite\" that he kept from Senate Judiciary Committee investigators, according to panel leaders demanding that he produce the missing records.",
  "Committee Chairman Charles E. Grassley (R-Iowa) and ranking member Dianne Feinstein (D-Calif.) sent a letter to Kushner's lawyer Abbe Lowell on Thursday charging that Kushner has failed to disclose several documents, records and transcripts in response to multiple inquiries from committee investigators.",
  "In the letter, Grassley and Feinstein instruct Kushner's team to turn over \"several documents that are known to exist\" because other witnesses in their probe already gave them to investigators.",
  "They include a series of \"September 2016 email communications to Mr. Kushner concerning WikiLeaks,\" which the committee leaders say Kushner then forwarded to another campaign official.",
  "Earlier this week, Trump's son Donald Trump Jr. revealed that he had had direct communication with WikiLeaks over private Twitter messages during the campaign.",
  "[Donald Trump Jr. communicated with WikiLeaks during 2016 campaign]\n\nCommittee leaders said Kushner also withheld from the committee \"documents concerning a 'Russian backdoor overture and dinner invite' \" that he had forwarded to other campaign officials.",
  "And they said Kushner had been made privy to \"communications with Sergei Millian\" — a Belarusan American businessman who claims close ties to the Trumps and was the source of salacious details in a dossier about the president's 2013 trip to Moscow — but failed to turn those records over to investigators.",
  "\"You also have not produced any phone records that we presume exist and would relate to Mr. Kushner's communications,\" Grassley and Feinstein wrote.",
  "Grassley and Feinstein demanded that Kushner comply with their request for documents by Nov. 27, but stopped short of issuing a formal threat to subpoena those records if Kushner misses the deadline.",
  "Kushner's team last produced documents to the committee Nov. 3, according to Grassley and Feinstein, who stressed that what they received \"appears to be incomplete.\"",
  "They noted that their letter was an effort \"to clarify the scope\" of the committee's request, after Lowell asked for more details about precisely what the committee was searching for.",
  "In addition to the emails and records that Grassley and Feinstein noted as missing, the Judiciary Committee is waiting for Kushner to turn over promised transcripts from his interview with other committees.",
  "Kushner has spoken with investigators from both the Senate and House intelligence committees, but has not met with the Senate Judiciary Committee.",
  "[Kushner questioned by Senate investigators on Russia]\n\nGrassley and Feinstein also wrote that Kushner's team \"should produce\" his SF-86 security clearance forms, which Kushner had to update on more than one occasion because he left out contacts with foreign individuals.",
  "Kushner's team has argued that the forms are confidential — an argument the committee leaders do not accept.",
  "The committee leaders also expressed general frustration that Kushner's team had left out communications about individuals they had identified when asking Kushner to turn over his records.",
  "Finally, the committee leaders asked Kushner's team to search for a series of records of communications with and about former national security adviser Michael Flynn, including any that Flynn may have simply been copied on involving many of the Russian individuals and businesses that were known to have contact with members of Trump's campaign team.",
  "Read more at PowerPost"
]