[
  "WASHINGTON — Former national security adviser Michael Flynn pleaded guilty Friday to making false statements to the FBI, the first Trump White House official to make a guilty plea so far in a wide-ranging investigation led by special counsel Robert Mueller.",
  "The fact that Flynn was charged only with a single count of false statements suggests he is cooperating with Mueller’s investigation in exchange for leniency.",
  "Court documents show Flynn, an early and vocal supporter on the campaign trail of President Donald Trump whose business dealings and foreign interactions made him a central focus of Mueller’s investigation, will admit to lying about his conversations with Russia’s ambassador to the United States during the transition period before Trump’s inauguration.",
  "The expected guilty plea makes the retired Army lieutenant general the first person to have actually worked in the Trump White House to face formal charges in the investigation, which is examining possible coordination between Russia and the Trump campaign to influence the outcome of the 2016 election.",
  "Flynn has been under investigation for a wide range of allegations, including lobbying work on behalf of Turkey, but the fact that he was charged only with a single count of false statements suggests he is cooperating with Mueller’s investigation in exchange for leniency.",
  "He was present for consequential moments in the campaign, the transition period and the early days of Trump’s presidency, campaign, making him a valuable potential tool for prosecutors and agents.",
  "Early on in is administration, Trump had taken a particular interest in the status of the Flynn investigation.",
  "Former FBI Director James Comey, whose firing in May precipitated the appointment of Mueller as special counsel, has said Trump had asked him in a private Oval Office meeting to consider ending the investigation into Flynn.",
  "Comey has said the encounter unnerved him so much that he prepared an internal memo about it.",
  "The White House has denied that assertion.",
  "Flynn, who was interviewed by the FBI just days after Trump’s inauguration, was forced to resign in February after White House officials said he had misled them about whether he had discussed sanctions with the Russian ambassador, Sergey Kislyak.",
  "Administration officials said Flynn had not discussed sanctions that had been imposed on Russia in part over election meddling.",
  "In charging Flynn, prosecutors made clear they believe that claim to be false.",
  "Days after Flynn’s interview with the FBI, then-acting attorney general, Sally Yates alerted White House counsel Don McGahn that Flynn was potentially compromised and vulnerable to blackmail because of discrepancies between public assertions — including by Vice President Mike Pence — that Flynn and Kislyak had not discussed sanctions and the reality of what occurred.",
  "Mueller’s team announced charges in October against three other Trump campaign officials, former chairman Paul Manafort and his business associate Rick Gates, and a former campaign foreign policy adviser, George Papadopoulos.",
  "Papadopoulos pleaded guilty to lying to the FBI about his own foreign contacts.",
  "Signs of Flynn cooperating with Mueller’s team surfaced in the past week, as his lawyers told the legal team they could no longer discuss information about the case with them.",
  "Scheduled grand jury testimony regarding Flynn was also postponed by prosecutors.",
  "The two-page charging document makes reference to two separate conversations with Kislyak, and to separate false statements prosecutors say he made regarding that communication.",
  "Besides a Dec. 29 conversation about sanctions, prosecutors also cite an earlier December meeting, in which Flynn asked Kislyak to delay or defeat a U.N. Security Council resolution.",
  "That appears to refer to the body’s vote a day later to condemn Israeli settlements in the West Bank.",
  "In a striking rupture with past practice, the Obama administration refrained from vetoing the condemnation, opting instead to abstain.",
  "The rest of the 15-nation council, including Russia, voted unanimously against Israel.",
  "At the time, Israel was lobbying furiously against the resolution and President-elect Trump’s team spoke up on behalf of the Jewish state.",
  "Trump personally called Egyptian President Abdel-Fattah el-Sissi to press the case against the condemnation, and Egypt surprisingly postponed the scheduled showdown on Dec. 22 — the same day Flynn met Kislyak.",
  "After more procedural wrangling, the vote occurred a day later.",
  "Trump almost immediately condemned the U.N. result via Twitter.",
  "“As to the U.N., things will be different after Jan. 20th,” Trump said, referencing his upcoming inauguration.",
  "Read the full plea agreement:\n\nMichael Flynn Plea Agreement by PBS NewsHour on Scribd\n\nThis is a developing story and will be updated."
]