[
  "As the first year of the Trump administration comes to a close, one can't help but look back on how allegations of “Russian collusion” dominated the headlines of almost every news agency.",
  "Hearings, leaks, and so-called \"bombshells\" saturated the mainstream media coverage almost immediately after the 2016 presidential campaign concluded.",
  "Sadly, manufactured hysteria on this issue throughout 2017 has frequently masked the substantial accomplishments of President Trump’s administration — some that qualify as historic.",
  "The stock market has surged at levels not seen in nearly a decade.",
  "The Islamic State has been decimated in the Middle East.",
  "Our embassy in Israel is moving to Jerusalem, Israel’s undivided capital.",
  "Trump delivered on the largest tax cuts and overhaul to the tax code since the Reagan administration.",
  "These are just a few examples.",
  "Yet, in spite of the constant headlines, rampant speculation, and overshadowing of accomplishments, a simple truth remains: There is no evidence of any collusion between the Trump campaign and the Russians.",
  "And let's be clear: The absence of evidence is not due to a lack of examination.",
  "There have been some six different investigations spent on the collusion narrative — more than the investigative efforts on former President Barack Obama’s IRS targeting of conservatives, the 30,000 missing Hillary Clinton emails, and Benghazi.",
  "And through all of that, there is zero (yes, zero) evidence of collusion.",
  "Even with the complete dearth of evidence Congressional hearings have produced, the narrative machine continues to mobilize.",
  "Last week, the New York Times published an article using four current and former anonymous intelligence officials to suggest that George Papadopoulos, a Trump campaign volunteer, was a “driving factor” who triggered the FBI’s spying on the Trump campaign.",
  "These anonymous sources claim that Papadopoulos, during a night of drinking at a bar in Europe, tipped off Australian diplomats about Russian collusion efforts, which ultimately led to the FBI opening an investigation.",
  "Now, even if we put aside what should be an automatic mistrust of the motives behind anonymous intelligence officials sharing details about an ongoing investigation, there are two critical problems with the story.",
  "First, belief in this narrative at face value requires one to blatantly disregard a series of fundamental questions:\n\nQuestion 1: If George Papadopoulos was central to the FBI’s investigation of the Trump campaign, why did the FBI wait more than 6 months to interview him in late January and again in February?",
  "And even if they were trying to keep the probe quiet during the 2016 election, why wait more than 2 months after Election Day?",
  "Question 2: If Papadopoulos was so critical to the investigation, why did the FBI get a Foreign Intelligence Surveillance Act, or FISA, warrant on Carter Page in the summer of 2016 but not on Papadopoulos, the alleged central player?",
  "Question 3: If Papadopoulos was key to a collusion investigation and evidence existed supporting that claim, why would Bruce Ohr, the former DOJ official married to Fusion GPS’ investigator, meet with Christopher Steele, author of the so-called \"Trump dossier\" hired by the Clinton campaign, before and after the election?",
  "Question 4: Why would former FBI Director James Comey brief President Obama and President-Elect Trump on the contents of the Russian dossier, but not do the same thing on this campaign staffer’s alleged collusion?",
  "Question 5: Why won’t the FBI answer questions from Congress on this very topic?",
  "Why do they continue to refuse transparency on whether they paid Christopher Steele for the Russian Dossier?",
  "We in Congress have asked them repeatedly to tell us what was in the application they took to the FISA Court to get a warrant for spying on the Trump campaign.",
  "Did they use the dossier in their application?",
  "This demands an answer.",
  "Perhaps all of these questions have answers that could help bring this Russian collusion drama to a close.",
  "But it seems remarkably odd that instead of the FBI answering the critical questions that Congress has repeatedly asked, they instead leak a far-fetched and ill-supported story to the New York Times.",
  "If this is the truth, then give us the documentation we’ve asked for to prove it.",
  "The second problem deals with a recurring issue that must be addressed immediately.",
  "The alarming number of FBI agents and DOJ officials sharing information with reporters is in clear violation of the investigative standards that Americans expect and should demand.",
  "How would New York Times reporters know any of this information when the FBI and DOJ are prohibited from talking about ongoing investigations?",
  "How many FBI agents and DOJ officials have illegally discussed aspects of an ongoing investigation with reporters?",
  "When will it stop?",
  "It’s apparent that Comey has never had a problem sharing information with reporters, and he allowed his team to \"follow the leader\" in that regard—but it is time for this practice to come to an immediate end.",
  "Attorney General Jeff Sessions has recused himself from the Russia investigation, but it would appear he has no control at all of the premier law enforcement agency in the world.",
  "It is time for Sessions to start managing in a spirit of transparency to bring all of this improper behavior to light and stop further violations.",
  "If Sessions can't address this issue immediately, then we have one final question needing an answer: When is it time for a new attorney general?",
  "Sadly, it seems the answer is now.",
  "Rep. Mark Meadows, R-N.C., represents North Carolina's 11th District in Congress.",
  "He is chair of the House Freedom Caucus.",
  "Rep. Jim Jordan, R-Ohio, represents Ohio's 4th District in Congress.",
  "He is a member of the House Freedom Caucus and served as its first chairman."
]