[
  "More than 20 White House officials have voluntarily given interviews to special counsel investigators probing Russia's interference in the 2016 election, according to a document released Thursday by John Dowd, one of President Trump's attorneys.",
  "The White House has also turned over 20,000 pages of documents to special counsel Robert S. Mueller III, including hundreds of documents related to former FBI director James B. Comey and former national security adviser Michael Flynn and Russia, according to the one-page memo.",
  "[Read the memo from Trump’s personal lawyer]\n\nMueller's investigators have indicated to the White House they are interested in questioning Trump about the ousters of both Comey and Flynn.",
  "Dowd said he created the document to \"summarize this extraordinary cooperation,\" arguing the administration has provided \"unprecedented\" transparency to the Russia probes.",
  "He called it \"the most transparent response in history by a president\" to a special counsel.",
  "Peter Carr, a spokesman for Mueller, declined to comment.",
  "The emphasis by Trump's legal team on its cooperation with the special counsel comes as congressional Republicans and Trump allies have accused the Justice Department and FBI of bias in its investigation, charges that have escalated in recent days.",
  "[Trump says he would speak to Mueller under oath in Russia investigation]\n\nThe president's attorneys sought on Thursday to stress how much material has been shared with investigators.",
  "Trump's presidential campaign turned over 1.4 million pages to the special counsel, and 17 campaign staffers — along with 11 individuals affiliated with the campaign — gave interviews to Mueller's team or congressional committees, according to Dowd's memo.",
  "For his part, Trump said Wednesday that he was \"looking forward\" to being interviewed by Mueller's team, a session that is expected to occur in the coming weeks.",
  "\"I would love to do it, and I would like to do it as soon as possible,\" Trump told reporters at the White House.",
  "\"I would do it under oath, absolutely.\"",
  "The president also suggested he had been unfairly targeted as part of an obstruction investigation because he was \"fighting back,\" reiterating there was \"no collusion\" between his campaign and Moscow.",
  "\"You fight back, 'Oh, it's obstruction,' \" he said."
]