[
  "Rick Gates, a former top official in President Trump’s campaign, pleaded guilty Friday afternoon to conspiracy and lying to the FBI, striking a deal to cooperate and provide information to special counsel Robert S. Mueller III’s ongoing investigation as it edges closer to the White House.",
  "The plea caps a tumultuous 24 hours for Gates in which he was hit with fresh charges, changed lawyers, admitted crimes and agreed to provide information about his ex-boss — former Trump campaign chairman Paul Manafort.",
  "Gates’s plea raises the pressure on Manafort, who now faces the prospect of fighting two separate indictments charging him with dozens of financial crimes — cases that are now buttressed by the likely testimony of his former right-hand man.",
  "Manafort expressed surprise at Gates’s decision but still vowed to beat the charges against him.",
  "“Notwithstanding that Rick Gates pleaded today, I continue to maintain my innocence,” Manafort said in a statement.",
  "“I had hoped and expected my business colleague would have had the strength to continue the battle to prove our innocence.",
  "For reasons yet to surface he chose to do otherwise.",
  "This does not alter my commitment to defend myself against the untrue piled-up charges contained in the indictments against me.”\n\nGates’s guilty plea marks a busy period for Mueller’s investigation of Russia’s interference in the 2016 election and related issues.",
  "A Mueller grand jury charged 13 Russians this month with participating in a criminal scheme to disrupt the election and a London-based lawyer pleaded guilty Tuesday to lying to FBI agents on the case.",
  "As part of Gates’s plea, he admitted conspiring to defraud the United States regarding the millions of dollars he and Manafort earned while working for a political party in Ukraine.",
  "He also pleaded guilty to lying to the FBI earlier this month during an interview in which he was trying to secure a plea deal.",
  "[Read the superseding criminal information filed against Rick Gates]\n\nWhile the two charges together carry a possible prison sentence of up to 10 years, Gates and prosecutors agreed he would face a recommended sentence of roughly five to six years in prison.",
  "The final sentence will be made by a judge, after hearing from prosecutors about Gates’s role in the crimes at issue and how useful his cooperation was to prosecutors.",
  "As part of the deal, prosecutors also dropped a forfeiture demand that could have made Gates liable for up to $18 million if convicted.",
  "Also on Friday, prosecutors updated one of their indictments of Manafort, leveling new accusations that in 2012 he and Gates “secretly retained a group of former senior European politicians to take positions favorable to Ukraine, including by lobbying in the United States.",
  "The plan was for the former politicians, informally called the ‘Hapsburg group,’ to appear to be providing their independent assessments of actions by the Kiev government, when in fact they were paid lobbyists for Ukraine.”\n\nIn 2012 and 2013, according to the indictment, Manafort used offshore accounts to wire more than 2 million euros to pay the former politicians.",
  "“The group was managed by a former European Chancellor, Foreign Politician A, in coordination with Manafort,” the indictment charges.",
  "The charges against Manafort and Gates do not involve activities inside the Trump campaign, although the conduct in question continued while they worked there.",
  "Instead, the special counsel accused the men of lying on their income-tax returns and conspiring to commit bank fraud to get loans as part of an elaborate scheme to use their income from the Ukrainian political party to buy properties, evade taxes and support Manafort’s lavish lifestyle.",
  "Prosecutors charge that Manafort, with help from Gates, laundered more than $30 million between 2006 and 2016, and Gates transferred more than $3 million to accounts he controlled during that time.",
  "[Special counsel Mueller files new charges against Manafort, Gates]\n\nGates is the third former Trump aide to publicly admit guilt in Mueller’s probe.",
  "Unlike Manafort, who resigned from his position as Trump’s campaign chairman in August 2016, Gates remained with the campaign until Election Day, working at one point for the Republican National Committee.",
  "He then joined the inaugural committee as deputy chairman.",
  "Once Trump took office, Gates helped launch an allied group to support the president’s agenda and was a regular visitor at the White House.",
  "[Rick Gates, once the man ‘in the corner,’ is now a central figure in Mueller investigation]\n\nThe Gates plea also shows how Mueller’s investigation is reaching further into the world of Washington lobbying.",
  "As part of his guilty plea, Gates admitted lying to the FBI earlier this month when he claimed that a March 2013 meeting with a lobbyist and a congressman did not include a discussion of Ukraine.",
  "Although court papers do not identify them, people familiar with the case said the lobbyist was Vin Weber of Mercury, and the lawmaker was Rep. Dana Rohrabacher (R-Calif.).",
  "Rohrabacher has been interviewed by the FBI, according to Ken Grubbs, a spokesman for the congressman.",
  "“As the congressman has acknowledged before, the meeting was a dinner with two longtime acquaintances — Manafort and Weber — from back in his White House and early congressional days,’’ Grubbs said.",
  "“The three reminisced and talked mostly about politics.",
  "The subject of Ukraine came up in passing.",
  "... As chairman of the relevant European subcommittee, the congressman has listened to all points of view on Ukraine.",
  "We may only speculate that Manafort needed to report back to his client that Ukraine was discussed.”\n\nMercury’s Michael McKeon said in a statement that Gates “admitted that he didn’t tell the truth to the Government and didn’t tell the truth to our lawyers when he spoke to them about this project.",
  "While he and others involved with this matter may have acted criminally and tried to hide it, we acted appropriately, following our counsel’s advice throughout the engagement.",
  "We will continue to cooperate with the Special Counsel because we are confident we have acted appropriately throughout.”\n\nThe admitted lie by Gates is remarkable for a couple of reasons.",
  "First, it came at a time when Gates was trying to show prosecutors and the FBI his value as an honest witness in a session lawyers call “Queen for a Day.” Second, he lied about a meeting that Mercury had reported in public regulatory documents months earlier.",
  "Yet according to his plea, when Gates was asked by the FBI about the meeting, he claimed he was told by Manafort and a lobbyist there had been no discussion of Ukraine, when in fact, Gates helped prepare a report in which Manafort detailed the Ukrainian discussions, according to plea documents.",
  "[Who did Manafort and Gates work for in Ukraine and Russia?]",
  "Prosecutors allege that when the Justice Department approached Manafort and Gates in 2016 and 2017 about whether they should have registered as foreign agents for their work for Ukraine, they responded with false and misleading letters.",
  "Manafort and Gates also were accused of trying to hide money kept in foreign bank accounts.",
  "Gates controlled as many as 30 bank accounts last year, including several in Cyprus in which he held more than $10 million, according to court documents.",
  "All told, more than $75 million flowed through offshore accounts, the special counsel alleged.",
  "Tom Hamburger and Michael Kranish contributed to this report."
]