[
  "Redacted Democratic Response To Nunes Memo Defends FBI Surveillance Of Trump Aide\n\nEnlarge this image toggle caption Drew Angerer/Getty Images Drew Angerer/Getty Images\n\nUpdated at 9:30 p.m.",
  "ET\n\nA redacted, unclassified version of a much-anticipated memo drafted by Rep. Adam Schiff, D-Calif., and the other Democrats on the House intelligence committee was released Saturday evening just as Rep. Devin Nunes, R-Calif., the panel's chairman, addressed an annual gathering of conservatives.",
  "The memo is the Democrats' effort to respond to recent Republican efforts, led by Nunes, to argue that the Department of Justice, the FBI and the special counsel investigation led by Robert Mueller are infected with political bias against the Trump campaign and the president.",
  "The memo defends the Justice Department and FBI for its surveillance of former Trump campaign adviser Carter Page during the 2016 presidential campaign.",
  "Nunes had argued, through his own memo released earlier this month, that the FBI had abused its surveillance authority and relied improperly on politically motivated sources — namely former British spy Christopher Steele who had been paid by Fusion GPS, a private intelligence firm hired first by conservative underwriters and then retained by Democrats during the 2016 campaign.",
  "\"FBI and DOJ officials did not 'abuse' the Foreign Intelligence Surveillance Act (FISA) process, omit material information, or subvert this vital tool to spy on the Trump campaign,\" the Democratic memo asserts.",
  "The FBI and DOJ \"would have been remiss in their duty to protect the country had they not sought a FISA warrant and repeated renewals to conduct temporary surveillance of Carter Page,\" the Democrats write, adding that the \"DOJ met the rigor, transparency and evidentiary basis needed to meet FISA's probable cause requirement.\"",
  "The Democratic countermemo released Saturday argues that the Nunes memo is filled with incomplete information.",
  "Page had been assessed to be \"an agent of the Russian government,\" the Democratic memo asserts, and the Justice Department was acting to protect national security.",
  "But the White House pushed back on the memo, arguing that the special intelligence court that approved the surveillance of Page was never informed specifically \"that Hillary Clinton and the DNC funded the dossier that was a basis for the Department of Justice's FISA application.\"",
  "\"As the President has long stated, neither he nor his campaign ever colluded with a foreign power during the 2016 election, and nothing in today's memo counters that fact,\" White House press secretary Sarah Huckabee Sanders also in the statement.",
  "And President Trump himself tweeted Saturday evening that the Schiff memo \"confirms all the terrible things that were done.\"",
  "In his own statement about the Democratic memo, Nunes was more scathing than Sanders.",
  "\"The American people now clearly understand that the FBI used political dirt paid for by the Democratic Party to spy on an American citizen from the Republican Party,\" Nunes said.",
  "And after the Democratic memo's release, Schiff sought to move on from allegations that the FBI and DOJ have been politically biased in their Russia investigation, allegations that have been building after a steady Republican drumbeat of accusations over several months.",
  "\"The Democratic response memo released today should put to rest any concerns that the American people might have as to the conduct of the FBI, the Justice Department and the [intelligence court],\" Schiff said in a statement.",
  "\"Our extensive review of the initial FISA application and three subsequent renewals failed to uncover any evidence of illegal, unethical, or unprofessional behavior by law enforcement and instead revealed that both the FBI and DOJ made extensive showings to justify all four requests.\"",
  "And on Twitter Saturday evening, Schiff responded to Trump's tweet saying \"Wrong again, Mr. President.",
  "[The memo] confirms the FBI acted appropriately ...\"\n\nThe Democratic memo argues the warrants for surveillance of Page included evidence that Russia was interfering in the election, that Russia had made outreach to Trump campaign officials, that Page had a history with Russian intelligence and that Page was involved in \"suspicious activities\" during a trip to Moscow during the campaign.",
  "Instead of being a flawed, politically biased document intended to get permission to spy on the Trump campaign, the warrant application met all the necessary requirements to show probable cause, according to the committee's Democrats.",
  "The warrant request outlined Page's history as someone who pursued business deals with Russia's state-owned energy company, had been targeted by Russian intelligence for recruitment, and had visited Moscow while an adviser to Trump's campaign, the memo says.",
  "These requests to surveil Page then received independent scrutiny and approval by four federal judges, all appointed by Republican presidents — two appointed by George W. Bush, one by George H.W.",
  "Bush and one by Ronald Reagan — the memo points out.",
  "The counterintelligence investigation into Page, the memo continues, was not initiated by reporting from Steele, but instead started seven weeks earlier.",
  "The information that law enforcement officials did use from Steele was \"narrow\" and concerned Page's suspected July 2016 meetings in Moscow with Russian officials.",
  "The trustworthiness of the dossier compiled by Steele about Trump's ties to Russia has been at the center of attacks by Trump's allies on the fundamental allegation that his presidential campaign might have conspired with the Russian attack during the 2016 election, an allegation under investigation by Mueller's team.",
  "According to Schiff's memo, the FBI used other sources to back up some of its assertions in the warrant application seeking permission to surveil Page.",
  "\"DOJ cited multiple sources to support the case for surveilling Page,\" the memo says, and further disclosed Steele's previous work with the FBI, as well as the fact that he had been \"hired by politically-motivated U.S. persons and entities and that his research appeared intended for use 'to discredit' Trump's campaign.\"",
  "This contradicts the Nunes memo assertion that such information had been omitted.",
  "\"In subsequent FISA renewals, DOJ provided additional information obtained through multiple independent sources that corroborated Steele's reporting,\" the Democratic memo also says.",
  "Because the Schiff memo has been redacted, the details are blacked out.",
  "Confirmation of some aspects of Steele's dossier is significant, however, because until now there has been no way for the public to assess how much credence it merits.",
  "NPR and other news organizations have not detailed the contents of the Steele dossier because it is unverified, but the file was posted online in full in January 2017 by BuzzFeed News and so its contents are public.",
  "Schiff's memo also notes that Page was no longer affiliated with the Trump campaign when federal officials first applied for a surveillance warrant against him.",
  "Nunes announced that the Schiff memo was being released as he spoke to the Conservative Political Action Conference at the National Habor in Maryland Saturday evening.",
  "At the end of Nunes' nearly 30-minute Q&A session with Matt Schlapp, chairman of the American Conservative Union which puts on the annual gathering, Nunes received the organization's Defender of Freedom Award for his \"unwavering valor and often lonely pursuit of truth on behalf of the American people.\"",
  "Before receiving the award, Nunes told the crowd that \"the American people deserve to know the truth and the House intelligence committee will continue to plod through our work — with or without the support of the media — and we'll get the facts.\"",
  "Despite the tense relations on the committee between its Republicans led by Nunes and its Democrats led by Schiff, the panel's top Democrat delivered a similar message Saturday.",
  "\"Now that the public has a clearer understanding of the early phases of the investigation, it is time for our committee to return to the core investigation into Russian interference in the 2016 campaign, the role U.S. persons played in that interference and what we need to do to protect the country going forward,\" Schiff also said in his statement after the Democratic memo's release."
]