[
  "Sessions’s reasoning is difficult to independently evaluate, because the underlying Inspector General’s report outlining McCabe’s conduct has yet to be released.",
  "But Matthew Miller, a former Justice Department spokesman under Attorney General Eric Holder, suggested that even if the cause was legitimate, Sessions's timing reflects political pressure from the president.",
  "“I put a lot of faith in the Inspector General and the career people in [the Office of Professional Responsibility] and the senior career officials at DOJ, who all seem to have reviewed this and agreed that McCabe should be disciplined,” Miller said.",
  "“I do think that this moved as quickly as it did because the attorney general was trying to appease the president.",
  "Left to the normal process, this would not have happened this quickly, and you would not have seen it until the Inspector General’s report was released.”\n\nMcCabe was one of the FBI officials overseeing the Clinton investigation, which ended without prosecution.",
  "While Sessions did not identify the news outlet to which the FBI disclosed information, in 2016 McCabe authorized bureau personnel to talk to a Wall Street Journal reporter about a potential investigation of the Clinton Foundation.",
  "McCabe is also reportedly a witness in Mueller’s investigation, which is additionally examining whether the president sought to obstruct justice when he fired former FBI Director James Comey last May.",
  "McCabe cited his involvement in the inquiry in a statement released to the press on Friday.",
  "He described his dismissal as retaliatory:\n\nI am being singled out and treated this way because of the role I played, the actions I took, and the events I witnessed in the aftermath of the firing of James Comey.",
  "The release of this report was accelerated only after my testimony to the House Intelligence Committee revealed that I would corroborate former Director Comey’s accounts of his discussions with the President.",
  "The OIG’s focus on me and this report became a part of an unprecedented effort by the Administration, driven by the President himself, to remove me from my position, destroy my reputation, and possibly strip me of a pension that I worked 21 years to earn.",
  "The accelerated release of the report, and the punitive actions taken in response, make sense only when viewed through this lens.",
  "McCabe has repeatedly attracted the ire of the president and his supporters.",
  "McCabe’s wife, Jill, ran for state Senate as a Democrat in Virginia, which Trump later said compromised McCabe’s role in overseeing the FBI’s Clinton probe.",
  "That investigation ended with a public press conference in July in which then-FBI Director Comey declined to prosecute Clinton, even as he characterized her handling of classified information as reckless.",
  "On Twitter, Trump repeatedly singled out McCabe, writing in December 2017, for example, that “FBI Deputy Director Andrew McCabe is racing the clock to retire with full benefits.",
  "90 days to go?!!",
  "!” Privately, Trump reportedly asked McCabe to “ask his wife how it feels to be a loser,” in reference to her earlier campaign.",
  "He also reportedly asked McCabe who he voted for in the 2016 election.",
  "(According to a CNN report, McCabe voted in the 2016 Republican primary in Virginia, but not the general election.)"
]