[
  "President Donald Trump’s personal lawyer, John Dowd, told The Daily Beast on Saturday morning that he hopes Deputy Attorney General Rod Rosenstein will shut down special counsel Robert Mueller’s probe into Russia’s election interference.",
  "Reached for comment by email about the firing of former Deputy FBI Director Andrew McCabe, Dowd sent The Daily Beast the text of Trump’s most recent tweet on the subject, which applauded the dismissal.",
  "“I pray that Acting Attorney General Rosenstein will follow the brilliant and courageous example of the FBI Office of Professional Responsibility and Attorney General Jeff Sessions and bring an end to alleged Russia Collusion investigation manufactured by McCabe’s boss James Comey based upon a fraudulent and corrupt Dossier,” Dowd then wrote.",
  "In making the statement, a senior member of Trump’s legal team joins the calls from his base to end the probe.",
  "As late as mid-December, another Trump lawyer, Ty Cobb, had brushed aside talk of stopped Mueller’s investigation, stressing that there was “no consideration at the White House of terminating the special counsel.” The president himself has called the Mueller probe a “witch hunt,” but has not publicly urged Rosenstein to shutter it.",
  "When The Daily Beast initially asked Dowd if he was speaking on behalf of the president, he answered, “Yes as his counsel.” After publication of this story, however, Dowd emailed to say he was actually speaking in his personal capacity, and not on the president’s behalf.",
  "The White House did not immediately return a request for comment.",
  "As part of his initial email, Dowd included the text below, which is an annotated version of a line from a well-known 20th-century play:\n\nWhat’s that smell in this room[Bureau}?",
  "Didn’t you notice it, Brick [Jim]?",
  "Didn’t you notice a powerful and obnoxious odor of mendacity in this room[Bureau}?...",
  "There ain’t nothin’ more powerful than the odor of mendacity[corruption]... You can smell it.",
  "It smells like death.",
  "Tennessee Williams- Cat on a Hot Tin Roof\n\nRosenstein, who is overseeing the probe because Attorney General Jeff Sessions recused himself from matters related to the 2016 campaign, has publicly defended and praised Mueller’s work.",
  "Five days ago, he told USA Today, “The special counsel is not an unguided missile...",
  "I don’t believe there is any justification at this point for terminating the special counsel.”\n\nSessions announced on Friday night that he had fired McCabe, citing “lack of candor”—a fireable offense in the bureau.",
  "McCabe has long been a top target for Republicans, in part because his wife ran for office in Virginia as a Democrat and took campaign contributions from a close ally of Hillary Clinton.",
  "McCabe also featured in a controversial memo from Republicans on the House intelligence committee, which charged he improperly obtained authorization to surveil a former Trump campaign employee.",
  "McCabe has defended the way he obtained the warrant.",
  "UPDATE 11:09 a.m.: This story has been updated throughout, including with Dowd’s new statement that he was speaking only in a personal capacity."
]