[
  "President takes more than 75% of vote according to partial results, extending Putin’s time in office to nearly a quarter of a century\n\nVladimir Putin cruised to victory in Sunday’s presidential elections in a result that was never in question.",
  "His fourth term as president will extend until 2024, making him the first Kremlin leader to serve two decades in power since Josef Stalin.",
  "With results still coming in, Putin looked set to exceed expectations by clinching more than 75% of the vote.",
  "Putin 4.0: as Russian president prepares for fourth term, what next?",
  "Read more\n\nTurnout, which was seen as a measure of the Kremlin’s legitimacy in this uncompetitive campaign, was close to 60% as of 9pm GMT on Sunday evening after a long day of voting.",
  "The Kremlin had hoped to match the 65% who cast votes in 2012 and had initially sought 70% turnout.",
  "“Thank you for your support,” Putin told crowds on Manezhnaya Square just under the Kremlin walls, wearing a black down jacket with a fur hood.",
  "“Everyone who voted today is part of our big, national team.”\n\nAsked by a journalist about whether he would consider future runs for president, he responded: “What you’re saying is just silly … what, am I going to sit here for 100 years?”\n\nAsked about the poisoning of Sergei Skripal in Britain, he said Russia did not currently have chemical weapons and it would be “nonsense” to think Russia would launch such an attack in the lead up to an election.",
  "Putin said that if the substance used in the attack had really been a military nerve agent, then it would have killed anyone targeted on the spot.",
  "Play Video 0:48 Vladimir Putin: 'Nonsense' to think Russia would poison ex-spy before election - video\n\nRussians had a choice of eight candidates, including the Communist Pavel Grudinin, whose title to a former state fruit farm has made him a millionaire, and Ksenia Sobchak, the daughter of Putin’s political mentor, who presented a liberal programme.",
  "Putin’s campaign chairman, Andrei Kondrashov, declared turnout to be high and needled London by suggesting that may be a rally-round-the-flag response by voters to the accusations over the Salisbury attack.",
  "“Right now the turnout numbers are higher than we expected.",
  "We need to thank Great Britain for that because once again they did not consider the Russian mentality,” said the campaign chairman.",
  "“Once again we were subject to pressure at just the moment when we needed to mobilise.”\n\nRussian voters go to the polls – in pictures Read more\n\nTurnout was the main focus of the campaign in recent weeks, with the Kremlin launching a broad get-out-the-vote campaign, which included selfie contests and raffles of iPhones and even cars for voters.",
  "The opposition declared a boycott and sent observers across the country to monitor the voting process.",
  "Play Video 1:07 Russian election footage appears to show vote rigging - video\n\nMonitors organised by opposition leader Alexei Navalny and others complained of ballot stuffing and other methods of increasing turnout in Sunday’s votes, but an official from Russia’s elections committee said no serious violations had taken place."
]