[
  "Justice Department Inspector General Michael Horowitz announced Wednesday he will review potential Foreign Intelligence Surveillance Act (FISA) abuses by both the Justice Department and the FBI, following requests from Congress and Attorney General Jeff Sessions.",
  "The Office of the Inspector General released a statement Wednesday outlining the start of the review.",
  "“The OIG will initiate a review that will examine the Justice Department’s and the Federal Bureau of Investigation’s compliance with legal requirements, and with applicable DOJ and FBI policies and procedures, in applications filed with the U.S. Foreign Intelligence Surveillance Court (FISC) relating to a certain U.S. person,” the statement obtained by Fox News read.",
  "“As part of this examination, the OIG also will review information that was known to the DOJ and the FBI at the time the applications were filed from or about an alleged FBI confidential source.”\n\nThe OIG statement added that Horowitz also would “review the DOJ’s and FBI’s relationship and communications with the alleged source as they relate to the FISC applications.”\n\nThe statement continued, “If circumstances warrant, the OIG will consider including other issues that may arise during the course of the review.”\n\nLast month, Sessions directed Horowitz to probe the allegations of government surveillance abuse, in light of memos released on Capitol Hill by the House Intelligence Committee about FBI and DOJ efforts to obtain FISA warrants to surveil Trump campaign adviser Carter Page.",
  "“We believe the Department of Justice must adhere to the high standards in the FISA court,” Sessions said in February at a news conference.",
  "“Yes it will be investigated.",
  "And I think that’s just the appropriate thing the inspector general will take that as one of the matters he’ll deal with.”\n\n“Thus far, members of Congress and Russian entrepreneurs in U.S. courts have made the greatest initial progress in getting to the bottom of Washington’s illegal influence on the 2016 election.",
  "Whereas many of these illicit schemes allegedly occurred in part within DOJ, it’s encouraging that members of their staff are now investigating the increasingly clear pattern of wrongdoing,” Page told Fox News on Wednesday.",
  "House Intel Republicans released a memo in late February detailing the DOJ's and FBI’s surveillance of Page, saying the infamous anti-Trump dossier funded by Democrats “formed an essential part” of the application to spy on him.",
  "The dossier, authored by former British spy Christopher Steele and commissioned by Fusion GPS, was funded in part by the Democratic National Committee and Hillary Clinton’s presidential campaign through the law firm Perkins Coie.",
  "It included salacious and unverified allegations about President Trump’s connections to Russia.",
  "The Republican memo stated that former FBI Deputy Director Andrew McCabe testified that “no surveillance warrant would have been sought” from the FISA court “without the Steele dossier information.”\n\nThe memo also said Steele, who worked as an FBI informant, eventually was cut off from the bureau for what the FBI described as the most serious of violations, “an unauthorized disclosure to the media of his relationship with the FBI.”\n\nThe memo noted that the FBI and DOJ obtained “one initial FISA warrant” targeting Page and three FISA renewals from the FISC.",
  "The statute required that every 90 days, a FISA order on an American citizen “must be reviewed.”\n\nFormer FBI Director James Comey signed three FISA applications for Page, while McCabe, current Deputy Attorney General Rod Rosenstein who leads the Russia probe, former Deputy Attorney General Sally Yates and former Acting Deputy Attorney General Dana Boente signed at least one, according the Republican memo.",
  "Democrats, then, released a rebuttal memo.",
  "The White House said the GOP memo raised “serious concerns about the integrity of decisions made at the highest levels of the Department of Justice and the FBI to use the government’s most intrusive surveillance tools against American citizens.”\n\nRepublican lawmakers and Sessions had been pressing Horowitz to probe the alleged FISA abuses.",
  "Senate Judiciary Committee Chairman Chuck Grassley, R-Iowa, said he was \"grateful\" that Horowitz had decided to review the FISA application and the FBI's relationship with Steele.",
  "\"Federal surveillance authority is an important tool to combat terrorism and keep Americans safe, but it must be used by the book in order to protect the constitutional rights and civil liberties of all Americans,\" Grassley said.",
  "\"We need to be sure that improper political influence, misconduct or mismanagement is never a factor when federal law enforcement seeks permission to secretly surveil Americans.\"",
  "In January, Grassley and Sen. Lindsey Graham, R-S.C., referred Steele to the Justice Department and the FBI for criminal investigation, alleging that Steele had made false statements to authorities about the dossier.",
  "Earlier this week, FBI Director Christopher Wray announced plans to “double the number” of agents handing records for the House Judiciary Committee after it subpoenaed the Justice Department for documents on FISA, the Clinton email investigation and the firing of McCabe.",
  "Over the last year, Horowitz has been conducting a review of the FBI's and DOJ’s actions related to the investigation into Clinton’s use of a private email server while she was secretary of state.",
  "A final report on the investigation is expected in several months.",
  "Fox News' Pamela K. Browne and Jason Donner contributed to this report."
]