[
  "Michael Cohen, the longtime attorney of President Trump, is under federal investigation for possible bank fraud, wire fraud and campaign finance violations, according to three people with knowledge of the case.",
  "FBI agents on Monday raided Cohen’s Manhattan office, home and hotel room as part of the investigation, seizing records about Cohen’s clients and personal finances.",
  "Among the records taken were those related to a 2016 payment Cohen made to adult-film star Stormy Daniels, who claims to have had a sexual encounter with Trump, according to a fourth person familiar with the investigation.",
  "Investigators took Cohen’s computer, phone and personal financial records, including tax returns, as part of the search of his office at Rockefeller Center, that person said.",
  "In a dramatic and broad seizure, federal prosecutors collected communications between Cohen and his clients — including those between the lawyer and Trump, according to both people.",
  "The raids — part of an investigation referred by special counsel Robert S. Mueller III to federal prosecutors in New York — point to escalating legal jeopardy for a longtime Trump confidant who is deeply intertwined in the president’s business and personal matters.",
  "Stephen Ryan, an attorney for Cohen, called the tactics “inappropriate and unnecessary,” saying Cohen has “cooperated completely with all government entities, including providing thousands of non-privileged documents to the Congress and sitting for depositions under oath.”\n\nAmong the records seized by investigators were “protected attorney client communications,” Ryan said.",
  "The aggressive tactics by prosecutors drew the president’s ire.",
  "As Trump sat down for dinner Monday with military leaders at the White House, he repeatedly called the raid “a disgrace,” railing that he and his administration are the subject of unfair, baseless and misguided investigations.",
  "“I have this witch hunt constantly going on for over 12 months now or longer,” he said.",
  "“It’s an attack on our country in a true sense; it’s an attack on what we all stand for.”\n\nRevisiting his grievances about Mueller and Attorney General Jeff Sessions, Trump complained about what he suggested was a concerted and sometimes partisan effort to target his leadership.",
  "He noted that he has been urged to fire the special counsel, calling Mueller’s investigators “the most biased group of people.”\n\nDawn Dearden, spokeswoman for the U.S. attorney’s office for the Southern District of New York, declined to comment.",
  "Peter Carr, a spokesman for the special counsel’s office, declined to comment.",
  "One person familiar with the probe said investigators have been gathering material on Cohen for weeks, including his bank records.",
  "Two of the potential crimes being investigated — bank fraud and wire fraud — suggest prosecutors have some reason to think Cohen may have misled bankers about why he was using particular funds or may have improperly used banks in the transfer of funds.",
  "Cohen has acknowledged facilitating a $130,000 payment in October 2016 to Daniels, who claims she had a sexual relationship with Trump in 2006.",
  "Trump made his first comments about the payment last week, saying he did not know about the transaction.",
  "Cohen has said he used a home-equity line of credit to finance the payment to Daniels and said that neither the Trump Organization nor the Trump campaign reimbursed him for the payment.",
  "Banks don’t usually require much explanation from customers about how they use such credit lines.",
  "However, Cohen may have been asked to provide explanation for the large-dollar transfers he made when he moved the money to a shell company and then to a lawyer for Daniels.",
  "The search requests for records related to the payment to Daniels cited investigators’ interest in possible violations of election law, according to one person familiar with the investigators’ work.",
  "[Special counsel has examined episodes involving Cohen]\n\nThe seizure of Cohen’s records was first reported by the New York Times.",
  "The Cohen raids required high-level authorization within the Justice Department.",
  "Under regulations governing the special counsel’s work, Mueller is required to consult with Deputy Attorney General Rod J. Rosenstein if his team finds information worth investigating that does not fall under his mandate to examine Russia’s interference in the 2016 election.",
  "Rosenstein, as the acting attorney general supervising Mueller’s work, has the responsibility of deciding whether to expand Mueller’s mandate to include the new topic or to refer it to a U.S. attorney’s office.",
  "Since Cohen is a practicing attorney whose communications with clients are considered privileged, federal prosecutors would have been required to first consider a less intrusive investigative tactic than a search warrant before executing the raids.",
  "“A search warrant for a law office is extremely rare,” said Stephen Gillers, a professor at the New York University School of Law.",
  "“Lawyers are given the courtesy of producing documents in response to a subpoena or a request unless the government believes a lawyer will destroy or conceal the objects of the search.”\n\nTo serve a search warrant on a practicing attorney, federal prosecutors are required to obtain approval from top Justice Department officials.",
  "That means the acting U.S. attorney in Manhattan, Geoffrey S. Berman, who was appointed to his role by Sessions in January, as well as Justice Department officials in Washington, probably signed off.",
  "Known for his combative style and fierce loyalty to Trump, Cohen served for a decade as a top lawyer at the Trump Organization, tangling with reporters and Trump’s business competitors on behalf of the celebrity real estate mogul.",
  "He never formally joined Trump’s campaign but was in close contact with his longtime boss from his Trump Tower office throughout the 2016 race and presidential transition.",
  "Cohen left the Trump Organization in January 2017, around the time of Trump’s inauguration, and since then has served as a personal attorney to the president.",
  "Squire Patton Boggs, the law firm where Cohen had an office for the past year, said in a statement Monday that its “arrangement with Mr. Cohen reached its conclusion, mutually and in accordance with the terms of the agreement.”\n\n“We have been in contact with federal authorities regarding their execution of a warrant relating to Mr. Cohen,” the firm said.",
  "“These activities do not relate to the firm and we are in full cooperation.”\n\nTo pursue criminal charges against Cohen for breaking federal election law, prosecutors would have to prove that he made the payment to Daniels to influence the election, rather than for personal reasons — to protect Trump’s reputation, for example, or his marriage.",
  "Cohen has acknowledged that he facilitated the payment to Daniels, but he has not said why.",
  "On Oct. 17, Cohen established Essential Consultants LLC as a vehicle for the $130,000 payment, records show.",
  "Ten days later, on Oct. 27, the bank Cohen used in New York transferred the money to Daniels via a California bank account belonging to her lawyer, Keith Davidson.",
  "Eleven months later, in September 2017, that California bank — City National Bank in Beverly Hills — asked Davidson about the source of the payment, according to an email reviewed by The Washington Post.",
  "Bank officials declined to comment on whether the inquiry was triggered by a request or subpoena from law enforcement.",
  "At some point, Cohen’s New York bank, First Republic, flagged the transaction to the Treasury Department as a suspicious payment, according to the Wall Street Journal.",
  "Cohen used his Trump Organization email in negotiating the agreement with Davidson and in communicating with his bank about the funds.",
  "In February, after a watchdog group filed a complaint about the payment with the Federal Election Commission, Cohen released a statement saying he “used my own personal funds to facilitate” the payment.",
  "He rejected the idea that the payment should have counted as a campaign contribution.",
  "“The payment to Ms. Clifford was lawful, and was not a campaign contribution or a campaign expenditure by anyone,” he said, referring to Daniels’s real name, Stephanie Clifford.",
  "While the timing of the payment — 12 days before the presidential election — might suggest an attempt to influence the outcome, timing is not enough to prove intent, said Rick Hasen, a professor specializing in election law at the University of California at Irvine.",
  "“It would be very difficult to bring one of these cases without some good documentary evidence,” he said.",
  "“I think a lot of people are underestimating the hurdles that it takes to bring a criminal prosecution.”\n\n[Trump says he didn’t know his attorney paid $130,000 to Stormy Daniels]\n\nCohen’s work for Trump has been a topic of particular interest in recent months to Mueller’s investigators.",
  "Although there has been no sign that he is a subject or target of Mueller’s probe into Russian interference in the 2016 election, people familiar with the investigation have said that Cohen has come up repeatedly in interviews and document requests.",
  "Cohen played a central role in two Russia-related episodes Mueller has been investigating, including negotiations to build a Trump tower in Moscow that the Trump Organization undertook after Trump announced his candidacy for president.",
  "Cohen also was fleetingly involved with an effort to call attention to a Russia-friendly proposal for peace in Ukraine shortly before Trump took office.",
  "Mark Berman, Emma Brown, Josh Dawsey, Anne Gearan, Rosalind S. Helderman, Beth Reinhard, Philip Rucker, Matt Zapotosky and Spencer S. Hsu contributed to this report."
]