[
  "President Trump on Monday put the brakes on a preliminary plan to impose additional economic sanctions on Russia, walking back a Sunday announcement by U.S.",
  "Ambassador to the United Nations Nikki Haley that the Kremlin had swiftly denounced as “international economic raiding.”\n\nPreparations to punish Russia anew for its support of Syrian President Bashar al-Assad’s government over an alleged chemical weapons attack in Syria caused consternation at the White House.",
  "Haley had said on CBS News’s “Face the Nation” that sanctions on Russian companies behind the equipment related to Assad’s alleged chemical weapons attack would be announced Monday by Treasury Secretary Steven Mnuchin.",
  "But Trump conferred with his national security advisers later Sunday and told them he was upset the sanctions were being officially rolled out because he was not yet comfortable executing them, according to several people familiar with the plan.",
  "Administration officials said the economic sanctions were under serious consideration, along with other measures that could be taken against Russia, but said Trump had not given final authorization to implement them.",
  "Administration officials said Monday it was unlikely Trump would approve any additional sanctions without another triggering event by Russia, describing the strategy as being in a holding pattern.",
  "Sometime after Haley’s comments on CBS, the Trump administration notified the Russian Embassy in Washington that the sanctions were not in fact coming, a Russian Foreign Ministry official said Monday.",
  "The Trump team decided to publicly characterize Haley’s announcement as a misstatement.",
  "White House press secretary Sarah Huckabee Sanders said in a statement Monday: “We are considering additional sanctions on Russia and a decision will be made in the near future.”\n\n[How Trump, a reluctant hawk, has battled his top aides on Russia and lost]\n\nPrivately, another White House official said Haley got ahead of herself and made “an error that needs to be mopped up.”\n\nBut other administration officials expressed skepticism that Haley had merely misspoken.",
  "They said Haley is one of the most disciplined and cautious members of the Cabinet, especially when it comes to her public appearances.",
  "She regularly checks in with Trump personally to go over her planned statements before she sits for television interviews.",
  "Haley issued no clarifying statement on Sunday after news organizations, including The Washington Post, reported prominently that the new sanctions would be announced Monday based on her comments to CBS.",
  "Asked Monday morning why it had taken 24 hours for the administration to walk back Haley’s comments, one White House official said only that there had been confusion internally about what the plan was.",
  "President Trump, right, and Russian President Vladi­mir Putin talk during the APEC Summit in Danang, Vietnam, on Nov. 11, 2017.",
  "(Jorge Silva/Reuters)\n\nThe sanctions were developed in recent weeks as part of a ready menu of potential military and economic measures for Trump to enact to strike back at Assad’s government and his Russian patrons, according to a senior administration official.",
  "In early March, following a relatively small-scale chemical weapons attack in Syria, Trump was upset there was not a ready set of options, so then-national security adviser H.R.",
  "McMaster prepared a series of measures that were not enacted.",
  "But the late-March poisoning of a former Russian double agent on British soil led the Trump administration to trigger the first round of the economic sanctions on that menu and to expel 60 diplomats in coordination with the European allies.",
  "The reported chemical attack by Assad in Douma in early April set off a debate in the White House about whether the United States should trigger another round of economic sanctions to punish Russia.",
  "The president seemed to refer to those measures Friday night in a speech announcing strikes against the Assad regime.",
  "He promised to respond with “all instruments of our national power: military, economic and diplomatic.”\n\nBut it was unclear to officials whether Trump wanted to hit Russia with the next set of options on the sanctions menu or wait for another attack, according to the senior administration official.",
  "Some officials said the misunderstanding could have been the result of Haley’s tendency to speak directly with the president, sometimes outside of the normal policy process.",
  "“She’ll usually talk to the president without the rest of the White House and get her remarks cleared directly,” said the senior administration official.",
  "“Often we don’t know about them.”\n\n[Doubting the intelligence, Trump pursues Putin and leaves a Russian threat unchecked]\n\nEarly in the Trump administration, there were conflicts between Haley’s team and the president on Russia.",
  "Shortly after Trump’s inauguration, Haley delivered a speech at the United Nations that recommitted the White House to the Obama administration’s policy on sanctions related to Russian aggression in Ukraine.",
  "The speech was cleared by David Cattler, then a senior official on the National Security Council, but the remarks frustrated Trump, who demanded to know who had approved them.",
  "“Lots of people got yelled at — some by the president,” said a U.S. official at the United Nations.",
  "Cattler, in turn, was pushed out of his job a couple of weeks later in a reorganization of the NSC by McMaster.",
  "White House officials said Trump has been impressed with Haley lately, particularly her remarks about Syria over the past week, and stressed Monday that the president holds her in high regard.",
  "In the absence of a permanent secretary of state, Haley has been the face of American diplomacy, playing an especially prominent role over the past week as the Trump administration responded to the attack in Syria.",
  "Haley said Sunday on CBS: “You will see that Russian sanctions will be coming down.",
  "Secretary Mnuchin will be announcing those on Monday, if he hasn’t already.",
  "And they will go directly to any sort of companies that were dealing with equipment related to Assad and chemical weapons used.",
  "And so I think everyone is going to feel it at this point.",
  "I think everyone knows that we sent a strong message, and our hope is that they listen to it.”\n\nThe Russians were listening.",
  "After Haley’s comments, Kremlin press secretary Dmitry Peskov told reporters in Moscow that the sanctions were a U.S. ploy to oust Russia from international markets and constituted “undisguised attempts of unfair competition.”\n\n[Trump tries to appear strong on Syria even as he prepares to withdraw]\n\n“The sanction campaign against Russia is truly assuming the nature of an obsessive idea,” Peskov said, according to the Interfax news agency.",
  "“We still do not see these sanctions as lawful.",
  "We see them as going against international law.”\n\nPeskov added: “Certainly, this cannot have any relation to and cannot be motivated by considerations of the situation in Syria or any other country.",
  ".",
  ".",
  ".",
  "I would call this international economic raiding rather than something else.”\n\nBut there was a subtle shift in Moscow toward a less confrontational tone, even as officials continued to slam U.S. sanctions as veiled attempts at gaining economic advantage.",
  "Russian lawmakers were crowing Friday that they were going to make the United States pay for already imposed sanctions, potentially by blocking American imports or U.S.-Russian aerospace cooperation, or allowing Russians to violate U.S. intellectual property rights.",
  "Russia, one top lawmaker promised, was going to “hit the Americans in the gut.”\n\nBut on Monday, senior lawmakers in the lower house of parliament, the State Duma, decided to hold off until May 15 before considering any counter-sanctions against the United States.",
  "Speaker Vyacheslav Volodin said the Duma needed to meet with experts and the business community first.",
  "Deputy Foreign Minister Sergei Ryabkov also urged calm.",
  "“Let’s first wait until these sanctions are implemented,” Ryabkov said in reference to possible new U.S. sanctions, Interfax reported.",
  "“We have to see what will be announced, at what scale, and who or what will become the targets of these sanctions.”\n\nTroianovski reported from Moscow.",
  "Shane Harris, John Hudson and Ashley Parker contributed to this report."
]