[
  "McConnell says he will not allow vote on bill protecting Mueller from firing\n\nThe Senate majority leader, Mitch McConnell, has said he will not allow a vote on a bill that would protect the special counsel Robert Mueller from being fired by Donald Trump, despite bipartisan concern that the president will act on an impulse to end the Russia investigation.",
  "McConnell said on Tuesday that he did not believe legislative action was necessary because Trump would not fire Mueller, who is overseeing the FBI investigation into possible collusion between Trump associates and Russia.",
  "“I don’t think he should fire Mueller and I don’t think he is going to,” McConnell said during an interview on Fox News on Tuesday.",
  "“So this is a piece of legislation that’s not necessary, in my judgment.",
  "Trump’s latest tirade suggests he is moving closer to firing Mueller Read more\n\nHe continued: “I’m the one who decides what we take to the floor,” he said.",
  "“That’s my responsibility as the majority leader and we will not be having this on the floor of the Senate.”\n\nMcConnell’s comments come days before the Senate judiciary committee is expected to consider the Special Counsel Independence and Integrity Act, a bipartisan bill that is a compromise between two rival plans.",
  "The legislation, written by the Republican senators Thom Tillis of North Carolina and Lindsey Graham of South Carolina, and the Democratic senators Cory Booker of New Jersey and Chris Coons of Delaware, would codify regulations limiting who can fire a special counsel.",
  "The bill would also provide the special counsel a 10-day window during which the special counsel could seek an expedited judicial review by a panel of judges to determine if the removal was justified.",
  "If the judges determined that it was not and the firing violated the “good-cause requirement”, the termination would be reversed.",
  "While the effort has attracted bipartisan support, Republicans remain broadly opposed to the bill, with several members of the caucus questioning the constitutionality of such legislation.",
  "The Republicans who support the bill, including Graham and Tillis, say they too don’t believe Trump will fire Mueller and have tried to cast the effort as good policy rather than a response to the mounting public tensions between the president and the special counsel.",
  "McConnell added during the interview that Trump would never agree to the legislation, even if Congress passed it.",
  "“Just as a practical matter, even if we pass it, why would he sign it?” McConnell said.",
  "Trump has publicly attacked the Russia investigation as a “witch-hunt” and has reportedly ordered Mueller’s firing on at least two occasions.",
  "Last week, after a raid to seize documents from his personal lawyer by a separate division of the FBI, Trump lashed out on Twitter, calling the investigation an “attack on our country”.",
  "He has publicly criticized Mueller and Rod Rosenstein, the Department of Justice official overseeing Mueller’s investigation.",
  "The Democratic Senate leader, Chuck Schumer, urged Republicans on the Senate judiciary committee to still allow the bill to move forward and said he hoped that their persistence would push McConnell to reconsider.",
  "“While I’m glad the majority leader believes the president would be wrong to fire Special Counsel Mueller, it’s a mistake not to pass legislation to protect the investigation,” Schumer said in a statement.",
  "“We ought to head off a constitutional crisis at the pass, rather than waiting until it’s too late.”"
]