[
  "The Senate Intelligence Committee has determined the U.S. intelligence community was correct in assessing Russia interfered in the 2016 presidential election with the aim of helping then-candidate Donald Trump, contradicting findings House Republicans reached last month.",
  "“We see no reason to dispute the [intelligence community’s] conclusions,” the committee’s chairman, Sen. Richard Burr (R-N.C.), said Wednesday in a joint statement with its vice chair, Sen. Mark R. Warner (D-Va.), who added: “Our staff concluded that the ... conclusions were accurate and on point.",
  "The Russian effort was extensive, sophisticated, and ordered by President Putin himself for the purpose of helping Donald Trump and hurting Hillary Clinton.”\n\nThis marks the second of four interim findings the intelligence committee has said it will disclose before tackling the more consequential question of whether Trump and his associates colluded with Russia to influence the election’s outcome, allegations the president has denied and sought to discredit.",
  "The committee, which earlier this month released related findings on election security, is expected to publish a comprehensive final report this fall.",
  "[Senate Intelligence Committee releases interim report on election security]\n\nWednesday’s announcement comes amid growing Republican scrutiny of the investigation led by special counsel Robert S. Mueller III, whose team also is examining whether Trump’s campaign coordinated with the Kremlin and if the president obstructed justice in a bid to limit the probe’s scope.",
  "The Senate committee’s findings clash with the House GOP’s determination that the intelligence community did not follow its own best practices in concluding the Kremlin favored Trump in the election.",
  "The dispute — and the questions it now raises about which record of events is most accurate — could complicate the Republican Party’s messaging heading into the 2018 election season.",
  "President Trump meets with Russian President Vladimir Putin at the G-20 Summit in Hamburg last year.",
  "The Senate Intelligence Committee released its findings on Wednesday that Russia had interfered in the 2016 election to help Trump’s chances of victory, breaking with House Republicans.",
  "(Evan Vucci/AP)\n\nTrump has taken umbrage at the intelligence community’s determination that the Kremlin favored his candidacy over Clinton’s.",
  "The president cheered the House Intelligence Committee’s report, claiming on Twitter it vindicated him by finding there was no evidence his campaign colluded with Russia.",
  "[House Intelligence Committee Republicans release final Russia report]\n\nAlthough the Senate Intelligence Committee has yet to weigh in on the collusion allegations, Burr and Warner have hinted for days that their panel’s interim findings on the intelligence community would depart from those reached by Republicans on the House Intelligence Committee.",
  "“I’m not sure that the House was required to substantiate every conclusion with facts,” Burr told reporters last week, promising the Senate panel would “have the facts to show for” its conclusions.",
  "Warner said Monday, “Everyone that we’ve ever had testify still stands by the full findings of the ICA,” referring to the intelligence community’s assessment.",
  "“We’ve had all the Obama officials, we’ve had all the Trump officials.",
  "Every person,” he added.",
  "Asked Wednesday about the discrepancy between the two panels’ conclusions, Rep. Devin P. Nunes (R-Calif.), the House Intelligence Committee’s chairman said, “That’s nice.” He declined to elaborate.",
  "Nunes, who became the subject of an ethics inquiry last year, delegated day-to-day oversight of the panel’s Russia investigation to Rep. K. Michael Conaway (R-Texas) but remained peripherally involved, approving subpoenas and other related actions.",
  "“I’m confident in the people who did our work, that they got it right,” Conaway said, adding, to sort out the discrepancy, the intelligence agencies would likely have to declassify documents on which their findings were based.",
  "House Democrats, who roundly disagreed with the House GOP’s findings, praised the Senate Intelligence Committee’s conclusions.",
  "Rep. Adam B. Schiff (D-Calif.), the House intelligence panel’s ranking member, said in a statement he “fully concur[s] with the conclusion of the bipartisan leaders of the Senate Intelligence Committee that the ICA’s determination that Russia sought to help the Trump campaign, hurt Hillary Clinton and sow discord in the United States is fully supported by the evidence.”\n\nOn Wednesday, Senate Intelligence Committee members met in closed session to discuss their findings with former Director of National Intelligence James R. Clapper Jr., former CIA director John Brennan and former National Security Agency director Adm. Mike Rogers.",
  "None has wavered from the conclusions about Russian interference in the election, according to senators who were in the room.",
  "Former FBI director James B. Comey had also been invited to testify about the findings to the panel, but did not attend.",
  "Read more at PowerPost"
]