[
  "NEW YORK (Reuters) - The former son-in-law of Paul Manafort, the one-time chairman of President Donald Trump’s campaign, has cut a plea deal with the Justice Department that requires him to cooperate with other criminal probes, two people with knowledge of the matter said.",
  "The guilty plea agreement, which is under seal and has not been previously reported, could add to the legal pressure on Manafort, who is facing two indictments brought by Special Counsel Robert Mueller in his probe of alleged Russian meddling in the 2016 presidential election.",
  "Manafort has been indicted in federal courts in Washington and Virginia with charges ranging from tax evasion to bank fraud and has pleaded not guilty to the charges.",
  "Jeffrey Yohai, a former business partner of Manafort, was divorced from Manafort’s daughter last August.",
  "Yohai has not been specifically told how he will be called on to cooperate as part of his plea agreement, but the two people familiar with the matter say they consider it a possibility that he will be asked to assist with Mueller’s prosecution of Manafort.",
  "Legal experts have said that Mueller wants to keep applying pressure on Manafort to plead guilty and assist prosecutors with their probe.",
  "Manafort chaired the Trump campaign for three months before resigning in August 2016.",
  "Both Trump and Russia have denied allegations they colluded to help Republican Trump win the election.",
  "Hilary Potashner, a public defender who is representing Yohai, did not immediately respond to a request for comment.",
  "Manafort’s spokesman, Jason Maloni, declined to comment.",
  "Andrew Brown, a federal prosecutor in Los Angeles, had been overseeing an investigation into Yohai’s real estate and bank dealings in California and New York several months before Mueller was appointed to his post in May 2017.",
  "Yohai’s agreement, which was concluded early this year, included him pleading guilty to misusing construction loan funds and to a count related to a bank account overdraft.",
  "While the deal was cut with Brown’s office, the federal government “can ask for help at any time,” said one of the people familiar with the matter.",
  "A spokesman for Brown did not respond to a request for comment and a spokesman for Mueller declined to comment.",
  "MANAFORT TRIAL PENDING\n\nManafort is to go on trial later this year to fight the two indictments.",
  "The charges against him range from failing to disclose lobbying work for a pro-Russian Ukrainian political party to bank fraud.",
  "As a close business partner, Yohai was privy to many of Manafort’s financial dealings, according to the two people familiar with the matter and court filings in the bankruptcies of four Los Angeles properties in 2016.",
  "In addition to co-investing in California real estate, the two cooperated in getting loans for property deals in New York, Manafort’s indictments show.",
  "Mueller sent a team of prosecutors to interview Yohai last June, asking him about Manafort’s relationship with Trump, his ties to Russian oligarchs, and his borrowing of tens of millions of dollars against properties in New York, Reuters reported in February, citing people with knowledge of the matter.",
  "President Trump's former campaign manager Paul Manafort departs U.S. District Court after a motions hearing in Alexandria, Virginia, U.S., May 4, 2018.",
  "REUTERS/Jonathan Ernst"
]