[
  "Media playback is unsupported on your device Media caption Trump to G7: \"They should let Russia come back in\"\n\nDivisions between Donald Trump and other leaders of G7 nations were laid bare on the first day of their summit.",
  "The US leader made a surprise call for Russia to be readmitted to the group of top industrialised nations after its expulsion for annexing Crimea.",
  "But German Chancellor Angela Merkel said EU members attending the summit in Canada were all against the idea.",
  "Frictions over trade tariffs recently imposed by the Trump administration continued during Friday's session.",
  "After meeting French President Emmanuel Macron, Mr Trump said they had a little test once in a while when it came to trade but, he added, they were working it out.",
  "For his part, Mr Macron said he believed all sides were willing to find an agreement.",
  "Reuters news agency cited a French presidential aide as saying the US had agreed to start a trade dialogue with the EU at a technical level in the next two weeks.",
  "Divisions wider than trade\n\nBy the BBC's diplomatic correspondent, James Robbins\n\nThis summit started very badly - and it could end without the usual communiqué agreed by all.",
  "Divisions between Mr Trump and the other six leaders go way beyond trade - they include climate change, relations with Iran and the Israel-Palestinian conflict.",
  "Mrs Merkel is one of those arguing it might be better to set out those differences clearly rather than give a false impression of unity.",
  "It's more honest, she said, than pretending everything's OK.\n\nOthers still believe some sort of consensus can be found, and Mr Trump says he's hopeful of progress.",
  "But there's no doubt about Mr Trump's isolation.",
  "He dislikes negotiating with groups, and he will leave well before the end of this G7 summit: next stop Singapore, to face North Korea's Kim Jong-un, and seek the sort of one-to-one deal he much prefers.",
  "Mr Trump is leaving the two-day summit early to head to Singapore for his landmark summit with North Korean leader Kim Jong-un.",
  "Media playback is unsupported on your device Media caption Canadian brewery marks G7 with special brew\n\nCanada had called Mr Trump's trade tariffs \"illegal\" while European Council President Donald Tusk warned that Mr Trump's stance on trade, climate change and Iran constituted a real danger.",
  "\"What worries me most however is the fact that the rules-based international order is being challenged, quite surprisingly not by the usual suspects but by its main architect and guarantor: the US,\" he said.",
  "What is the G7?",
  "It is an annual summit bringing together Canada, the US, the UK, France, Italy, Japan and Germany, which represent more than 60% of global net worth between them.",
  "Economics tops the agenda, although the meetings now always branch off to cover major global issues.",
  "This time they are meeting in the town of La Malbaie in Quebec.",
  "What was said about Russia?",
  "Mr Trump said: \"You know, whether you like it or not - and it may not be politically correct - but we have a world to run and in the G7, which used to be the G8, they threw Russia out.",
  "They should let Russia come back in.\"",
  "Initially, he found support in the shape of the newly installed Italian Prime Minister Giuseppe Conte, who tweeted that it was \"in the interests of everyone\" for Russia to be readmitted.",
  "But later Germany's Angela Merkel said all the EU members there, including Mr Conte, had agreed that Russia could not be readmitted unless there was \"progress\" on Ukraine.",
  "Canada too says it remains opposed.",
  "A Kremlin spokesperson meanwhile said they were interested in \"other formats\", apart from the G7.",
  "Russian President Vladimir Putin is currently in Beijing, where he was presented with a friendship medal by Chinese counterpart Xi Jinping.",
  "Image copyright Getty Images Image caption China's President Xi Jinping is hosting Vladimir Putin and invited him to a friendly ice hockey match\n\nFellow members of what was then the G8 suspended Russia after it took control of Crimea from Ukraine.",
  "Tensions remain, in part over the poisoning of a former Russian spy in the UK.",
  "How do other G7 members see trade?",
  "Mr Trump's imposition of tariffs on steel and aluminium imports has sparked anger, with even US allies falling subject to them.",
  "The move has brought fears of a trade war.",
  "Canadian Foreign Minister Chrystia Freeland called the tariffs \"illegal and absolutely unjustified\".",
  "Mr Trump said on Friday that the US and Canada were working on cutting tariffs \"and making it all very fair for both countries\".",
  "\"We've made a lot progress today,\" he said, adding that the relationship between the two countries \"is probably better than ever\".",
  "Skip Twitter post by @realDonaldTrump Looking forward to straightening out unfair Trade Deals with the G-7 countries.",
  "If it doesn’t happen, we come out even better!",
  "— Donald J. Trump (@realDonaldTrump) June 8, 2018 Report\n\nUK Prime Minister Theresa May has said she wants the EU to act with restraint and proportion in retaliating to the US tariffs.",
  "Media playback is unsupported on your device Media caption Dairy wars: Why is Trump threatening Canada over milk?",
  "What else can we expect in Quebec?",
  "The five themes for this year's summit are:\n\nInclusive economic growth\n\nGender equality and women's empowerment\n\nWorld peace and security\n\nJobs of the future\n\nClimate change and oceans\n\nAccording to the leaders' programme, Mr Trump will miss the talks on climate change, the environment and probably gender equality on Saturday.",
  "Skip Twitter post by @EmmanuelMacron Pursuing the conversation.",
  "Engaging, keeping the dialogue alive, now & ever.",
  "Sharing, reaching out, always, to promote the interests of the French people, and all those who believe in a world we can build together.",
  "With President Donald Trump, prior to the opening of G7 Summit.",
  "pic.twitter.com/SD5hzLBO0X — Emmanuel Macron (@EmmanuelMacron) June 8, 2018 Report\n\nThe US president was very much the odd man out on climate change during the G7 in Italy last year, later announcing his intention to withdraw from the landmark Paris agreement.",
  "Iran is also a big sticking point.",
  "Mr Trump recently ditched the 2015 agreement with Tehran that aimed to curb its nuclear programme.",
  "This angered the other signatories who have since sought to shore it up.",
  "Previous G7 meetings have seen huge protests, and about 8,000 soldiers and police officers are expected to be on hand during the Quebec event."
]