[
  "The project, which they referred to as the Hapsburg Group, ran from 2011 through 2014, and was funded with $2.4 million steered by Mr. Manafort from overseas bank accounts, according to prosecutors.",
  "It sought to recruit European politicians, such as Romano Prodi, the former prime minister of Italy and the former president of the European Commission, to vouch for Mr. Yanukovych in commentaries and meetings with government officials around the world.",
  "The two former associates, for instance, helped arrange for Mr. Prodi to visit Washington in March 2013 to meet with key members of Congress, and they helped him draft and place an Op-Ed in The Times in February 2014, according to prosecutors.",
  "Mr. Prodi has repeatedly said he was not aware of the involvement of Mr. Manafort or the existence of the Hapsburg Group.",
  "But prosecutors say that Mr. Manafort and Mr. Kilimnik reached out to the two former associates to urge them to tell the special counsel’s team that the Hapsburg Group’s efforts consisted only of outreach in Europe and not in the United States.",
  "The question of the geographic target of the Hapsburg Group’s activities is significant because any lobbying or public relations in the United States on behalf of foreign politicians, governments or companies would require disclosure with the Justice Department under the Foreign Agents Registration Act.",
  "Mr. Manafort did not initially register under the act, and he is charged with lying to the Justice Department about his activities.",
  "Instead of engaging with Mr. Manafort or Mr. Kilimnik to coordinate their stories about the Hapsburg Group’s work, the two former associates turned on their former colleagues.",
  "The associates — who are not named by the special counsel, but whom three people familiar with the project identified as Alan Friedman and Eckart Sager — informed the special counsel of the outreach, leading to allegations of witness tampering and Friday’s obstruction charges.",
  "In a court filing on Friday night, Mr. Manafort’s lawyers called the accusation of witness tampering “very specious,” and said it was a “not-too-subtle attempt to poison the potential jury pool against Mr. Manafort.” They argued that Mr. Manafort could not set out to tamper with witnesses because “he is not aware of who the special counsel may call as witnesses.”"
]