[
  "HELSINKI, Finland — President Donald Trump, while standing alongside Russian President Vladimir Putin, refused to acknowledge what major U.S. major intelligence agencies have been saying for more than a year: That Russian nationals, following orders from Putin, interfered in the 2016 election and carried out cyberattacks on American political figures.",
  "Reporters asked Trump directly about election interference during a joint news conference he and Putin held Monday after first meeting one-on-one and then holding a larger meeting that included top American and Russian presidential aides.",
  "In response, President Trump, standing alongside a smiling Putin, said he could not be certain that Russia interfered in the 2016 election.",
  "Trump’s statements were a stunning development, given that the top intelligence agencies in the United States including the FBI, CIA, and National Security Agency have all said they believe Russia meddled in the election.",
  "“I have President Putin.",
  "He just said it’s not Russia.",
  "I will say this.",
  "I don’t see any reason why it would be.”\n\n“They said they think it’s Russia,” Mr. Trump said, explaining that while U.S. intelligence agencies say Russia meddled, Putin told Trump directly that Russia did not.",
  "“I have President Putin.",
  "He just said it’s not Russia.",
  "I will say this.",
  "I don’t see any reason why it would be.”\n\nTrump went on.",
  "“I have confidence in both parties,” he said before turning to partisan politics.",
  "“What about Hillary Clinton’s emails?”\n\nTrump also said Putin felt “very strongly” about Russian election interference and said Putin “has an interesting idea.” Later, Trump hinted that Putin’s ideas was to have Special Counsel Robert Mueller come to Russia and watch as Russian officials interviewed the 12 Russian nationals indicted for meddling in the 2016 election.",
  "Putin said it was “nonsense” to think Russia meddled in the 2016 election.",
  "When asked whether he wanted Mr. Trump to win, President Putin smiled.",
  "“Yes I did.",
  "Yes I did,” he said.",
  "“Because he talked about bringing the US-Russia relationship back to normal.”\n\nPresidents Putin and Trump held their much anticipated meeting here Monday–but only after Putin, who is often late to meetings with other world leaders, made Trump wait almost an hour for him to arrive from Russia.",
  "U.S. President Donald Trump and Russia’s Vladimir Putin spoke at a joint news conference today.",
  "Watch their remarks in the player above.",
  "The two men were supposed to meet at 1:20 p.m. local time.",
  "Instead, Putin landed in Helsinki almost an hour behind schedule leaving Trump waiting to start the drive to their meeting.",
  "Trump and Putin finally entered the Gothic Hall in the Finnish presidential palace at 2:10 p.m. With only two translators present, the presidents held their one-on-one meeting as the world anxiously waited to see what might come out of their discussions.",
  "Just before going behind closed doors though, Trump, who had not been clear about his plans for the conversation, described a long list of topics he wanted to discuss but did not mention Russia’s interference in the 2016 election or the upcoming midterm elections.",
  "“We have a lot of good things to talk about and things to talk about,” Trump said sitting alongside Putin.",
  "“We have discussions on everything from trade to military to missiles to nuclear to China.",
  "We’ll be talking a little bit about China, our mutual friend President Xi.”\n\nWhile President Trump spoke for some time and Putin stayed largely quiet, the body language between the two presidents illustrated their respective styles going into the meeting.",
  "When Trump and Putin entered the meeting room and sat down, Trump gestured to Putin to begin, and Putin made his some quick remarks through a translator.",
  "While President Trump spoke for some time and Putin stayed largely quiet, the body language between the two presidents illustrated their respective styles going into the meeting.",
  "Trump answered several questions as he leaned forward in his chair, hands tented in front of him and looking directly at cameras placed in front of the two men.",
  "Putin, however, slouched into his chair with his legs spread and his arms resting on the sides of the chair as he stared blankly at Trump and reporters.",
  "President Trump doubled down on his belief that the United States and Russia must have good relations and did not mention that 12 Russian officials had recently been indicted for interfering in the 2016 presidential election.",
  "Trump said the two countries had not been getting along in the past and that there existed “great opportunities” to change that.",
  "“I have been here not too long.",
  "But, it’s getting close to two years, but I think we will end up having an extraordinary relationship,” Trump said.",
  "“I’ve been saying and I am sure you have heard over the years and as I campaigned that getting along with Russia is a good thing, not a bad thing.”\n\nTrump added that he wanted to discuss the two countries’ national defense systems.",
  "“I really think the world wants to see us get along,” Trump said.",
  "“We are the two great nuclear powers.",
  "We have 90 percent of the nuclear and that’s not a good thing, it’s not a bad thing.",
  "And I think we can hopefully do something about that.",
  "It’s not a positive force.",
  "It’s a negative force.",
  "So we’ll be talking about that among other things.”\n\nAfter the one-on-one meeting, several senior American and Russian officials participated in an extended meeting.",
  "John R. Bolton, national security advisor, John Kelly, White House chief of staff, Mike Pompeo, Secretary of State, Jon Huntsman, the U.S. ambassador to Russia, and Fiona Hill, the deputy assistant to the president and senior director for Europe and\n\nRussia on the National Security Council, attended the extended meeting, according to White House officials.",
  "READ MORE: Trump wish for warm Putin ties highlights policy disconnect"
]