[
  "WASHINGTON (AP) — Under pressure to show he’s taking the threat of Russian interference seriously, President Donald Trump claimed without evidence Tuesday that Moscow will be “fighting very hard” to help Democrats win in the 2018 midterm elections.",
  "Trump, who has offered mixed messages on Russian interference in U.S. elections — at times even calling it a “hoax” — acknowledged in a tweet that the midterms are a likely target.",
  "“I’m very concerned that Russia will be fighting very hard to have an impact on the upcoming Election,” Trump wrote.",
  "But he added “they will be pushing very hard for the Democrats.",
  "They definitely don’t want Trump!”\n\nThat’s despite Russian President Vladimir Putin saying outright last week, following the leaders’ summit in Helsinki, that he wanted Trump to win in 2016.",
  "U.S. intelligence agencies also have determined that Russia interfered in the election to help him win, and the agencies have warned there are ominous signs of more cyberattacks to come.",
  "READ MORE: The many different ways Trump has described Putin and Russian election interference\n\nAt Tuesday’s hearing, Christopher Krebs of the Homeland Security Department said the intelligence community has observed “continued malign influence operations” into 2018, though they do not appear to be “an effort at the same scope or scale” as in 2016.",
  "As Trump tweeted on Tuesday, House Republicans held a hearing on election security in which lawmakers — even some of Trump’s closest GOP allies — strongly criticized Russian interference and pointed to an indictment this month of 12 Russian intelligence officers.",
  "The indictment alleges that the Russians broke into Democratic email accounts and tried to penetrate state election systems.",
  "House Oversight and Government Reform Chairman Trey Gowdy noted that the indictment said there is no evidence the vote count was affected, “but that was not likely for a lack of trying.”\n\nRepublican Rep. Virginia Foxx of North Carolina criticized Trump directly.",
  "“Unfortunately, the president’s recent comments at the U.S.-Russia summit in Helsinki failed to hold Putin accountable for his attacks on our country’s interests and deter him from future indiscretions,” she said.",
  "Other Republicans were careful to draw a line and not directly disagree with the president.",
  "“I don’t think anyone here denies the fact that Russia attempted to meddle in the elections,” said Rep. Jody Hice, R-Ga. “The issue of meddling is one thing, the issue of the president colluding is another and that is indeed a witch hunt.”\n\nDemocrats said Republicans haven’t done enough to keep the vote secure this fall.",
  "They asked for more questioning, more documents and more money for states to secure their election infrastructure.",
  "“We need all of our Republican colleagues to conduct oversight — not just use strong words,” said Maryland Rep. Elijah Cummings, the top Democrat on the House oversight panel.",
  "READ MORE: The giant timeline of everything Russia, Trump and the investigations\n\nEarlier this year, Congress allocated $380 million to assist states with election security upgrades, and most of that money has been disbursed.",
  "Democrats want to continue the money through 2019, but Republicans have said new spending isn’t needed.",
  "The very makeup of the election infrastructure — decentralized and different in every state — provides some protection against hacking efforts.",
  "But state and local election officials have been working with the Department of Homeland Security to shore up their efforts after at least 21 state systems were scanned for vulnerabilities by Russian hackers and at least one state saw its voter registration system breached.",
  "In addition to helping state election officials obtain security clearances so they can be briefed on the latest threats to elections, Homeland Security officials also offer remote scanning of their networks to identify any vulnerabilities as well as intensive cybersecurity reviews that involve onsite exams.",
  "“DHS has made tremendous strides and is committed to working collaboratively with those on the front lines of administering our elections to secure election infrastructure from risks,” Krebs said.",
  "Even if state elections systems are better protected, other threats remain.",
  "Last week, Microsoft officials said they had seen evidence that suggested phishing attacks were being directed at three candidates who are all standing for election in the midterm elections.",
  "The company would not disclose the candidates, citing privacy issues.",
  "Meanwhile in the Senate on Tuesday, two senators introduced bipartisan legislation to impose new Russian sanctions, saying the U.S. “must make it abundantly clear that we will defend our nation.”\n\nCassidy reported from Atlanta.",
  "Associated Press writers Jill Colvin, Lisa Mascaro, Tami Abdollah and Deb Riechmann in Washington and Frank Bajak in Boston contributed to this report."
]