[
  "WASHINGTON — The White House said Wednesday that President Donald Trump’s proposed Washington meeting with Russian President Vladimir Putin had been delayed until 2019, citing the ongoing probe into Russian interference in the 2016 election.",
  "Putin had already sent signals that the fall White House meeting wasn’t going to happen.",
  "National security adviser John Bolton said in a statement that Trump believed his next meeting with Putin should take place “after the Russia witch hunt is over,” a reference to special counsel Robert Mueller’s investigation.",
  "Bolton said they agreed the meeting would be “after the first of the year.”\n\nWhile the statement signaled optimism that the Mueller probe would be completed by the end of this year, no timetable has been given for when it will be wrapped up and it could very well stretch into 2019.",
  "READ NEXT: Trump says without evidence that Russia will be ‘pushing very hard’ to help Democrats win in 2018\n\nThe White House said last week that Trump had directed Bolton to invite Putin to visit Washington in the fall, moving quickly for a follow-up meeting amid the backlash over Trump’s performance at a news conference with Putin following their Helsinki summit last week.",
  "Many members of Congress had objected to the two leaders meeting again in the fall and also said Putin would not be welcome on Capitol Hill.",
  "The decision came days after the White House rejected a Putin-backed effort to hold a referendum in eastern Ukraine on the region’s future.",
  "Secretary of State Mike Pompeo said Wednesday, prior to the announcement, that the U.S. would never recognize Russia’s annexation of Crimea and demanded that Ukraine’s territorial integrity be restored.",
  "Other signs had already emerged raising doubts about the second Trump-Putin summit.",
  "On Tuesday, Putin’s foreign affairs adviser Yuri Ushakov threw cold water on the prospect of Putin accepting Trump’s invitation to visit the White House.",
  "Ushakov told journalists in Moscow that no preparations were underway for a meeting in Washington and there were “other options that our leaders could consider,” such as the late November meeting of the Group of 20 in Argentina or another international event that both would attend.",
  "Trump has long been seeking to bring Putin to Washington for a meeting.",
  "The president met with Putin on the sidelines of two international summits last year — first Germany, then Vietnam — and both times he invited his Russian counterpart to the White House, according to three current and former administration officials.",
  "He reiterated the invitation on a call with Putin in the spring."
]