[
  "(CNN) Federal authorities had cornered the man they suspected could be part of Russia's interference in the 2016 presidential election -- and they might have been more successful in their investigation in early 2017 if it had not been for George Papadopoulos, the special counsel alleged on Friday.",
  "Special counsel prosecutors are asking a judge to sentence Papadopoulos to up to six months in prison, according to a court filing on Friday.",
  "The former Trump campaign staffer pleaded guilty last October to one count of lying to investigators over his interactions about the Trump campaign with foreign contacts who had connections to Russia.",
  "Papadopoulos lied to the FBI in January 2017 about his contact in London with Joseph Mifsud, identified in the filing as \"the Professor.\"",
  "Mifsud had told Papadopoulos the Russians had \"dirt\" on Hillary Clinton.",
  "Federal authorities then found Mifsud in DC two weeks later, but allowed him to leave the country.",
  "\"The defendant's lies undermined investigators' ability to challenge the Professor or potentially detain or arrest him while he was still in the United States,\" prosecutors wrote.",
  "\"The defendant's false statements were intended to harm the investigation, and did so.\"",
  "Mifsud was not named in the court filing Friday night, but CNN learned the name of the mysterious \"Professor\" after Papadopoulos' guilty plea became public last year.",
  "Mifsud, who \"has not returned to the United States\" since February 2017, has not been publicly charged with a crime.",
  "Papadopoulos' initial interview with federal investigators in late January 2017 was months before the appointment of special counsel Robert Mueller.",
  "Mueller's team said in their Friday filing that that early interview, part of a national security investigation, was \"completely voluntary.\"",
  "Papadopoulos went with the agents from his home to the FBI office in Chicago to be interviewed for more than two hours, the filing said.",
  "At the time of the interview, the FBI agents were looking for people with information about the Trump campaign and its connections to Russia.",
  "They were also pursuing leads about Russia's involvement in the US presidential election almost three months before the interview, the filing said.",
  "They reminded Papadopoulos several times in that interview that he should not lie and could be prosecuted if he did, the filing said.",
  "Papadopoulos lied \"to minimize both his own role as a witness and the extent of the campaign's knowledge of his contacts,\" the prosecutors said.",
  "Among \"at least a dozen\" lies at the interview, Papadopoulos concealed the \"significance\" of when he had learned that Russians possessed thousands of emails about Clinton.",
  "Papadopoulos said wrongly several times he had communicated with Mifsud before he joined the Trump campaign.",
  "But Papadopoulos knew he had a role in the campaign when he started conversing with Mifsud in March 2016 -- and the professor \"showed interest in the defendant only after learning of his role on the campaign,\" the filing said.",
  "Papadopoulos learned about the \"dirt\" the Russians had on Clinton the following month, after he began working for Trump, the filing said.",
  "He told the authorities his interactions with Mifsud were \"a very strange coincidence.\"",
  "On the same day as his interview, Papadopoulos applied for a deputy assistant secretary position in Trump's Department of Energy, according to the filing.",
  "\"The defendant lied in order to conceal his contacts with Russians and Russian intermediaries during the campaign,\" the filing said.",
  "Those lies happened \"early in the investigation, when key investigative decisions, including who to interview and when, were being made,\" it said.",
  "Several Russians involved in the hacking of Clinton and Democratic email servers were criminally charged by Mueller's team about a month ago.",
  "\"Had the defendant told the FBI the truth when he was interviewed in January 2017, the FBI could have quickly taken numerous investigative steps to help determine, for example, how and where the Professor obtained the information, why the Professor provided the information to the defendant, and what the defendant did with the information after receiving it,\" the filing said.",
  "To make matters worse for Papadopoulos, the prosecutors say he has not provided significant help in their investigation.",
  "The former Trump campaign foreign policy aide provided investigators with information only after they confronted him with text messages, internet searches and other information they had collected, the filing said.",
  "Papadopoulos met with prosecutors four times to offer information after his initial interview and before he was charged with lying, the filing says.",
  "It was only at the fourth meeting, accompanied by his lawyers, that he told them about a cellphone he had used abroad during the campaign that had logged his calls with Mifsud.",
  "An additional meeting in December where investigators wanted to ask Papadopoulos more questions -- two months after he cut his plea deal -- was canceled because he and his then-fiancée began giving interviews to media outlets.",
  "After Friday's filing, Papadopoulos' wife, Simona Mangiante, told CNN she felt her husband should pull out of the plea agreement, saying he hadn't had proper representation in the negotiation with the government.",
  "It was not clear if that was her husband's belief as well.",
  "Prosecutors said in the filing that Mangiante, in interviews with the media, had inflated Papadopoulos' help to investigators following his plea.",
  "Papadopoulos' lawyer Thomas Breen said Friday night that he was unable to comment at this time and would respond through the court record in their own pre-sentencing memo, which must be filed by Aug. 31.",
  "In another curious detail in the filing, the special counsel team said Papadopoulos had been given $10,000 in cash \"from a foreign national whom he believed was likely an intelligence officer of a foreign country.\"",
  "The filing noted that the country was \"other than Russia.\"",
  "Mueller has also recommended a $9,500 fine.",
  "Papadopoulos is scheduled to be sentenced in the US District Court for the District of Columbia on Sept. 7.",
  "Another defendant, Alex van der Zwaan, also pleaded guilty to lying to investigators.",
  "He received 30 days in prison.",
  "This story has been updated."
]