[
  "President Trump Attacks Report On White House Counsel's Cooperation With Mueller\n\nEnlarge this image toggle caption Mark Wilson/Getty Images Mark Wilson/Getty Images\n\nIn a series of tweets over the weekend, President Trump responded to a story published in The New York Times that detailed extensive cooperation between White House counsel Donald McGahn and the inquiry by special counsel Robert Mueller into obstruction of justice and possible collusion between the Trump campaign and Russia.",
  "In a tweet Saturday night, Trump said he allowed and encouraged McGahn's cooperation with the special counsel.",
  "\"In addition we readily gave over one million pages of documents.",
  "Most transparent in history,\" Trump wrote.",
  "Sunday morning, Trump continued tweeting, affirming he had \"nothing to hide...\"\n\nThe New York Times reported that McGahn spoke with Mueller's team about Trump's firing of the FBI director James Comey and his push for Attorney General Jeff Sessions to claim oversight of the inquiry, and Trump's attempts to fire Mueller.",
  "His interviews with Mueller's team of investigators totaled 30 hours.",
  "Trump's team of personal lawyers had initially instructed McGahn to cooperate with Mueller with the goal of bringing the investigation to an end as quickly as possible, and with the premise that the president had nothing to hide.",
  "According to The New York Times, McGahn became increasingly concerned about Trump's encouragement of his interviews with the special counsel, and feared Trump was setting him up to take the fall for possible illegal acts.",
  "The New York Times reports:\n\n\"Mr. McGahn and his lawyer, William A. Burck, could not understand why Mr. Trump was so willing to allow Mr. McGahn to speak freely to the special counsel and feared Mr. Trump was setting up Mr. McGahn to take the blame for any possible illegal acts of obstruction, according to people close to him.",
  "So he and Mr. Burck devised their own strategy to do as much as possible to cooperate with Mr. Mueller to demonstrate that Mr. McGahn did nothing wrong.\"",
  "While McGahn says he never saw Trump go beyond his legal authorities, the Times says he gave investigators a mix of information both \"damaging and favorable\" to the president.",
  "It remains unclear if McGahn answered questions on collusion between the Trump campaign and Russia.",
  "Michael Beschloss, a presidential historian, says McGahn's cooperation with the special counsel is reminiscent of John Dean, White House counsel under President Nixon, who was eventually fired by Nixon during the Watergate scandal.",
  "Beschloss told The New York Times, \"This sure has echoes of Richard Nixon's White House counsel, John Dean, who in 1973 feared that Nixon was setting him up as a fall guy for Watergate and secretly gave investigators crucial help while still in his job.\"",
  "On Saturday, Dean tweeted that McGahn is doing the right thing.",
  "In an interview with Slate, Dean said:\n\n\"Don McGahn is doing exactly the right thing, not merely to protect himself, but to protect his client.",
  "And his client is not Donald Trump; his client is the office of the president.",
  "That is one of the things that was cleared up as a result of Watergate.",
  "The American Bar Association reissued a code of ethics and dealt directly with representation of an organization, and who the client is.",
  "And the client, in this instance, would not be the man who holds the office, but the office.",
  "And that is a huge difference.\"",
  "McGahn's lawyer, William Burck, gave a statement to NPR on McGahn's reaction to the Times report: \"President Trump, through counsel, declined to assert any privilege over Mr. McGahn's testimony, so Mr. McGahn answered the Special Counsel team's questions fulsomely and honestly, as any person interviewed by federal investigators must.\"",
  "In a statement to the Times, White House press secretary Sarah Sanders said, \"The president and Don have a great relationship.",
  "He appreciates all the hard work he's done, particularly his help and expertise with the judges, and the Supreme Court.\"",
  "In an interview with NBC News' Meet the Press on Sunday, Giuliani said he has reservations about Trump sitting for an interview with Mueller.",
  "Giuliani said, \"Look, I am not going to be rushed into having him testify so that he gets trapped into perjury.",
  "And when you tell me that, you know, he should testify because he's going to tell the truth and he shouldn't worry, well that's so silly because it's somebody's version of the truth.",
  "Not the truth.\"",
  "\"Truth is truth,\" Todd said.",
  "\"No, it isn't truth.",
  "Truth isn't truth,\" Giuliani said.",
  "\"The president of the United States says, 'I didn't ... ' \"\n\n\"Truth isn't truth?\"",
  "Todd replied, adding, \"This is going to become a bad meme.\"",
  "Giuliani continued, \"Donald Trump says.",
  "'I didn't talk about Flynn with Comey.'",
  "Comey says, 'You did talk about it,' so tell me what the truth is.\"",
  "Trump's personal legal team has urged the special counsel to wrap up its investigations by the the midterm elections this fall, and Trump has maintained his innocence through the duration of the inquiry, calling the Mueller investigation a \"witch hunt.\""
]